[
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 41,
        "details": [
            {
                "category": "วอ.362 การเก็บข้อมูลอุตสาหกรรมและการวัดผล",
                "subcategories": {
                    "ความสำคัญของข้อมูลในอุตสาหกรรม": "รายละเอียดไม่ได้ระบุ",
                    "ชนิดของข้อมูลและเครื่องมือบันทึกข้อมูลต่าง ๆ": "รายละเอียดไม่ได้ระบุ",
                    "การจำแนกแหล่งของการเก็บรวบรวมข้อมูลในอุตสาหกรรม": "รายละเอียดไม่ได้ระบุ",
                    "การออกแบบและติดตั้งระบบในการเก็บรวบรวมข้อมูล": "รายละเอียดไม่ได้ระบุ",
                    "การรวบรวมข้อมูลจากกระบวนการและการแสดงผล": "รายละเอียดไม่ได้ระบุ",
                    "การประยุกต์ใช้งาน": "รายละเอียดไม่ได้ระบุ"
                }
            },
            {
                "category": "วอ.371 วิทยาการข้อมูลสำหรับวิศวกรรม",
                "subcategories": {
                    "แนะนำวิทยาการข้อมูล": "รายละเอียดไม่ได้ระบุ",
                    "ระบบฐานข้อมูล": "รายละเอียดไม่ได้ระบุ",
                    "โปรแกรมไพธอน": "รายละเอียดไม่ได้ระบุ",
                    "การวิเคราะห์ข้อมูลสำหรับวิศวกรรมด้วยไพธอน": "รายละเอียดไม่ได้ระบุ",
                    "การแสดงผลข้อมูล": "รายละเอียดไม่ได้ระบุ"
                }
            },
            {
                "category": "วอ.380 การเยี่ยมชมอุตสาหกรรม",
                "subcategories": {
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.362",
                    "กิจกรรม": "นักศึกษาเยี่ยมชมโรงงานอุตสาหกรรม หรือหน่วยงานราชการ หรือรัฐวิสาหกิจ",
                    "การประเมินผล": "นักศึกษาจะต้องส่งรายงานการเยี่ยมชมโรงงานให้แก่อาจารย์ที่ปรึกษา วัดผลด้วยระดับ S หรือ U"
                }
            },
            {
                "category": "วอ.390 การฝึกงาน",
                "subcategories": {
                    "วิชาบังคับก่อน": "สอบได้ วอ.311, วอ.341 และ วอ.362",
                    "ระยะเวลา": "ไม่น้อยกว่า 6 สัปดาห์ติดต่อกัน (ไม่น้อยกว่า 240 ชั่วโมง)",
                    "สถานที่ฝึกงาน": "บริษัท โรงงาน หรือหน่วยงานราชการ หรือรัฐวิสาหกิจที่ภาควิชาเห็นชอบ",
                    "การประเมินผล": "ทำรายงานเสนอต่อภาควิชาวิศวกรรมอุตสาหการ พร้อมทั้งมีใบรับรองผลการปฏิบัติงานจากผู้ควบคุม การประเมินผลเป็นระดับใช้ได้ (S) หรือใช้ไม่ได้ (U)",
                    "ข้อจำกัด": "นักศึกษาไม่สามารถจดทะเบียนเรียนรายวิชาอื่นร่วมด้วย"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 19,
        "details": [
            {
                "category": "ปีการศึกษาที่ 2",
                "subcategories": {
                    "ภาคเรียนที่ 1": {
                        "หน่วยกิตรวม": 21,
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "วคม.106/วคม.107/มธ.103/มธ.107",
                                "ชื่อวิชา": "ความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน/เทคโนโลยีอัจฉริยะเพื่อชีวิตยุคใหม่/ชีวิตกับความยั่งยืน/ทักษะดิจิทัลกับการแก้ปัญหา",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "ค.214",
                                "ชื่อวิชา": "สมการเชิงอนุพันธ์",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.261",
                                "ชื่อวิชา": "สถิติวิศวกรรม",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วก.290",
                                "ชื่อวิชา": "กลศาสตร์ของไหลเบื้องต้น",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.211",
                                "ชื่อวิชา": "เธอร์โมไดนามิกส์",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วฟ.209",
                                "ชื่อวิชา": "วิศวกรรมไฟฟ้าเบื้องต้น",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วย.202",
                                "ชื่อวิชา": "กลศาสตร์วิศวกรรม-สถิตยศาสตร์",
                                "หน่วยกิต": 3
                            }
                        ]
                    },
                    "ภาคเรียนที่ 2": {
                        "หน่วยกิตรวม": 19,
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "มธ.102/มธ.106",
                                "ชื่อวิชา": "ชีวิตกับสุนทรียภาพ/ความคิดสร้างสรรค์และการสื่อสาร",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วศว.101",
                                "ชื่อวิชา": "เทคโนโลยีสารสนเทศสมัยใหม่เบื้องต้น",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วอ.230",
                                "ชื่อวิชา": "การเขียนแบบทางวิศวกรรมอุตสาหการ",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วอ.250",
                                "ชื่อวิชา": "กรรมวิธีการผลิต",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.352",
                                "ชื่อวิชา": "ปฏิบัติการวัสดุศาสตร์",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "ค.251",
                                "ชื่อวิชา": "วิธีเชิงตัวเลขและการประยุกต์",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วก.220",
                                "ชื่อวิชา": "กลศาสตร์วิศวกรรม-พลศาสตร์",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วฟ.203",
                                "ชื่อวิชา": "ปฏิบัติการทางวิศวกรรมไฟฟ้าเบื้องต้น",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วย.221",
                                "ชื่อวิชา": "กลศาสตร์ของแข็ง",
                                "หน่วยกิต": 3
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 29,
        "details": [
            {
                "category": "วิชาเฉพาะ",
                "subcategories": {
                    "วิชาเฉพาะพื้นฐาน": {
                        "กลุ่มวิชาพื้นฐานทางคณิตศาสตร์และวิทยาศาสตร์": [
                            {
                                "รหัสวิชา": "ค.111",
                                "ชื่อวิชา": "แคลคูลัสพื้นฐาน",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อวิชาภาษาอังกฤษ": "MA111 Fundamentals of Calculus",
                                "คำอธิบายรายวิชา": "อุปนัยเชิงคณิตศาสตร์ ระบบจำนวนและฟังก์ชันเบื้องต้น แคลคูลัสอนุพันธ์และปริพันธ์ของฟังก์ชันตัวแปรเดียว ลิมิตความต่อเนื่อง อนุพันธ์ และการประยุกต์อนุพันธ์ ปฏิยานุพันธ์ เทคนิคการหาปริพันธ์และการประยุกต์ปริพันธ์ ปริพันธ์ไม่ตรงแบบ อนุกรม ทฤษฎีบทเทย์เลอร์สำหรับฟังก์ชันพื้นฐาน การหาปริพันธ์เชิงตัวเลข",
                                "หมายเหตุ": "ไม่นับหน่วยกิตให้ผู้ที่กำลังศึกษาหรือสอบได้ ค.211 หรือ ค.216 หรือ ค.218 หรือ คป.101",
                                "คำอธิบายรายวิชาภาษาอังกฤษ": "Mathematical induction, number systems and elementary functions, calculus of one variable functions, limit, continuity, the derivative and its applications, antiderivatives, techniques of integrations and its applications, improper integrals, series, Taylor's Theorem for basic functions, numerical integration.",
                                "หมายเหตุภาษาอังกฤษ": "Note: No credits for students who are currently taking or have earned credits of MA211 or MA216 or MA218 or AM101."
                            },
                            {
                                "รหัสวิชา": "ค.112",
                                "ชื่อวิชา": "เรขาคณิตวิเคราะห์และแคลคูลัสประยุกต์",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อวิชาภาษาอังกฤษ": "MA112 Analytic Geometry and Applied Calculus",
                                "วิชาบังคับก่อน": "สอบได้ ค.111",
                                "คำอธิบายรายวิชา": "เรขาคณิตวิเคราะห์ พิกัดเชิงขั้ว พีชคณิตของเวกเตอร์ในปริภูมิสามมิติ เส้น ระนาบและผิวในปริภูมิสามมิติ ลิมิต ความต่อเนื่อง อนุพันธ์และปริพันธ์ของฟังก์ชันค่าเวกเตอร์ แคลคูลัสของฟังก์ชันค่าจริงหลายตัวแปรและการประยุกต์ ปริพันธ์ตามเส้นเบื้องต้น ปริพันธ์ตามผิว ทฤษฎีบทของเกาส์ ทฤษฎีบทของกรีนและสโตกส์",
                                "วิชาบังคับก่อนภาษาอังกฤษ": "Prerequisite: Have earned credits of MA111",
                                "คำอธิบายรายวิชาภาษาอังกฤษ": "Analytic geometry, polar coordinates, vector algebra in three dimensional spaces, lines, planes and surfaces in three dimensional spaces, limit, continuity, derivatives and integrals of vector valued functions, calculus of real-valued functions of several variables and their applications, introduction to line integrals, surface integrals, Gauss's Theorem, Green's Theorem and Stokes' Theorem."
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 44,
        "details": [
            {
                "category": "วก.210 กลศาสตร์วัสดุ",
                "subcategories": {
                    "หัวข้อหลัก": "กลศาสตร์วัสดุ",
                    "Prerequisites": "Have earned credits of CE202",
                    "เนื้อหา": "Reviews of basic principles governing the laws of motion. Kinematics of particles and rigid bodies: displacement, velocity, and acceleration. Absolute and relative motion. Kinetics of particles and rigid bodies: force, momentum, work and energy. Newton's second law of motion. Principle of work and energy. Principle of impulse and momentum. Centripetal motion. Introduction to vibration.",
                    "หัวข้อย่อย": [
                        "พลังงาน",
                        "หลักการของการดลและโมเมนตัม",
                        "การเคลื่อนที่มีความเร่งเข้าสู่ศูนย์กลาง",
                        "ความรู้เบื้องต้นเกี่ยวกับการสั่นสะเทือน"
                    ]
                }
            },
            {
                "category": "วก.290 กลศาสตร์ของไหลเบื้องต้น",
                "subcategories": {
                    "หน่วยกิต": "3 (3-0-6)",
                    "Prerequisites": "Have earned credits of SC133",
                    "เนื้อหา": "Properties of fluids. Fluid statics. Buoyancy. Momentum equation. Energy equation. Kinematics of incompressible and non-viscous fluid flow. Dimensional analysis and similitude. Incompressible and viscous fluid flow. Fluid measurement. Flow in pipes. Introduction to design of piping system.",
                    "หัวข้อย่อย": [
                        "คุณสมบัติของของไหล",
                        "สถิตยศาสตร์ของของไหล",
                        "การลอยตัว",
                        "สมการโมเมนตัม",
                        "สมการพลังงาน",
                        "จลนศาสตร์ของการไหลที่อัดตัวไม่ได้ และไม่มีความหนืด",
                        "การวิเคราะห์มิติและความเหมือนกัน",
                        "การวัดการไหล",
                        "การไหลในท่อ",
                        "การออกแบบระบบท่อเบื้องต้น"
                    ]
                }
            },
            {
                "category": "วก.390 ปฏิบัติการพื้นฐานวิศวกรรมเครื่องกล",
                "subcategories": {
                    "หน่วยกิต": "1 (0-3-1)",
                    "Prerequisites": "Have earned credits of ME290",
                    "เนื้อหา": "การใช้เครื่องมือวัดพื้นฐานทางด้านวิศวกรรมเครื่องกล การวัดขนาด ความเร็วเชิงเส้นและเชิงมุม อัตราการไหล แรง ความเค้น ความเครียด ความดัน อุณหภูมิ การวิเคราะห์ความผิดพลาดในการทดลอง การวิเคราะห์ข้อมูลและนำเสนอผลการทดลอง",
                    "หัวข้อย่อย": [
                        "การใช้เครื่องมือวัดพื้นฐานทางด้านวิศวกรรมเครื่องกล",
                        "การวัดขนาด",
                        "ความเร็วเชิงเส้นและเชิงมุม",
                        "อัตราการไหล",
                        "แรง",
                        "ความเค้น",
                        "ความเครียด",
                        "ความดัน",
                        "อุณหภูมิ",
                        "การวิเคราะห์ความผิดพลาดในการทดลอง",
                        "การวิเคราะห์ข้อมูลและนำเสนอผลการทดลอง"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 39,
        "details": [
            {
                "category": "ระบบอัตโนมัติ",
                "subcategories": {
                    "ระบบนิวแมติกส์": "ระบบการทำงานด้วยแรงดันอากาศ",
                    "ระบบไฮดรอลิกส์": "ระบบการทำงานด้วยแรงดันของเหลว",
                    "เซนเซอร์": "อุปกรณ์ตรวจจับในระบบอัตโนมัติ",
                    "แอคจูเอเตอร์": "อุปกรณ์ทำงานในระบบอัตโนมัติ",
                    "วงจรนิวแมติกส์": "วงจรควบคุมระบบนิวแมติกส์",
                    "วงจรไฟฟ้า": "วงจรควบคุมไฟฟ้าสำหรับเครื่องจักรกลอัตโนมัติ"
                }
            },
            {
                "category": "การควบคุมอัตโนมัติ",
                "subcategories": {
                    "PLC": "การควบคุมด้วยอุปกรณ์ควบคุมแบบโปรแกรมได้",
                    "ไมโครคอนโทรลเลอร์": "การควบคุมด้วยไมโครคอนโทรลเลอร์",
                    "IoT": "การควบคุมผ่านอินเทอร์เน็ตของสรรพสิ่ง",
                    "หุ่นยนต์อุตสาหกรรม": "การใช้หุ่นยนต์ในงานอุตสาหกรรม"
                }
            },
            {
                "category": "ปฏิบัติการระบบอัตโนมัติ",
                "subcategories": {
                    "ระบบนิวแมติกส์": "ฝึกปฏิบัติการควบคุมระบบนิวแมติกส์",
                    "นิวแมติกส์ไฟฟ้า": "ฝึกปฏิบัติการควบคุมระบบนิวแมติกส์ร่วมกับไฟฟ้า",
                    "PLC": "ฝึกปฏิบัติการควบคุมด้วย PLC",
                    "หุ่นยนต์อุตสาหกรรม": "ฝึกปฏิบัติการควบคุมหุ่นยนต์อุตสาหกรรม",
                    "ไมโครคอนโทรลเลอร์": "ฝึกปฏิบัติการใช้ไมโครคอนโทรลเลอร์",
                    "IoT": "ฝึกปฏิบัติการใช้ IoT ในงานอุตสาหกรรม",
                    "เซ็นเซอร์อุตสาหกรรม": "ฝึกปฏิบัติการใช้เซ็นเซอร์ในงานอุตสาหกรรม"
                }
            },
            {
                "category": "การวิเคราะห์ข้อมูลอุตสาหกรรม",
                "subcategories": {
                    "การจำแนกประเภทข้อมูล": "หลักการจำแนกข้อมูลทางอุตสาหกรรม",
                    "การรวบรวมข้อมูล": "วิธีการรวบรวมข้อมูลทางอุตสาหกรรม",
                    "การนำเสนอข้อมูล": "เทคนิคการนำเสนอข้อมูลทางอุตสาหกรรม",
                    "การวิเคราะห์การแจกแจงของข้อมูล": "การศึกษาลักษณะการกระจายตัวของข้อมูล",
                    "การทดสอบสมมติฐาน": "การทดสอบสมมติฐานแบบต่างๆ เช่น กรณีตัวอย่างเดียว สองตัวอย่าง และแบบคู่",
                    "การวิเคราะห์ความแปรปรวน": "การวิเคราะห์ปัจจัยเดียวอย่างสมบูรณ์",
                    "การวิเคราะห์ความสัมพันธ์เชิงเส้น": "การศึกษาความสัมพันธ์แบบเชิงเส้นของข้อมูล",
                    "การวิเคราะห์แบบไม่ใช้พารามิเตอร์": "การวิเคราะห์ปัจจัยเดียวแบบไม่ใช้พารามิเตอร์",
                    "การใช้โปรแกรมวิเคราะห์ข้อมูล": "การใช้ซอฟต์แวร์ในการวิเคราะห์และตีความผลข้อมูล"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 67,
        "details": [
            {
                "category": "วอ.261 การศึกษาการทำงานในอุตสาหกรรม",
                "subcategories": {
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.261",
                    "เนื้อหา": {
                        "การเคลื่อนไหวและเวลา": "ใช้ในการทำงานของมนุษย์",
                        "หลักการเศรษฐศาสตร์การเคลื่อนไหว": "ใช้ในการออกแบบและปรับปรุงวิธีการทำงาน",
                        "ปฏิสัมพันธ์ระหว่างคนกับเครื่องจักร": "ศึกษาความสัมพันธ์ในด้านการเคลื่อนไหว เวลา และการไหลของวัสดุในกระบวนการ",
                        "วิธีการเก็บข้อมูลและเครื่องมือ": [
                            "แผนภูมิกระบวนการไหล",
                            "แผนภูมิกระบวนการผลิต",
                            "แผนภูมิการทำงานหลายแบบ",
                            "การศึกษาการเคลื่อนไหวแบบจุลภาค",
                            "แผนภูมิ SIMO"
                        ],
                        "การกำหนดเวลามาตรฐาน": "รวมถึงการสุ่มงาน และการใช้ปัจจัยการจัดอันดับ",
                        "การวิเคราะห์งาน": "เพื่อปรับปรุงวิธีการผลิต",
                        "การจ่ายค่าจ้าง": "และการวางแผนสิ่งจูงใจ"
                    }
                }
            },
            {
                "category": "วอ.312 การวางแผนและควบคุมการผลิต",
                "subcategories": {
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.364",
                    "เนื้อหา": {
                        "แนะนำระบบการวางแผนและควบคุมการผลิต": "",
                        "การใช้คณิตศาสตร์ประยุกต์และคอมพิวเตอร์": "ในการแก้ปัญหาระบบการวางแผนและควบคุมการผลิต",
                        "เทคนิคการพยากรณ์": "",
                        "การวางแผนการผลิต": "",
                        "การวางแผนความต้องการวัสดุ": "",
                        "การจัดการพัสดุคงคลัง": "",
                        "ระบบการผลิตแบบทันเวลาพอดี/เทคนิคการผลิตแบบลีน": "",
                        "การจัดการโซ่อุปทานและการจัดการโซ่อุปทานแบบยั่งยืน": "",
                        "เทคนิคการจัดลำดับงาน": "",
                        "การจัดการโครงการโดยใช้เทคนิค PERT/CPM": "",
                        "การจัดสมดุลสายการผลิต": ""
                    }
                }
            },
            {
                "category": "วอ.314 การบริหารโครงการทางวิศวกรรม",
                "subcategories": {
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.304",
                    "เนื้อหา": {
                        "หลักการของการจัดการโครงการทางวิศวกรรม": "",
                        "การคัดเลือกโครงการ": "",
                        "การศึกษาความเป็นไปได้ของโครงการ": "",
                        "การวางแผน": "",
                        "การดำเนินงานและการควบคุมโครงการ": "",
                        "โปรแกรมคอมพิวเตอร์ในการบริหาร": ""
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 45,
        "details": [
            {
                "category": "วคม.211 เธอร์โมไดนามิกส์",
                "subcategories": {
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา": "แนะนำสัญลักษณ์ต่าง ๆ ที่ใช้ในวิชาเธอร์โมไดนามิกส์ คุณสมบัติของสารบริสุทธิ์ สมการสภาวะของแก๊สอุดมคติและแก๊สจริง ความสามารถการอัดตัว แผนภูมิและตารางทางเธอร์โมไดนามิกส์ กฎข้อที่หนึ่งและสองทางเธอร์โมไดนามิกส์ เอนโทรปี การประยุกต์กฎข้อที่หนึ่ง กฎข้อที่สองทางเธอร์โมไดนามิกส์ และเอนโทรปี การคำนวณทางเธอร์โมไดนามิกส์ของกระบวนการจริง",
                    "หมายเหตุ": "(สำหรับนักศึกษาสาขาวิชาอื่น)",
                    "Course_Description": "Introduction to thermodynamics and engineering thermodynamics. Definitions of some technical terms related to engineering thermodynamics. Properties of pure substances. Equation of state of ideal and real gases. Compressibility. Thermodynamic diagrams and tables. First law of thermodynamics for closed system and for control volume. Second law of thermodynamics. Entropy. Applications of first law, second law and entropy on thermodynamics. Calculations for real processes.",
                    "Note": "(For students outside the Department of Chemical Engineering)"
                }
            },
            {
                "category": "วฟ.203 ปฏิบัติการทางวิศวกรรมไฟฟ้าเบื้องต้น",
                "subcategories": {
                    "หน่วยกิต": "1 (0-3-1)",
                    "วิชาบังคับก่อน": "สอบได้หรือศึกษาพร้อมกับ วฟ.209 หรือ วฟ.240 หรือ วฟ.207",
                    "คำอธิบายรายวิชา": "เน้นฝึกทักษะทางไฟฟ้าขั้นพื้นฐาน เรียนรู้หลักการทำงานวิธีใช้งานอุปกรณ์เครื่องมือต่าง ๆ ในการประกอบวงจรไฟฟ้าและอิเล็กทรอนิกส์ เพื่อให้ประกอบวงจรไฟฟ้าเบื้องต้นได้ เรียนรู้อิเล็กทรอนิกส์เบื้องต้น ระบบวิเคราะห์และสามารถแก้ปัญหาทางวงจรไฟฟ้าเบื้องต้นและอิเล็กทรอนิกส์เบื้องต้นได้ เรียนรู้วิธีการใช้ซอฟต์แวร์บางอย่างในการวิเคราะห์วงจรไฟฟ้าอิเล็กทรอนิกส์เบื้องต้น",
                    "หมายเหตุ": "(สำหรับนักศึกษาสาขาวิชาวิศวกรรมเครื่องกล อุตสาหการ)",
                    "Prerequisites": "Have earned credits of or taking LE209 or LE240 or LE207 in the same semester",
                    "Course_Description": "This course focuses on practicing skills in basic electrical engineering. Learn how to use equipment and some electrical elements. Connect some electrical circuits. Identify,"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 35,
        "details": [
            {
                "category": "วอ.300 ปฏิบัติการวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.311",
                    "ปฏิบัติการสถิติและการวิเคราะห์ข้อมูลพื้นฐาน": "การวิเคราะห์ข้อมูลอุตสาหกรรมจริง การทดสอบสมมติฐานแบบหนึ่งตัวอย่างและสองตัวอย่าง การวิเคราะห์ความแปรปรวนแบบทางเดียว การวิเคราะห์ความแปรปรวนแบบโมเดลเชิงเส้น การวิเคราะห์ความแปรปรวนแบบไม่ใช้พารามิเตอร์",
                    "ปฏิบัติการควบคุมคุณภาพ": "แผนภูมิ X̄-R, X̄-S, การวิเคราะห์ระบบการวัด การวิเคราะห์ความสามารถของกระบวนการ การชักตัวอย่างและความเชื่อถือได้",
                    "ปฏิบัติการวิจัยดำเนินงาน": "Excel สำหรับ linear programming และ transport/assignment",
                    "ปฏิบัติการการศึกษาการปฏิบัติงานในอุตสาหกรรม": "การปรับปรุงการทำงาน และการวิเคราะห์หาเวลามาตรฐาน"
                }
            },
            {
                "category": "วอ.302 เศรษฐศาสตร์วิศวกรรม",
                "subcategories": {
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": [
                        "ค่าของเงินตามเวลา",
                        "การวิเคราะห์โครงการทางวิศวกรรมเชิงเศรษฐศาสตร์",
                        "การวิเคราะห์การแทนที่",
                        "ค่าเสื่อมราคา",
                        "ภาษี",
                        "การวิเคราะห์และตัดสินใจภายใต้ผลกระทบของภาษี",
                        "การวิเคราะห์และตัดสินใจเมื่อพิจารณาความเสี่ยงและความไม่แน่นอน"
                    ]
                }
            },
            {
                "category": "วอ.311 การศึกษาการปฏิบัติงานทางอุตสาหกรรม",
                "subcategories": {
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.261",
                    "เนื้อหา": [
                        "การเคลื่อนไหวและเวลาในการทำงานของคน",
                        "การใช้หลักเศรษฐศาสตร์การเคลื่อนไหวในการออกแบบและปรับปรุงการทำงาน",
                        "การปฏิสัมพันธ์ระหว่างคน-เครื่องจักร",
                        "ความสัมพันธ์ในการเคลื่อนไหว เวลาและการไหลของวัสดุที่ใช้ในการผลิต",
                        "วิธีการเก็บรวบรวมข้อมูลและเครื่องมือต่างๆ",
                        "การหาเวลามาตรฐาน",
                        "การสุ่มงาน และการใช้ปัจจัยในการประเมินค่า",
                        "การวิเคราะห์งานเพื่อปรับปรุงวิธีการผลิต",
                        "การจ่ายเงินค่าจ้างและจัดทำแผนการจูงใจในการทำงาน"
                    ],
                    "เครื่องมือที่ใช้": [
                        "แผนภูมิการไหลของกระบวนการ",
                        "แผนภูมิการผลิต",
                        "แผนภูมิการทำงานหลายแบบ",
                        "การศึกษาการเคลื่อนไหวอย่างละเอียด",
                        "แผนภูมิไซโม"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 53,
        "details": [
            {
                "category": "วอ.417 การออกแบบข้อมูลและการหาค่าที่เหมาะสมที่สุดสำหรับการดำเนินงานภาคธุรกิจ",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "IE417 Data Design and Optimisation for Business Operations",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วอ.364",
                    "คำอธิบายรายวิชา_ภาษาไทย": "การสร้างแบบจำลองและการวิเคราะห์การตัดสินใจสำหรับผลการดำเนินงานธุรกิจ โครงข่ายงานเพื่อการตัดสินใจ แบบจำลองทางคณิตศาสตร์และพรรณา แบบจำลองมาร์คอฟสำหรับประยุกต์ใช้ทางธุรกิจ แบบจำลองกำหนดการเชิงพลวัตเพื่อสนับสนุนการตัดสินใจ",
                    "คำอธิบายรายวิชา_ภาษาอังกฤษ": "Business Performance Modelling & Decision Analysis. Decision Networks. Descriptive and Mathematical Models. Business Applications via Markov Chain Models. Decision Supporting Dynamic Programming Models."
                }
            },
            {
                "category": "วอ.418 การศึกษาความเป็นไปได้ของโครงการ",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "IE418 Project Feasibility Study",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.302",
                    "คำอธิบายรายวิชา_ภาษาไทย": "ความสำคัญของความเป็นไปได้ของโครงการ การศึกษาความเป็นไปได้ด้านการตลาด การศึกษาความเป็นไปได้ด้านวิศวกรรม การศึกษาความเป็นไปได้ด้านการดำเนินงาน การศึกษาความเป็นไปได้ด้านการเงิน",
                    "คำอธิบายรายวิชา_ภาษาอังกฤษ": "Importance of project feasibility study. Marketing feasibility study. Feasibility study in engineering and technology. Operational feasibility study. Financial feasibility study."
                }
            },
            {
                "category": "วอ.419 การบริหารโครงการสำหรับวิศวกร",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "IE419 Project Management for Engineer",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.312",
                    "คำอธิบายรายวิชา_ภาษาไทย": "หลักการของการจัดการโครงการ การคัดเลือกโครงการ การศึกษาความเป็นไปได้ของโครงการ การวางแผน การดำเนินงานและการควบคุมโครงการ โปรแกรมคอมพิวเตอร์ในการบริหารโครงการ การติดตามและประเมินผลโครงการ กรณีศึกษาการประยุกต์ใช้ความรู้การบริหารโครงการกับงานด้านวิศวกรรมอุตสาหการ",
                    "คำอธิบายรายวิชา_ภาษาอังกฤษ": "This information is not provided in the given reference document."
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 59,
        "details": [
            {
                "category": "ความรู้พื้นฐานเกี่ยวกับเทคโนโลยีการพิมพ์ 3 มิติและการผลิตแบบเพิ่มเนื้อวัสดุ",
                "subcategories": {
                    "Introduction_to_3D_Printing": "Basic knowledge of 3D printing technology and additive manufacturing",
                    "Classification_of_3D_Printing_Processes": "ประเภทของการพิมพ์ 3 มิติ",
                    "Process_Selection": "การเลือกกระบวนการพิมพ์ 3 มิติ",
                    "3D_Modelling": "การสร้างแบบจำลอง 3 มิติ",
                    "Hardware_Structure": "โครงสร้างเครื่องพิมพ์ 3 มิติ",
                    "Slicing_and_Printing_Parameters": "การแบ่งชั้นและปัจจัยในการพิมพ์",
                    "Post_Processing": "กระบวนการหลังการพิมพ์ 3 มิติและการเชื่อมต่อ",
                    "Common_Problems": "ปัญหาทั่วไปในการพิมพ์ 3 มิติและวิธีแก้ปัญหา",
                    "4D_Printing": "การพิมพ์ 4 มิติและอนาคตของการผลิตแบบเพิ่มเนื้อวัสดุ",
                    "Industrial_Case_Studies": "กรณีศึกษาของการประยุกต์ใช้การพิมพ์ 3 มิติ ในอุตสหกรรม"
                }
            },
            {
                "category": "การออกแบบแม่พิมพ์",
                "subcategories": {
                    "Course_Code": "วอ.456",
                    "Course_Name": "การออกแบบแม่พิมพ์",
                    "Credits": "3 (3-0-6)",
                    "Prerequisites": "สอบได้ วอ.250",
                    "Topics": {
                        "Mold_Design_Principles": "หลักการออกแบบแม่พิมพ์",
                        "Types_of_Molds": "แม่พิมพ์ปั๊มโลหะ, แม่พิมพ์ฉีดพลาสติก",
                        "Material_Selection": "การเลือกวัสดุ",
                        "Computer_Aided_Analysis": "การใช้คอมพิวเตอร์ช่วยในการวิเคราะห์ทางวิศวกรรม",
                        "Surface_Treatment": "การทำผิวของแม่พิมพ์โดยใช้กระบวนการทางเคมีและความร้อน",
                        "Coating_and_Hardening": "กระบวนการเคลือบและชุบแข็ง",
                        "Mold_Standards": "มาตรฐานแม่พิมพ์สำหรับการขึ้นรูปชิ้นงานแบบต่าง ๆ"
                    }
                }
            },
            {
                "category": "เทคโนโลยีพลาสติก",
                "subcategories": {
                    "Course_Code": "วอ.457",
                    "Course_Name": "เทคโนโลยีพลาสติก",
                    "Credits": "3 (3-0-6)",
                    "Prerequisites": "สอบได้ วอ.121",
                    "Topics": {
                        "Industry_Introduction": "แนะนำอุตสาหกรรมพลาสติก",
                        "Basic_Concepts": "แนวความคิดเบื้องต้นของพลาสติกและการขึ้นรูปผลิตภัณฑ์",
                        "Plastic_Flow": "หลักการไหลของพลาสติกในกระบวนการขึ้นรูปและการประยุกต์ใช้ในวิศวกรรมการผลิตพลาสติก",
                        "Mold_Design": "การออกแบบแม่พิมพ์ฉีดพลาสติกเบื้องต้น",
                        "Forming_Methods": {
                            "Extrusion": "การขึ้นรูปพลาสติกด้วยวิธีการอัดรีด",
                            "Injection": "การฉีด",
                            "Blowing": "การเป่า",
                            "Compression": "การกดอัด",
                            "Thermoforming": "เทอร์โมฟอร์มมิ่ง"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 38,
        "details": [
            {
                "category": "Industrial Safety",
                "subcategories": {
                    "Accident_Analysis": "Theories of accident causation and analysis",
                    "Accident_Prevention": "Prevention of accidents in manufacturing industry",
                    "Risk_Analysis": "Industrial risk analysis and assessments",
                    "Safety_Management": "Principles of safety management and loss prevention management",
                    "Safety_Planning": "Planning and design for safety such as plant layout, fire extinguishing system, personal protective equipment, machine safeguarding, maintenance, chemical and radioactive Management",
                    "Safety_Laws": "Safety law in both factory and labour",
                    "Safety_Standards": "Industrial safety standards and industrial hygiene",
                    "Environmental_Control": "Basic of environmental control",
                    "Industrial_Psychology": "Basic of industrial psychology"
                }
            },
            {
                "category": "Manufacturing Processes Laboratory",
                "subcategories": {
                    "Course_Code": "IE351",
                    "Credit_Hours": "1 (0-3-3)",
                    "Lab_Activities": "Layout, turning, milling, welding, CNC machining, Electrical Discharge Machining, sheet metal forming and plastic forming"
                }
            },
            {
                "category": "Material Science Laboratory",
                "subcategories": {
                    "Course_Code": "IE352",
                    "Credit_Hours": "1 (0-3-3)",
                    "Prerequisites": "Have taken IE121",
                    "Lab_Activities": "Microstructure determination, hardness measurement, impact test, bending test, composition analyses using emission spectrometer, tensile test, and non destructive test"
                }
            },
            {
                "category": "Automated Manufacturing Technology",
                "subcategories": {
                    "Course_Code": "IE353",
                    "Credit_Hours": "3 (3-0-6)",
                    "Prerequisites": "Have taken EE209"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 26,
        "details": [
            {
                "category": "หลักการพื้นฐานคอมพิวเตอร์",
                "subcategories": {
                    "องค์ประกอบคอมพิวเตอร์": "การทำงานร่วมกับฮาร์ดแวร์และซอฟต์แวร์",
                    "การเขียนโปรแกรมภาษาคอมพิวเตอร์": "การฝึกฝนการเขียนโปรแกรมคอมพิวเตอร์",
                    "Computer_concepts": "Computer components: Hardware and software interaction",
                    "Current_programming_Language": "Programming practices"
                }
            },
            {
                "category": "วคม.106 ความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน",
                "subcategories": {
                    "นิเวศวิทยา": "พื้นฐานเกี่ยวกับนิเวศวิทยาเพื่อประโยชน์สำหรับการอนุรักษ์ทรัพยากรธรรมชาติและสิ่งแวดล้อม",
                    "การประเมินวัฏจักรชีวิต": "ลักษณะของมลพิษสิ่งแวดล้อมและผลกระทบต่อสังคม",
                    "ความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน": "แนวคิดต่าง ๆ เกี่ยวกับความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน",
                    "จริยธรรมสิ่งแวดล้อม": "การออกแบบที่ยั่งยืน",
                    "การใช้พลังงานของประเทศไทย": [
                        "การใช้พลังงานในภาคขนส่ง",
                        "การใช้พลังงานในภาคอุตสาหกรรมและอาคารธุรกิจ"
                    ],
                    "การพัฒนาพลังงานที่ยั่งยืน": [
                        "แนวทางการพัฒนาพลังงานที่ยั่งยืนสำหรับประเทศไทย",
                        "การผลิตไฟฟ้าสำหรับประเทศไทย",
                        "การประหยัดพลังงาน"
                    ],
                    "พลังงานทางเลือก": [
                        "พลังงานแสงอาทิตย์",
                        "พลังงานลม",
                        "พลังงานชีวมวล",
                        "การผลิตเอทานอล",
                        "การผลิตไบโอดีเซล",
                        "เทคโนโลยีถ่านหินสะอาด",
                        "พลังงานนิวเคลียร์"
                    ]
                }
            },
            {
                "category": "วคม.107 เทคโนโลยีอัจฉริยะเพื่อชีวิตยุคใหม่",
                "subcategories": {
                    "การพัฒนาเทคโนโลยี": [
                        "การพัฒนาเทคโนโลยีในอดีต",
                        "การปฏิวัติอุตสาหกรรมครั้งที่สี่"
                    ],
                    "เทคโนโลยีเพื่อสังคม": [
                        "เทคโนโลยีสังคมผู้สูงอายุ",
                        "การเปลี่ยนแปลงสภาวะแวดล้อมของโลกและผลกระทบ",
                        "เทคโนโลยีเพื่อการพัฒนาอย่างยั่งยืน"
                    ],
                    "เทคโนโลยีพลังงาน": [
                        "ฟิวชันเทคโนโลยี",
                        "พลังงานสะอาด",
                        "ยานยนต์ไฟฟ้า",
                        "ระบบกักเก็บพลังงาน"
                    ],
                    "เทคโนโลยีชีวภาพ": [
                        "เซลล์ต้นกำเนิด"
                    ],
                    "วัสดุและการผลิต": [
                        "วัสดุแห่งอนาคต",
                        "นาโนเทคโนโลยี",
                        "การพิมพ์ 3 มิติ"
                    ],
                    "เทคโนโลยีสารสนเทศและการสื่อสาร": [
                        "บิ๊กเดต้า",
                        "5จี",
                        "อินเตอร์เน็ตของสรรพสิ่ง",
                        "ปัญญาประดิษฐ์"
                    ],
                    "เทคโนโลยีเพื่อความมั่นคง": "เทคโนโลยีเพื่อความมั่นคง"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 25,
        "details": [
            {
                "category": "General Education Courses",
                "subcategories": {
                    "Language Skills": {
                        "Course_Code": "TU050",
                        "Course_Name": "English Skill Development",
                        "Description": "Development of English communication skills, including listening, speaking, reading and writing. Practice of language, vocabulary and expressions used in academic and social contexts."
                    },
                    "Aesthetics": {
                        "Course_Code": "TU102",
                        "Course_Name": "Life & Aesthetics",
                        "Description": "The course investigates aesthetic and fundamental elements of art and built environment. These include appreciation in value and meaning, analyses and criticisms, and connections to lives and social contexts."
                    },
                    "Creativity_and_Communication": {
                        "Course_Code": "TU106",
                        "Course_Name": "Creativity and Communication",
                        "Description": "Creative thought processes, with critical thinking as an important part, as well as communication of these thoughts that lead to suitable results in social, cultural and environmental contexts, at personal, organisational and social levels."
                    }
                }
            },
            {
                "category": "Mathematics, Science, and Technology",
                "subcategories": {
                    "Chemistry": {
                        "Course_Code": "SC123",
                        "Course_Name": "Fundamental Chemistry",
                        "Description": "Atomic structure, Stoichiometry, Chemical bonds, Properties of Representative and Transition Elements, Gases, Liquids and Solutions, Solids, themochemistry, Chemical Kinetics, Chemical Equilibrium and Acid and Base and Electrochemistry."
                    },
                    "Computer_Programming": {
                        "Course_Code": "CN101",
                        "Course_Name": "Introduction to Computer Programming",
                        "Description": "No detailed description provided in the reference document."
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 68,
        "details": [
            {
                "category": "วอ.304 การวางแผนและควบคุมโครงการ",
                "subcategories": {
                    "รหัสวิชา": "วอ.304",
                    "ชื่อวิชา": "การวางแผนและควบคุมโครงการ",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.304",
                    "คำอธิบายรายวิชา": "หลักการบริหารโครงการทางวิศวกรรม การคัดเลือกโครงการ การศึกษาความเป็นไปได้ของโครงการ การวางแผน การดำเนินงาน และการควบคุมโครงการ ซอฟต์แวร์การบริหารโครงการ การติดตามและประเมินผลโครงการ กรณีศึกษาการบริหารโครงการวิศวกรรมสำหรับอุตสาหกรรมและห่วงโซ่อุปทาน",
                    "เนื้อหาวิชา": {
                        "หัวข้อ_1": "หลักการบริหารโครงการทางวิศวกรรม",
                        "หัวข้อ_2": "การคัดเลือกโครงการ",
                        "หัวข้อ_3": "การศึกษาความเป็นไปได้ของโครงการ",
                        "หัวข้อ_4": "การวางแผน การดำเนินงาน และการควบคุมโครงการ",
                        "หัวข้อ_5": "ซอฟต์แวร์การบริหารโครงการ",
                        "หัวข้อ_6": "การติดตามและประเมินผลโครงการ",
                        "หัวข้อ_7": "กรณีศึกษาการบริหารโครงการวิศวกรรมสำหรับอุตสาหกรรมและห่วงโซ่อุปทาน"
                    }
                }
            },
            {
                "category": "วอ.341 วิศวกรรมความปลอดภัย",
                "subcategories": {
                    "รหัสวิชา": "วอ.341",
                    "ชื่อวิชา": "วิศวกรรมความปลอดภัย",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.250",
                    "คำอธิบายรายวิชา": "อุบัติเหตุและอันตรายต่าง ๆ ในอุตสาหกรรมการผลิต ทฤษฎีและการวิเคราะห์สาเหตุของอุบัติเหตุ การป้องกันการเกิดอุบัติเหตุในงานอุตสาหกรรมการผลิต การวิเคราะห์และประเมินความเสี่ยงในอุตสาหกรรม หลักการบริหารความปลอดภัยและการบริหารเพื่อควบคุมการสูญเสียเนื่องจากอุบัติเหตุ การวางแผนและออกแบบเพื่อความปลอดภัย กฎหมายความปลอดภัยในการทำงาน มาตรฐานความปลอดภัยทางอุตสาหกรรมและการสาธารณสุขในโรงงาน หลักพื้นฐานในการควบคุมสิ่งแวดล้อมทางอุตสาหกรรม และจิตวิทยาอุตสาหกรรมขั้นต้น",
                    "เนื้อหาวิชา": {
                        "หัวข้อ_1": "อุบัติเหตุและอันตรายในอุตสาหกรรมการผลิต",
                        "หัวข้อ_2": "ทฤษฎีและการวิเคราะห์สาเหตุของอุบัติเหตุ",
                        "หัวข้อ_3": "การป้องกันการเกิดอุบัติเหตุในงานอุตสาหกรรมการผลิต",
                        "หัวข้อ_4": "การวิเคราะห์และประเมินความเสี่ยงในอุตสาหกรรม",
                        "หัวข้อ_5": "หลักการบริหารความปลอดภัยและการบริหารเพื่อควบคุมการสูญเสีย",
                        "หัวข้อ_6": "การวางแผนและออกแบบเพื่อความปลอดภัย",
                        "หัวข้อ_7": "กฎหมายความปลอดภัยในการทำงาน",
                        "หัวข้อ_8": "มาตรฐานความปลอดภัยทางอุตสาหกรรมและการสาธารณสุขในโรงงาน",
                        "หัวข้อ_9": "หลักพื้นฐานในการควบคุมสิ่งแวดล้อมทางอุตสาหกรรม",
                        "หัวข้อ_10": "จิตวิทยาอุตสาหกรรมขั้นต้น"
                    },
                    "ตัวอย่างการวางแผนและออกแบบเพื่อความปลอดภัย": {
                        "ตัวอย่าง_1": "การวางผังโรงงาน",
                        "ตัวอย่าง_2": "ระบบดับเพลิง",
                        "ตัวอย่าง_3": "อุปกรณ์ป้องกันภัยส่วนบุคคล",
                        "ตัวอย่าง_4": "อุปกรณ์ป้องกันอันตรายของเครื่องจักร",
                        "ตัวอย่าง_5": "การบำรุงรักษาเครื่องจักร",
                        "ตัวอย่าง_6": "การจัดการสารเคมีและกัมมันตภาพรังสี"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 61,
        "details": [
            {
                "category": "วอ.437 การออกแบบเพื่อความยั่งยืน",
                "subcategories": {
                    "รหัสวิชา": "วอ.437",
                    "ชื่อวิชาภาษาไทย": "การออกแบบเพื่อความยั่งยืน",
                    "ชื่อวิชาภาษาอังกฤษ": "IE437 Sustainability Design",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "ปัญหามลพิษทางสิ่งแวดล้อมในระดับโลก": "",
                        "การพัฒนาที่ยั่งยืน": "",
                        "การออกแบบเพื่อสิ่งแวดล้อม": "",
                        "การออกแบบเพื่อการถอดแยก": "",
                        "การออกแบบเพื่อการรีไซเคิล": "",
                        "การประเมินวัฎจักรชีวิตผลิตภัณฑ์": "",
                        "การประเมินรอยเท้าคาร์บอน": "",
                        "นโยบายต่าง ๆ ที่เกี่ยวข้องกับความยั่งยืน": "",
                        "ฉลากเกี่ยวกับความยั่งยืน": ""
                    }
                }
            },
            {
                "category": "วอ.445 การยศาสตร์และปัจจัยมนุษย์ในการออกแบบทางวิศวกรรม",
                "subcategories": {
                    "รหัสวิชา": "วอ.445",
                    "ชื่อวิชาภาษาไทย": "การยศาสตร์และปัจจัยมนุษย์ในการออกแบบทางวิศวกรรม",
                    "ชื่อวิชาภาษาอังกฤษ": "IE445 Human Factors and Ergonomics in Engineering Design",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "หลักการของการออกแบบโดยคำนึงถึงมนุษย์เป็นศูนย์กลาง": "",
                        "ความสามารถและข้อจำกัดของมนุษย์": {
                            "ทางกายภาพ": "",
                            "ความรู้ความเข้าใจและจิตวิทยา": ""
                        },
                        "ระบบกล้ามเนื้อและกระดูก": "",
                        "ความแข็งแรงของกล้ามเนื้อ": "",
                        "ความล้า และการบาดเจ็บ": "",
                        "หน้าที่ของกล้ามเนื้อเพื่อการเคลื่อนไหวของมนุษย์": "",
                        "พื้นฐานของชีวกลศาสตร์ในการทำงาน": "",
                        "การประเมินภาระงานทางกายภาพ": "",
                        "ความสามารถในการทำงาน": "",
                        "การประเมินท่าทางและการประเมินความเสี่ยงทางการยศาสตร์": "",
                        "การวัดและการประยุกต์ใช้สัดส่วนร่างกาย": "",
                        "การออกแบบสถานีงาน": "",
                        "มาตรฐานและคำแนะนำในการออกแบบทางกายภาพ": "",
                        "สรีรวิทยาในการทำงานและการออกงาน": "",
                        "การประเมินและออกแบบงานเคลื่อนย้ายวัสดุที่ใช้แรงกาย": {
                            "แบบคงที่": "",
                            "แบบซ้ำ ๆ": ""
                        },
                        "การประเมินและออกแบบเครื่องมือ": "",
                        "การประเมินและออกแบบงานแบบรู้คิด": {
                            "การรับรู้": "",
                            "การคิด": "",
                            "ตัดสินใจ": ""
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 42,
        "details": [
            {
                "category": "วอ.400 ฝึกงานทางวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "Prerequisites": "Have earned credits of IE311, IE341 and IE362",
                    "Description": "Practical training in industry in the field of industrial engineering during the summer months for IE students with junior standing",
                    "Training_Requirements": {
                        "Duration": "At least six consecutive weeks (not less than 240 hours)",
                        "Location": "Private sector such as companies, factories or government agencies or state enterprises to department's approval",
                        "Submissions": "Reports are required together with comments or certifications from the trainers"
                    },
                    "Additional_Note": "This course cannot be registered concurrently with other courses"
                }
            },
            {
                "category": "วอ.433 การออกแบบสิ่งอำนวยความสะดวกและโรงงานอุตสาหกรรม",
                "subcategories": {
                    "Course_Code": "IE433",
                    "Course_Name_English": "Industrial Facilities Design",
                    "Credits": "3 (3-0-6)",
                    "Prerequisites": "Have taken IE311",
                    "Topics": [
                        "Basics concepts of facilities and layout design",
                        "Laws and regulations",
                        "Facilities location selection (Center of Gravity, Multi-Decision Making, and Heuristics)",
                        "Plant and machine layout design (CRAFT)",
                        "Relationship diagram",
                        "Industry zone",
                        "Column-floor-beam design for factory",
                        "Coating material for factory floor",
                        "Factory roof design and ventilation systems",
                        "Sanitation and plumbing for factory",
                        "Engineering drawing for machine layout",
                        "Environmental initial assessment"
                    ]
                }
            },
            {
                "category": "วอ.490 สัมมนาสำหรับวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "Course_Code": "IE490",
                    "Course_Name_English": "Seminar for Industrial Engineering",
                    "Credits": "0 (0-0-3)",
                    "Prerequisites": "Have passed IE311, IE341 and IE362"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 36,
        "details": [
            {
                "category": "Motion and Time Study",
                "subcategories": {
                    "Prerequisites": "Have taken IE261",
                    "Main_Topics": "Motion and time used in human working, Using motion economics principle to design and improve work methods",
                    "Man-Machine_Interaction": "Study relationship between man and machine in movement, time and flow of materials used in process",
                    "Data_Collection_Methods": "Flow process chart, operation process chart, multiple activity chart, micro-motion study, simo chart",
                    "Time_Analysis": "Determination of standard time, work sampling, using rating factor",
                    "Work_Improvement": "Analysis of work for improving production method",
                    "Compensation": "Wage payment and incentive planning"
                }
            },
            {
                "category": "Production Planning and Control",
                "subcategories": {
                    "Course_Code": "วอ.312 / IE312",
                    "Credits": "3 (3-0-6)",
                    "Prerequisites": "Have taken IE364",
                    "Introduction": "Introduction to production and control system, Using of applied mathematics and computer for solving production and control system",
                    "Forecasting": "Forecasting techniques",
                    "Planning": "Production planning, Material Requirements Planning (MRP)",
                    "Inventory_Management": "Inventory management",
                    "Production_Systems": "Just in time system, Lean production techniques",
                    "Supply_Chain": "Supply chain management, Sustainable supply chain management",
                    "Scheduling": "Production scheduling",
                    "Project_Management": "Project management using PERT/CPM",
                    "Line_Balancing": "Line balancing"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 56,
        "details": [
            {
                "category": "วอ.468 เทคโนโลยีสำหรับการตัดสินใจ",
                "subcategories": {
                    "รหัสวิชา": "วอ.468",
                    "ชื่อวิชาภาษาไทย": "เทคโนโลยีสำหรับการตัดสินใจ",
                    "ชื่อวิชาภาษาอังกฤษ": "Decision Technology",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา": {
                        "ภาษาไทย": "แนะนำการนำเทคโนโลยีมาช่วยในการจัดการและควบคุมสำหรับงานอุตสาหกรรมและการจัดการ การแก้ปัญหาโดยใช้โปรแกรมทางคณิตศาสตร์และเครื่องมือช่วยในการดำเนินการแก้ปัญหา ปัญหาโครงข่าย ปัญหาทางเศรษฐศาสตร์วิศวกรรม ปัญหาการวางแผนและควบคุมการผลิต โปรแกรมจำนวนเต็ม โปรแกรมเป้าหมาย การวิเคราะห์จำแนกกลุ่ม การแก้ปัญหาที่มีหลายปัจจัยด้วยกระบวนการลำดับชั้นเชิงวิเคราะห์",
                        "ภาษาอังกฤษ": "Introduction to decision technologies for management and controlling in both industry and management. Problem solving by mathematical programming and a tool for processing problems. Network problems. Engineering economics problems. Production planning and control problems. Integer programming. Goal programming. Discriminant analysis. Multiple criteria decision making by analytic hierarchy process and a tool."
                    }
                }
            },
            {
                "category": "วอ.469 วิศวกรรมความน่าเชื่อถือ",
                "subcategories": {
                    "รหัสวิชา": "วอ.469",
                    "ชื่อวิชาภาษาไทย": "วิศวกรรมความน่าเชื่อถือ",
                    "ชื่อวิชาภาษาอังกฤษ": "Reliability Engineering",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วอ.313",
                    "คำอธิบายรายวิชา": {
                        "ภาษาไทย": "แนวคิดความน่าเชื่อถือของผลิตภัณฑ์และความน่าเชื่อถือของระบบ หลักสถิติที่เกี่ยวข้องในการวิเคราะห์ความน่าเชื่อถือในงานเชิงวิศวกรรม เทคนิคและเครื่องมือสำหรับการวิเคราะห์ความน่าเชื่อถือของผลิตภัณฑ์ การวิเคราะห์ความน่าเชื่อถือและแนวโน้มการเสียของเครื่องจักร การวางแผนทดสอบความน่าเชื่อถือของผลิตภัณฑ์ การประยุกต์ใช้หลักการวิเคราะห์ความน่าเชื่อถือเพื่อแก้ไขปัญหาทางวิศวกรรม",
                        "ภาษาอังกฤษ": "Concepts of product reliability and system reliability. Statistical method for reliability analysis in engineering. Techniques and tools for reliability analysis. Reliability analysis of machines. Reliability test planning and demonstration. Application of reliability analysis for problem solving in engineering."
                    }
                }
            },
            {
                "category": "วอ.475 ปัญญาประดิษฐ์",
                "subcategories": {
                    "รหัสวิชา": "วอ.475",
                    "ชื่อวิชาภาษาไทย": "ปัญญาประดิษฐ์",
                    "ชื่อวิชาภาษาอังกฤษ": "Artificial Intelligence",
                    "หน่วยกิต": "3 (3-0-6)"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 63,
        "details": [
            {
                "category": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "วอ.429": {
                        "ชื่อภาษาไทย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการ 1",
                        "ชื่อภาษาอังกฤษ": "Special Topics for Industrial Engineering I",
                        "รหัสวิชาภาษาอังกฤษ": "IE429",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบาย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการที่นักศึกษาสนใจ",
                        "คำอธิบายภาษาอังกฤษ": "Interesting Topics for Industrial Engineering"
                    },
                    "วอ.439": {
                        "ชื่อภาษาไทย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการ 2",
                        "ชื่อภาษาอังกฤษ": "Special Topics for Industrial Engineering II",
                        "รหัสวิชาภาษาอังกฤษ": "IE439",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบาย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการที่นักศึกษาสนใจ",
                        "คำอธิบายภาษาอังกฤษ": "Interesting Topics for Industrial Engineering"
                    },
                    "วอ.449": {
                        "ชื่อภาษาไทย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการ 3",
                        "ชื่อภาษาอังกฤษ": "Special Topics for Industrial Engineering III",
                        "รหัสวิชาภาษาอังกฤษ": "IE449",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบาย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการที่นักศึกษาสนใจ",
                        "คำอธิบายภาษาอังกฤษ": "Interesting Topics for Industrial Engineering"
                    },
                    "วอ.459": {
                        "ชื่อภาษาไทย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการ 4",
                        "ชื่อภาษาอังกฤษ": "Special Topics for Industrial Engineering IV",
                        "รหัสวิชาภาษาอังกฤษ": "IE459",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบาย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการที่นักศึกษาสนใจ",
                        "คำอธิบายภาษาอังกฤษ": "Interesting Topics for Industrial Engineering"
                    },
                    "วอ.479": {
                        "ชื่อภาษาไทย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการ 5",
                        "ชื่อภาษาอังกฤษ": "Special Topics for Industrial Engineering V",
                        "รหัสวิชาภาษาอังกฤษ": "IE479",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบาย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการที่นักศึกษาสนใจ",
                        "คำอธิบายภาษาอังกฤษ": "Interesting Topics for Industrial Engineering"
                    },
                    "วอ.499": {
                        "ชื่อภาษาไทย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการ 6",
                        "ชื่อภาษาอังกฤษ": "Special Topics for Industrial Engineering VI",
                        "รหัสวิชาภาษาอังกฤษ": "IE499",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบาย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการที่นักศึกษาสนใจ",
                        "คำอธิบายภาษาอังกฤษ": "Interesting Topics for Industrial Engineering"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 51,
        "details": [
            {
                "category": "วอ.407 การวิเคราะห์ต้นทุนอุตสาหกรรมและงบประมาณ",
                "subcategories": {
                    "รหัสวิชา": "IE407",
                    "ชื่อภาษาอังกฤษ": "Industrial Cost Analysis & Budgeting",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.302",
                    "เนื้อหา": "ความสำคัญของการวิเคราะห์ต้นทุนอุตสาหกรรมและการจัดทำงบประมาณ การไหลของต้นทุน พฤติกรรมของต้นทุน การวิเคราะห์ต้นทุนผลิตภัณฑ์ การวิเคราะห์และตัดสินใจในระยะสั้น การจัดทำงบประมาณ การวิเคราะห์รายงานทางการเงิน",
                    "Course_Description": "Importance of industrial cost analysis and budgeting. Flow of costs, Cost behavior. Product cost analysis. Analysis and decision making in short-run. Budgeting. Financial statement analysis."
                }
            },
            {
                "category": "วอ.408 ลีน และ ซิกซ์ ซิกมา",
                "subcategories": {
                    "รหัสวิชา": "IE408",
                    "ชื่อภาษาอังกฤษ": "Lean and Six Sigma",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วอ.390",
                    "เนื้อหา": "ทฤษฎีพื้นฐานทางลีนและ ซิกซ์ ซิกมา ชนิดของความสูญเปล่าและการวิเคราะห์ เทคนิคทางลีนและซิกซ์ ซิกมา วิธีการทางลีนและวิธีการทางซิกซ์ ซิกมา เพื่อปรับปรุงกระบวนการผลิต",
                    "Course_Description": "Basic theories of Lean and Six Sigma. Type of Waste and Analyses. Lean and Six Sigma Techniques. Leand and Six Sigma Methodologies for process improvement."
                }
            },
            {
                "category": "วอ.409 วิศวกรรมและเทคโนโลยีในการจัดการการขนส่ง",
                "subcategories": {
                    "รหัสวิชา": "IE409",
                    "ชื่อภาษาอังกฤษ": "Engineering and Technology in Transportation management",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": "ศึกษาการพัฒนาการขนส่งทางน้ำ การขนส่งทางบก การขนส่งทางอากาศ และการขนส่งทางอวกาศที่เกี่ยวข้องกับการขนส่งสินค้าและการขนส่งสาธารณะ วิเคราะห์วิจารณ์กรณีศึกษาในเนื้อหาเกี่ยวกับวิศวกรรมพื้นฐานและเทคโนโลยีที่สนับสนุนการพัฒนาและการจัดการการขนส่ง",
                    "Course_Description": "Study in development of water-, land-, air-, and space-transportations concerning goods and public transports. Discuss of the case studies in areas of fundamental engineering and technology supporting the development and management of transportation"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 4,
        "details": [
            {
                "category": "หมวดที่ 2 คุณสมบัติผู้เข้าศึกษา",
                "subcategories": {
                    "การรับเข้าศึกษา": {
                        "รับเฉพาะนักศึกษาไทย": false,
                        "รับทั้งนักศึกษาไทยและนักศึกษาต่างชาติ ที่สามารถใช้ภาษาไทยได้ดี": true,
                        "รับทั้งนักศึกษาไทยและนักศึกษาต่างชาติ": false
                    },
                    "คุณสมบัติของผู้เข้าศึกษา": "คุณสมบัติของผู้เข้าศึกษาต้องเป็นไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาชั้นปริญญาตรี พ.ศ. 2561 ข้อ 14",
                    "การคัดเลือกผู้เข้าศึกษา": "การคัดเลือกผู้เข้าศึกษาให้เป็นไปตามระเบียบคัดเลือกเพื่อเข้าศึกษาในสถาบันการศึกษาขั้นอุดมศึกษาของส่วนราชการหรือหน่วยงานอื่นดำเนินการตามการมอบหมายของมหาวิทยาลัยหรือตามข้อตกลง หรือ การคัดเลือกตามวิธีการที่มหาวิทยาลัยกำหนดโดยความเห็นชอบของสภามหาวิทยาลัย และออกเป็นประกาศมหาวิทยาลัย",
                    "แผนการรับนักศึกษาและผู้สำเร็จการศึกษาในระยะ 5 ปี": {
                        "จำนวนรับต่อปี": 60,
                        "แผนรับนักศึกษา": [
                            {
                                "ปีการศึกษา": 2566,
                                "ชั้นปีที่ 1": 60,
                                "ชั้นปีที่ 2": 0,
                                "ชั้นปีที่ 3": 0,
                                "ชั้นปีที่ 4": 0,
                                "รวม": 60,
                                "คาดว่าจะจบการศึกษา": 0
                            },
                            {
                                "ปีการศึกษา": 2567,
                                "ชั้นปีที่ 1": 60,
                                "ชั้นปีที่ 2": 60,
                                "ชั้นปีที่ 3": 0,
                                "ชั้นปีที่ 4": 0,
                                "รวม": 120,
                                "คาดว่าจะจบการศึกษา": 0
                            },
                            {
                                "ปีการศึกษา": 2568,
                                "ชั้นปีที่ 1": 60,
                                "ชั้นปีที่ 2": 60,
                                "ชั้นปีที่ 3": 60,
                                "ชั้นปีที่ 4": 0,
                                "รวม": 180,
                                "คาดว่าจะจบการศึกษา": 0
                            },
                            {
                                "ปีการศึกษา": 2569,
                                "ชั้นปีที่ 1": 60,
                                "ชั้นปีที่ 2": 60,
                                "ชั้นปีที่ 3": 60,
                                "ชั้นปีที่ 4": 60,
                                "รวม": 240,
                                "คาดว่าจะจบการศึกษา": 60
                            },
                            {
                                "ปีการศึกษา": 2570,
                                "ชั้นปีที่ 1": 60,
                                "ชั้นปีที่ 2": 60,
                                "ชั้นปีที่ 3": 60,
                                "ชั้นปีที่ 4": 60,
                                "รวม": 240,
                                "คาดว่าจะจบการศึกษา": 60
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 15,
        "details": [
            {
                "category": "วิชาเลือก",
                "subcategories": {
                    "รูปแบบที่_1": "วิชาเลือกด้านต่าง ๆ หรือหัวข้อพิเศษ 12 หน่วยกิต",
                    "รูปแบบที่_2": "วิชาสหกิจศึกษาวิศวกรรมอุตสาหการ และ วิชาเลือกด้านต่าง ๆ หรือหัวข้อพิเศษ"
                }
            },
            {
                "category": "วิชาสหกิจศึกษาวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "หน่วยกิต": "12 หน่วยกิต",
                    "วอ.486": "สหกิจศึกษาวิศวกรรมอุตสาหการ 1 3 (0-9-6)",
                    "วอ.487": "สหกิจศึกษาวิศวกรรมอุตสาหการ 2 9 (ปฏิบัติงานไม่น้อยกว่า16 สัปดาห์/ภาคการศึกษา)"
                }
            },
            {
                "category": "วิชาเลือกด้านต่าง ๆ หรือหัวข้อพิเศษ",
                "subcategories": {
                    "หน่วยกิต": "3 หน่วยกิต",
                    "ด้านการดำเนินงานอย่างอัจฉริยะและการเป็นผู้ประกอบการ": {
                        "วอ.405": "สตาร์ทอัพเทคโนโลยี 3 (3-0-6)",
                        "วอ.406": "การจัดการทางวิศวกรรม 3 (3-0-6)",
                        "วอ.407": "การวิเคราะห์ต้นทุนอุตสาหกรรมและงบประมาณ 3 (3-0-6)",
                        "วอ.408": "ลีน และ ซิกซ์ ซิกมา 3 (3-0-6)",
                        "วอ.409": "วิศวกรรมและเทคโนโลยีในการจัดการการขนส่ง 3 (3-0-6)",
                        "วอ.415": "การจำลองระบบเสมือนจริงในรูปแบบดิจิทัล 3 (3-0-6)",
                        "วอ.416": "การจัดการซัพพลายเชน 3 (3-0-6)",
                        "วอ.417": "การออกแบบข้อมูลและการหาค่าที่เหมาะสมที่สุดสำหรับการดำเนินงานภาคธุรกิจ 3 (3-0-6)",
                        "วอ.418": "การศึกษาความเป็นไปได้ของโครงการ 3 (3-0-6)",
                        "วอ.419": "การบริหารโครงการสำหรับวิศวกร 3 (3-0-6)"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 66,
        "details": [
            {
                "category": "วอ.310 การออกแบบการปฏิบัติงานทางอุตสาหกรรม",
                "subcategories": {
                    "รหัสวิชา": "วอ.310",
                    "ชื่อวิชาภาษาไทย": "การออกแบบการปฏิบัติงานทางอุตสาหกรรม",
                    "ชื่อวิชาภาษาอังกฤษ": "Industrial Work Design",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.261",
                    "เนื้อหาวิชา": {
                        "การเคลื่อนไหวและเวลา": "การเคลื่อนไหวและเวลาในการทำงานของคน",
                        "หลักเศรษฐศาสตร์การเคลื่อนไหว": "การใช้หลักเศรษฐศาสตร์การเคลื่อนไหวในการออกแบบและปรับปรุงการทำงาน",
                        "หลักการยศาสตร์": "หลักการยศาสตร์สำหรับการออกแบบการทำงาน",
                        "การปฏิสัมพันธ์": "การปฏิสัมพันธ์ระหว่างคน-เครื่องจักร",
                        "ความสัมพันธ์": "ความสัมพันธ์ในการเคลื่อนไหว เวลา และการไหลของวัสดุที่ใช้ในการผลิต",
                        "วิธีการเก็บรวบรวมข้อมูล": {
                            "เครื่องมือ": [
                                "แผนภูมิการไหลของกระบวนการ",
                                "แผนภูมิการผลิต",
                                "แผนภูมิการทำงานหลายแบบ",
                                "การศึกษาการเคลื่อนไหวอย่างละเอียด",
                                "แผนภูมิไซโม"
                            ]
                        },
                        "การหาเวลามาตรฐาน": "การหาเวลามาตรฐาน การสุ่มงาน และการใช้ปัจจัยในการประเมินค่า",
                        "การวิเคราะห์งาน": "การวิเคราะห์งานเพื่อปรับปรุงวิธีการผลิต",
                        "การจ่ายค่าจ้าง": "การจ่ายเงินค่าจ้างและจัดทำแผนการจูงใจในการทำงาน"
                    }
                }
            },
            {
                "category": "วอ.311 การศึกษาการปฏิบัติงานทางอุตสาหกรรม",
                "subcategories": {
                    "รหัสวิชา": "วอ.311",
                    "ชื่อวิชาภาษาไทย": "การศึกษาการปฏิบัติงานทางอุตสาหกรรม",
                    "ชื่อวิชาภาษาอังกฤษ": "Industrial Work Study",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.261",
                    "เนื้อหาวิชา": {
                        "การเคลื่อนไหวและเวลา": "การเคลื่อนไหวและเวลาในการทำงานของคน",
                        "หลักเศรษฐศาสตร์การเคลื่อนไหว": "การใช้หลักเศรษฐศาสตร์การเคลื่อนไหวในการออกแบบและปรับปรุงการทำงาน",
                        "การปฏิสัมพันธ์": "การปฏิสัมพันธ์ระหว่างคน-เครื่องจักร",
                        "ความสัมพันธ์": "ความสัมพันธ์ในการเคลื่อนไหว เวลาและการไหลของวัสดุที่ใช้ในการผลิต",
                        "วิธีการเก็บรวบรวมข้อมูล": {
                            "เครื่องมือ": [
                                "แผนภูมิการไหลของกระบวนการ",
                                "แผนภูมิการผลิต",
                                "แผนภูมิการทำงานหลายแบบ",
                                "การศึกษาการเคลื่อนไหวอย่างละเอียด",
                                "แผนภูมิไซโม"
                            ]
                        },
                        "การหาเวลามาตรฐาน": "การหาเวลามาตรฐาน การสุ่มงาน และการใช้ปัจจัยในการประเมินค่า",
                        "การวิเคราะห์งาน": "การวิเคราะห์งานเพื่อปรับปรุงวิธีการผลิต",
                        "การจ่ายค่าจ้าง": "การจ่ายเงินค่าจ้างและจัดทำแผนการจูงใจในการทำงาน"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 7,
        "details": [
            {
                "category": "ผลลัพธ์การเรียนรู้ที่คาดหวังเมื่อสิ้นปีการศึกษา (YLOs)",
                "subcategories": {
                    "ปีที่_1": {
                        "ความรู้": "มีความรู้พื้นฐานทั่วไป, มีพื้นฐานทางคณิตศาสตร์ วิทยาศาสตร์ วิศวกรรม",
                        "ทักษะ": "มีทักษะ GREATS",
                        "ทัศนคติ": "มีคุณธรรม จริยธรรม"
                    },
                    "ปีที่_2": {
                        "ความรู้": "มีความรู้วิชาพื้นฐานทางวิศวกรรมศาสตร์, มีพื้นฐานทางสถิติวิศวกรรม, เครื่องมือและการทดสอบทางไฟฟ้าและคุณสมบัติของวัสดุ, มีพื้นฐานด้านกระบวนการผลิต"
                    },
                    "ปีที่_3": {
                        "ความรู้": "เรียนรู้และสามารถประยุกต์ใช้ความรู้ทางวิศวกรรมอุตสาหการ",
                        "ทักษะ": "การศึกษาวิเคราะห์ปัญหาและการแนวทางแก้ปัญหาเบื้องต้นในระบบทำงานและระบบการผลิต, ความปลอดภัย, การควบคุมคุณภาพ, การวางแผนกระบวนการผลิต, การพิจารณาด้านเศรษฐศาสตร์และเทคโนโลยีสำหรับการผลิต, ทักษะด้านการสื่อสารและการทำงานร่วมกับผู้อื่น"
                    },
                    "ปีที่_4": {
                        "ความรู้": "สามารถวิเคราะห์ปัญหาในอุตสาหกรรม โดยใช้ความรู้ทางวิศวกรรมอุตสาหการ",
                        "ทักษะ": "การปรับปรุงและออกแบบการทำงานและผังการผลิต, ความสามารถด้านการสื่อสารและการทำงานร่วมกับผู้อื่น"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 69,
        "details": [
            {
                "category": "วอ.362 การควบคุมคุณภาพ",
                "subcategories": {
                    "รหัสวิชา": "IE362",
                    "ชื่อวิชาภาษาอังกฤษ": "Quality Control",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วอ.261",
                    "คำอธิบายรายวิชา": {
                        "ภาษาไทย": "เทคนิคทางด้านการจัดการคุณภาพ ต้นทุนคุณภาพ เทคนิคในการวิเคราะห์และปรับปรุงคุณภาพ เช่น แผนภูมิการควบคุมเชิงผันแปรและเชิงคุณลักษณะ การวิเคราะห์ความสามารถของกระบวนการผลิต การสุ่มตัวอย่างและการออกแบบแผนการสุ่มชักตัวอย่าง ระบบการควบคุมคุณภาพแบบอัตโนมัติ ความน่าเชื่อถือทางวิศวกรรมในการผลิต การประกันคุณภาพเบื้องต้น",
                        "ภาษาอังกฤษ": "Concept of quality management. Cost of quality. Techniques of analyzing and improving quality such as control chart, process capability analysis, sampling plan, and designing of sampling plan. Automated quality control system. Engineering reliability for manufacturing. Introduction to quality assurance system."
                    }
                }
            },
            {
                "category": "วอ.364 การวิจัยดำเนินงาน 1",
                "subcategories": {
                    "รหัสวิชา": "IE364",
                    "ชื่อวิชาภาษาอังกฤษ": "Operations Research I",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.261",
                    "คำอธิบายรายวิชา": {
                        "ภาษาไทย": "แนะนำวิธีการวิจัยดำเนินงานในการแก้ไขปัญหาทางวิศวกรรมอุตสาหการสมัยใหม่โดยเน้นการใช้ตัวแบบทางคณิตศาสตร์ กำหนดการเชิงเส้น ตัวแบบการขนส่งและการมอบหมายงาน ทฤษฎีเกม ทฤษฎีแถวคอย ตัวแบบการจัดการพัสดุคงคลัง และการใช้การจำลองสถานการณ์ในกระบวนการตัดสินใจ เพื่อการวางแผนและการควบคุมการผลิต",
                        "ภาษาอังกฤษ": "Introduction to the methodology of operations research in modern industrial engineering problem solving, emphasis is made on the use of mathematical models, linear programming, transportation model, game theory, queuing theory, inventory model and simulation in decision making process for production planning and control."
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 31,
        "details": [
            {
                "category": "วท.133 ฟิสิกส์สำหรับวิศวกร 2",
                "subcategories": {
                    "Prerequisite": "Have taken SC133",
                    "Topics": "Electric charge and electric fields, Gauss' law, electric potential, capacitance, dielectrics, electric current, DC circuits and devices, magnets and electromagnets, magnetic induction and Faraday's law, inductors, AC circuits, electromagnetic theory and applications, light, lenses and optical instruments, reflection, refraction, diffraction, interference and polarization, modern physics."
                }
            },
            {
                "category": "วท.173 ปฏิบัติการเคมีพื้นฐาน",
                "subcategories": {
                    "Credit": "1 (0-3-0)",
                    "Prerequisite": "Have taken SC123 or taking SC123 in the same semester",
                    "Description": "Experiments related to the contents in SC123"
                }
            },
            {
                "category": "วท.183 ปฏิบัติการฟิสิกส์สำหรับวิศวกร 1",
                "subcategories": {
                    "Credit": "1 (0-3-0)",
                    "Topics": "Laboratory practices involving measurement and errors, force and motion, energy, momentum, waves and heat."
                }
            },
            {
                "category": "วท.184 ปฏิบัติการฟิสิกส์สำหรับวิศวกร 2",
                "subcategories": {
                    "Credit": "1 (0-3-0)",
                    "Topics": "Laboratory practices involving electro-magnetic fields, electric circuits and instruments, optics and modern physics."
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 34,
        "details": [
            {
                "category": "วอ.250 กรรมวิธีการผลิต",
                "subcategories": {
                    "รหัสวิชา": "วอ.250",
                    "ชื่อภาษาไทย": "กรรมวิธีการผลิต",
                    "ชื่อภาษาอังกฤษ": "Manufacturing Processes",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "กรรมวิธีการผลิต": [
                            "การหล่อ",
                            "การขึ้นรูป",
                            "การเชื่อม",
                            "การใช้อุปกรณ์ เครื่องมือ และเครื่องจักรที่ควบคุมด้วยระบบคอมพิวเตอร์",
                            "ต้นทุนในการผลิต"
                        ],
                        "มาตรฐานและข้อกำหนด": [
                            "ระบบมาตรฐานในเรื่องความสามารถการแลกเปลี่ยน",
                            "ข้อกำหนดของพิกัดความเผื่อ"
                        ],
                        "ความปลอดภัยและสิ่งแวดล้อม": [
                            "อาชีวอนามัย",
                            "หลักการการทำงานที่ปลอดภัย",
                            "การผลิตที่คำนึงถึงสิ่งแวดล้อม"
                        ],
                        "การบำรุงรักษา": [
                            "การบำรุงรักษาเครื่องจักรเบื้องต้น"
                        ]
                    }
                }
            },
            {
                "category": "วอ.261 สถิติวิศวกรรม",
                "subcategories": {
                    "รหัสวิชา": "วอ.261",
                    "ชื่อภาษาไทย": "สถิติวิศวกรรม",
                    "ชื่อภาษาอังกฤษ": "Engineering Statistics",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "การวิเคราะห์ข้อมูล": [
                            "การนำเสนอและการวิเคราะห์ข้อมูล"
                        ],
                        "ทฤษฎีทางสถิติ": [
                            "ทฤษฎีความน่าจะเป็น",
                            "การแจกแจงทางสถิติ",
                            "ทฤษฎีการสุ่มตัวอย่าง",
                            "การประมาณค่า",
                            "การอนุมานทางสถิติ"
                        ],
                        "การทดสอบและวิเคราะห์": [
                            "การทดสอบสมมติฐาน",
                            "การวิเคราะห์ความแปรปรวน",
                            "การวิเคราะห์การถดถอยและสหสัมพันธ์"
                        ],
                        "การประยุกต์ใช้": [
                            "การใช้วิธีการทางสถิติในการแก้ไขปัญหา",
                            "การประยุกต์สถิติในเชิงวิศวกรรม"
                        ]
                    }
                }
            },
            {
                "category": "วอ.301 ปฏิบัติการทางสถิติและวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "รหัสวิชา": "วอ.301",
                    "ชื่อภาษาไทย": "ปฏิบัติการทางสถิติและวิศวกรรมอุตสาหการ",
                    "ชื่อภาษาอังกฤษ": "Statistics and Industrial Engineering Laboratory",
                    "หน่วยกิต": "1 (0-3-3)",
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.311",
                    "เนื้อหา": {
                        "ปฏิบัติการทางสถิติและการวิเคราะห์ข้อมูลพื้นฐาน": [
                            "การวิเคราะห์ข้อมูลทางอุตสาหกรรม",
                            "การทดสอบสมมติฐาน กรณีตัวอย่างเดียวและสองตัวอย่าง",
                            "การทดสอบสมมติฐานโดยปรับระดับปัจจัยเดียวและปัจจัยอื่นคงที่",
                            "การวิเคราะห์ความสัมพันธ์เชิงเส้น",
                            "การวิเคราะห์ปัจจัยเดียวแบบไม่ใช้พารามิเตอร์"
                        ],
                        "ปฏิบัติการการควบคุมคุณภาพ": [
                            "ผังควบคุมกระบวนการและการวิเคราะห์ระบบการวัด",
                            "ความสามารถของกระบวนการ",
                            "การสุ่มตัวอย่าง",
                            "การวิเคราะห์ความน่าเชื่อถือ"
                        ],
                        "ปฏิบัติการการวิจัยดำเนินงาน": [
                            "การใช้โปรแกรมสำเร็จรูป"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 37,
        "details": [
            {
                "category": "วอ.313 วิศวกรรมการบำรุงรักษา",
                "subcategories": {
                    "รหัสวิชา": "วอ.313",
                    "ชื่อวิชาภาษาไทย": "วิศวกรรมการบำรุงรักษา",
                    "ชื่อวิชาภาษาอังกฤษ": "Maintenance Engineering",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วอ.261",
                    "เนื้อหารายวิชา": {
                        "การบำรุงรักษาในอุตสาหกรรม": "แนวคิดการบำรุงรักษาแบบทวีผลที่ทุกคนมีส่วนร่วม",
                        "การบริหารจัดการ": "หน่วยงาน บุคลากร และทรัพยากรในงานบำรุงรักษา",
                        "การวิเคราะห์ทางสถิติ": "ข้อมูลการเสียความน่าเชื่อถือ ความสามารถในการบำรุงรักษาและความพร้อมใช้งาน",
                        "ระบบการบำรุงรักษา": "เชิงป้องกันและเทคโนโลยีการตรวจสอบสภาพ",
                        "การหล่อลื่น": "รายละเอียดเกี่ยวกับการหล่อลื่น",
                        "การรายงานการบำรุงรักษา": "และดัชนีวัดประสิทธิภาพ",
                        "การควบคุมงานบำรุงรักษา": "และระบบสั่งงาน",
                        "ระบบการจัดการ": "งานบำรุงรักษาด้วยคอมพิวเตอร์",
                        "การพัฒนาระบบการบำรุงรักษา": "บนพื้นฐานของเทคโนโลยี IoT"
                    },
                    "Course_Description_English": {
                        "Industrial_maintenance": "Total Productive Maintenance (TPM) concepts",
                        "Management_concepts": "for maintenance organization, personnel, and resources",
                        "Statistical_analysis": "of failure data, reliability, maintainability and availability",
                        "Preventive_maintenance_system": "and condition monitoring technologies",
                        "Lubrication": "Details about lubrication",
                        "Maintenance_report": "and key performance indexes",
                        "Maintenance_control": "and work order systems",
                        "Computerized_Maintenance_Management_System": "(CMMS)",
                        "Maintenance_system_development": "based on IoT technology"
                    }
                }
            },
            {
                "category": "วอ.341 วิศวกรรมความปลอดภัย",
                "subcategories": {
                    "รหัสวิชา": "วอ.341",
                    "ชื่อวิชาภาษาไทย": "วิศวกรรมความปลอดภัย",
                    "ชื่อวิชาภาษาอังกฤษ": "Safety Engineering",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.250",
                    "เนื้อหารายวิชา": {
                        "อุบัติเหตุและอันตราย": "ที่มีอยู่ในอุตสาหกรรมการผลิต",
                        "ทฤษฎีและการวิเคราะห์": "สาเหตุของอุบัติเหตุ",
                        "การป้องกัน": "การเกิดอุบัติเหตุในงานอุตสาหกรรมการผลิต",
                        "การวิเคราะห์และประเมินความเสี่ยง": "ในอุตสาหกรรม",
                        "หลักการบริหารความปลอดภัย": "และการบริหารเพื่อควบคุมการสูญเสียเนื่องจากอุบัติเหตุ",
                        "การวางแผนและออกแบบเพื่อความปลอดภัย": {
                            "การวางผังโรงงาน": "รายละเอียดเกี่ยวกับการวางผังโรงงาน",
                            "ระบบดับเพลิง": "รายละเอียดเกี่ยวกับระบบดับเพลิง",
                            "อุปกรณ์ป้องกันภัยส่วนบุคคล": "รายละเอียดเกี่ยวกับอุปกรณ์ป้องกันภัยส่วนบุคคล",
                            "อุปกรณ์ป้องกันอันตรายของเครื่องจักร": "รายละเอียดเกี่ยวกับอุปกรณ์ป้องกันอันตรายของเครื่องจักร",
                            "การบำรุงรักษาเครื่องจักร": "รายละเอียดเกี่ยวกับการบำรุงรักษาเครื่องจักร",
                            "การจัดการสารเคมีและกัมมันตภาพรังสี": "รายละเอียดเกี่ยวกับการจัดการสารเคมีและกัมมันตภาพรังสี"
                        },
                        "กฎหมายความปลอดภัย": "ในการทำงานทั้งกฎหมายแรงงานและกฎหมายโรงงาน",
                        "มาตรฐานความปลอดภัย": "ทางอุตสาหกรรมและการสาธารณสุขในโรงงาน",
                        "หลักพื้นฐานในการควบคุมสิ่งแวดล้อม": "ทางอุตสาหกรรม",
                        "จิตวิทยาอุตสาหกรรม": "ขั้นต้น"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 46,
        "details": [
            {
                "category": "วฟ.209 วิศวกรรมไฟฟ้าเบื้องต้น",
                "subcategories": {
                    "รหัสวิชา": "LE209",
                    "ชื่อภาษาอังกฤษ": "Introduction to Electrical Engineering",
                    "หน่วยกิต": "3 (3-0-6)",
                    "กลุ่มเป้าหมาย": "สำหรับนักศึกษาสาขาวิชาวิศวกรรมเครื่องกล อุตสาหการ",
                    "เนื้อหาวิชา": {
                        "การวิเคราะห์วงจร": "วงจรกระแสตรงและกระแสสลับเบื้องต้น",
                        "พื้นฐานไฟฟ้า": "แรงดัน กระแสและกำลังงาน",
                        "อุปกรณ์ไฟฟ้า": [
                            "หม้อแปลงไฟฟ้า",
                            "เครื่องกำเนิดไฟฟ้า",
                            "มอเตอร์ไฟฟ้า"
                        ],
                        "ระบบไฟฟ้า": [
                            "ระบบไฟฟ้าสามเฟส",
                            "วิธีการส่งถ่ายพลังงานไฟฟ้า"
                        ],
                        "เครื่องมือวัด": "เครื่องมือวัดพื้นฐานทางไฟฟ้า"
                    }
                }
            },
            {
                "category": "วย.202 กลศาสตร์วิศวกรรม-สถิตยศาสตร์",
                "subcategories": {
                    "รหัสวิชา": "CE202",
                    "ชื่อภาษาอังกฤษ": "Engineering Mechanics-Statics",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วท.133",
                    "เนื้อหาวิชา": {
                        "พื้นฐานกลศาสตร์": [
                            "ระบบของแรง",
                            "กฎของนิวตัน",
                            "แรงลัพธ์",
                            "สมดุลของแรง และโมเมนต์"
                        ],
                        "จุดศูนย์กลาง": [
                            "จุดศูนย์กลางของวัตถุ",
                            "จุดศูนย์กลางมวล",
                            "จุดศูนย์ถ่วง"
                        ],
                        "ทฤษฎีและหลักการ": [
                            "ทฤษฎีของแปปปัส",
                            "โมเมนต์ความเฉื่อยของพื้นที่"
                        ],
                        "การประยุกต์ใช้": [
                            "การประยุกต์สมการสมดุลกับโครงสร้างและเครื่องจักร",
                            "คาน"
                        ],
                        "การวิเคราะห์": [
                            "การวิเคราะห์หาโมเมนต์ดัด และแรงเฉือน",
                            "การวิเคราะห์โดยใช้หลักของงานเสมือน"
                        ],
                        "หัวข้อเพิ่มเติม": [
                            "ความฝืด",
                            "ความรู้เบื้องต้นเกี่ยวกับพลศาสตร์"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 23,
        "details": [
            {
                "category": "วิชาศึกษาทั่วไป",
                "subcategories": {
                    "หมวดความเท่าทันโลกและสังคม": {
                        "มธ.124 สังคมกับเศรษฐกิจ": {
                            "รหัสวิชา": "TU124",
                            "ชื่อวิชาภาษาอังกฤษ": "Society and Economy",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คำอธิบายรายวิชา": "แนวทางการศึกษาและการวิเคราะห์สังคม และเศรษฐกิจในฐานะที่วิชานี้เป็นการศึกษาทางด้านสังคมศาสตร์ แล้วนำสู่การวิเคราะห์วิวัฒนาการของสังคมและเศรษฐกิจที่เกิดขึ้นในภาพกว้างของโลกและของประเทศไทย โดยเน้นให้เห็นถึงอิทธิพลของวัฒนธรรมและสถาบันที่มีต่อระบบสังคมเศรษฐกิจ",
                            "คำอธิบายรายวิชาภาษาอังกฤษ": "To provide guidelines for the study and analysis of society and economy. To analyze social and economic evolution in Thailand and worldwide. To emphasize the influence of culture and institutions on the social and economic system."
                        },
                        "มธ.101 โลก อาเซียน และไทย": {
                            "รหัสวิชา": "TU101",
                            "ชื่อวิชาภาษาอังกฤษ": "Thailand, ASEAN, and the World",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คำอธิบายรายวิชา": "ศึกษาปรากฏการณ์ที่สำคัญของโลก อาเซียนและไทย ในมิติทางการเมือง เศรษฐกิจ สังคมวัฒนธรรม โดยใช้กรอบแนวคิด ทฤษฎี และระเบียบวิจัยทางสังคมศาสตร์ ผ่านการอภิปรายและยกตัวอย่างสถานการณ์หรือบุคคลที่ได้รับความสนใจ เพื่อให้เกิดมุมมองต่อความหลากหลายและเข้าใจความซับซ้อนที่สัมพันธ์กันทั้งโลก มีจิตสำนึกสากล (GLOBAL MINDSET) สามารถท้าทายกรอบความเชื่อเดิมและเปิดโลกทัศน์ใหม่ให้กว้างขวางขึ้น",
                            "คำอธิบายรายวิชาภาษาอังกฤษ": "Study of significant phenomena around the world, in the ASEAN region and in Thailand in terms of their political, economic and sociocultural dimensions. This is done through approaches, theories and principles of social science research via discussion and raising examples of situations or people of interest. The purpose of this is to create a perspective of diversity, to understand the complexity of global interrelationships, to build a global mindset and to be able to challenge old paradigms and open up a new, broader worldview."
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 60,
        "details": [
            {
                "category": "วอ.478 วิทยาการหุ่นยนต์อุตสาหกรรมและการประยุกต์ใช้",
                "subcategories": {
                    "รหัสวิชา": "IE478",
                    "ชื่อวิชาภาษาอังกฤษ": "Industrial Robot and its application",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.353",
                    "คำอธิบายรายวิชา": {
                        "ภาษาไทย": "หลักการและการประยุกต์ใช้หุ่นยนต์อุตสาหกรรม (แขนกล) ในระบบการผลิตสมัยใหม่ การจำแนกประเภทและลักษณะของหุ่นยนต์อุตสาหกรรม ส่วนประกอบและการควบคุม การวิเคราะห์และควบคุมจลนพลศาสตร์ การบูรณาการหุ่นยนต์อุตสาหกรรมเข้ากับระบบ การวิเคราะห์ต้นทุนหุ่นยนต์อุตสาหกรรม การทำงานและการโปรแกรมการทำงานของหุ่นยนต์อุตสาหกรรม",
                        "ภาษาอังกฤษ": "Principles and applications of industrial robots in modern manufacturing systems. Robot classifications and configuration. Components and control. Kinematics analysis and control. Robot and system integration. Justifying the cost of robots. Operations and programming."
                    }
                }
            },
            {
                "category": "ด้านการออกแบบทางอุตสาหกรรมอย่างอัจฉริยะ (SMART INDUSTRIAL DESIGN)",
                "subcategories": {
                    "วอ.436 การออกแบบโดยเน้นประสบการณ์ของลูกค้า": {
                        "รหัสวิชา": "IE436",
                        "ชื่อวิชาภาษาอังกฤษ": "Customer Experience Design",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": {
                            "ภาษาไทย": "แนะนำการออกแบบโดยเน้นประสบการณ์ของลูกค้า กระบวนการคิดในเชิงออกแบบ การทำความเข้าใจกับความรู้สึกนึกคิดของลูกค้าโดยใช้เครื่องมือต่าง ๆ เช่น การสังเกตพฤติกรรมผู้ใช้ แผนที่การเข้าใจลูกค้า การกำหนดโจทย์ของการออกแบบ การพัฒนาแนวทางการแก้ปัญหา การสร้างต้นแบบ การทดสอบ ตัวอย่างและกรณีศึกษาของการออกแบบโดยเน้นประสบการณ์ของลูกค้า โดยเน้นการประยุกต์ใช้ในทางวิศวกรรมและธุรกิจ",
                            "ภาษาอังกฤษ": "Introduction to customer experience (CX). Overview of design thinking process. Developing customer empathy using various tools such as user observation, empathy map. Defining problem statement. Generating potential solutions (ideation). Prototyping. Testing. Examples and case studies of CX in engineering and business applications."
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 6,
        "details": [
            {
                "category": "ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)",
                "subcategories": {
                    "ด้านความรู้ (Knowledge)": {
                        "K1": "ผู้เรียนมีความรู้ทางพื้นฐานทางวิศวกรรมอุตสาหการ",
                        "K2": "ผู้เรียนสามารถเข้าใจในวิธีการนำความรู้พื้นฐานทางวิศวกรรมอุตสาหการไปใช้งาน",
                        "K3": "ผู้เรียนสามารถประยุกต์ใช้ความรู้พื้นฐานทางวิศวกรรมอุตสาหการ",
                        "K4": "ผู้เรียนสามารถประยุกต์ใช้เทคโนยีใหม่ ๆ ได้",
                        "K5": "ผู้เรียนสามารถนำความรู้และการประยุกต์ใช้ความรู้ทางวิศวกรรมอุตสาหการและเทคโนโลยีใหม่ไปสร้างสรรค์ต่อยอดการใช้งานและการประยุกต์ต่อได้"
                    },
                    "ด้านทักษะ (Skills)": {
                        "S1": "ผู้เรียนสามารถทำงานเป็นทีมได้",
                        "S2": "ผู้เรียนสามารถแสดงให้เห็นถึงความสามารถในการเป็นผู้นำได้",
                        "S3": "ผู้เรียนสามารถประยุกต์ใช้ software computer ในการวิเคราะห์ข้อมูล เช่น minitab เป็นต้น",
                        "S4": "ผู้เรียนสามารถใช้โปรแกรมเฉพาะทางได้ เช่น Solid edge, PLC เป็นต้น"
                    },
                    "ด้านจริยธรรม (Ethics)": {
                        "E1": "ผู้เรียนมีความรู้เบื้องต้นเกี่ยวกับกฎหมายที่เกี่ยวข้องกับวิชาชีพ",
                        "E2": "ผู้เรียนสามารถเข้าใจถึงจริยธรรม จรรยาบรรณ และอื่น ๆ ที่เกี่ยวข้องกับวิชาชีพ"
                    },
                    "ด้านลักษณะบุคคล (Character)": {
                        "C1": "เป็นผู้ที่แสดงให้เห็นถึงการมีจริยธรรมในวิชาชีพ",
                        "C2": "มีคุณลักษณะของ GREATS (Global mindset, Responsibility, Eloquence, Aesthetic appreciation, Team leader, Spirit of Thammasat)",
                        "C3": "เป็นผู้ที่ใฝ่ศึกษาเรียนรู้อย่างต่อเนื่อง"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 32,
        "details": [
            {
                "category": "กลุ่มวิชาพื้นฐานทางวิศวกรรม",
                "subcategories": {
                    "วก.100 กราฟิกวิศวกรรม": {
                        "รหัสวิชา": "วก.100",
                        "ชื่อวิชา": "กราฟิกวิศวกรรม",
                        "หน่วยกิต": "3 (2-3-4)",
                        "ชื่อภาษาอังกฤษ": "Engineering Graphics",
                        "คำอธิบายรายวิชา": "ความสำคัญของการเขียนแบบ มาตรฐานการเขียนแบบ เครื่องมือและวิธีใช้ การเขียนเส้นและตัวอักษร การเขียนแบบรูปร่างเรขาคณิต การระบุขนาดและพิกัดความเผื่อ การเขียนแบบภาพฉาย การเขียนแบบสามมิติ การเขียนภาพด้วยมือเปล่าและทักษะการมองภาพ การเขียนภาพตัดและภาพช่วย การเขียนแบบรายละเอียดและการเขียนแบบงาน การอ่านแบบทางวิศวกรรม การใช้คอมพิวเตอร์สำหรับช่วยงานเขียนแบบ",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "The significance of drawing. Instruments and their uses. Lining and lettering. Work preparation. Applied geometry. Dimensioning and tolerancing. Orthographic drawing. Pictorial drawing. Freehand sketching. Sections and auxiliary views. Basic Writing and Reading drawing. Computer aided drawing."
                    },
                    "วศว.100 จริยธรรมสำหรับวิศวกร": {
                        "รหัสวิชา": "วศว.100",
                        "ชื่อวิชา": "จริยธรรมสำหรับวิศวกร",
                        "หน่วยกิต": "0 (0-0-0)",
                        "ชื่อภาษาอังกฤษ": "Ethics for Engineers",
                        "คำอธิบายรายวิชา": "จรรยาบรรณวิศวกรรม ผลกระทบของเทคโนโลยีต่อสังคม ปัญหาและประเด็นทางด้านจริยธรรมและคุณธรรม แนวทางแก้ไขตลอดจนการป้องกัน เพื่อไม่ให้เกิดกรณีดังกล่าวกับลักษณะงานทางวิศวกรรมด้านต่าง ๆ การเข้าร่วมโครงการอบรมจริยธรรม เพื่อพัฒนาคุณธรรมและจริยธรรม วัดผลเป็นระดับ S หรือ U (เข้าร่วมกิจกรรมกับที่ทางคณะวิศวกรรมศาสตร์จัดขึ้น)",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Ethical issues relevant to the engineering profession. Potential impact of technoloty transfers and implementation with respect to society and its members. Potential problems that may arise are studied along with possible ways to prevent them from occurring and ways to deal with them once they occur. Grading is in S or U."
                    },
                    "วศว.101 เทคโนโลยีสารสนเทศสมัยใหม่เบื้องต้น": {
                        "รหัสวิชา": "วศว.101",
                        "ชื่อวิชา": "เทคโนโลยีสารสนเทศสมัยใหม่เบื้องต้น",
                        "หน่วยกิต": "1 (1-0-2)",
                        "ชื่อภาษาอังกฤษ": "Introduction to Modern Information Technologies",
                        "คำอธิบายรายวิชา": "แนะนำเทคโนโลยีทางด้านวิทยาการข้อมูล วิศวกรรมข้อมูล ปัญญาประดิษฐ์ รวมถึงเทคโนโลยีทางคอมพิวเตอร์ล้ำสมัย เช่น เงินตราเข้ารหัสลับ (Crypto currency), บล็อกเชน (Blockchain), การคำนวณควอนตัม (Quantum computing), ฝาแฝดดิจิทัล (Digital twin), ความเป็นจริงเสริม(Augmented reality) เพื่อให้นักศึกษามีความเข้าใจถึงโครงสร้างนวัตกรรมทางวิศวกรรมอัจฉริยะพร้อมสำหรับยุคเมตาเวิร์ส (Metaverse)"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 13,
        "details": [
            {
                "category": "วิชาวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "วอ.341": {
                        "ชื่อไทย": "วิศวกรรมความปลอดภัย",
                        "ชื่ออังกฤษ": "Safety Engineering",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.351": {
                        "ชื่อไทย": "ปฏิบัติการกรรมวิธีการผลิต",
                        "ชื่ออังกฤษ": "Manufacturing Processes Laboratory",
                        "หน่วยกิต": "1 (0-3-3)"
                    },
                    "วอ.352": {
                        "ชื่อไทย": "ปฏิบัติการวัสดุศาสตร์",
                        "ชื่ออังกฤษ": "Material Science Laboratory",
                        "หน่วยกิต": "1 (0-3-3)"
                    },
                    "วอ.353": {
                        "ชื่อไทย": "ระบบอัตโนมัติสำหรับการผลิต",
                        "ชื่ออังกฤษ": "Automated Manufacturing Technology",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.354": {
                        "ชื่อไทย": "ปฏิบัติการระบบอัตโนมัติ",
                        "ชื่ออังกฤษ": "Automation Laboratory",
                        "หน่วยกิต": "1 (0-3-3)"
                    },
                    "วอ.361": {
                        "ชื่อไทย": "การวิเคราะห์ข้อมูลอุตสาหกรรม",
                        "ชื่ออังกฤษ": "Industrial Data Analysis",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.362": {
                        "ชื่อไทย": "การควบคุมคุณภาพ",
                        "ชื่ออังกฤษ": "Quality Control",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.364": {
                        "ชื่อไทย": "การวิจัยดำเนินงาน 1",
                        "ชื่ออังกฤษ": "Operations Research I",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.370": {
                        "ชื่อไทย": "ปฏิบัติการอินเทอร์เน็ตของสรรพสิ่งเชิงประยุกต์",
                        "ชื่ออังกฤษ": "IOT application laboratory",
                        "หน่วยกิต": "1 (0-3-3)"
                    },
                    "วอ.371": {
                        "ชื่อไทย": "วิทยาการข้อมูลสำหรับวิศวกรรม",
                        "ชื่ออังกฤษ": "Data Science for engineering",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.380": {
                        "ชื่อไทย": "การเยี่ยมชมอุตสาหกรรม",
                        "ชื่ออังกฤษ": "Industrial Trips",
                        "หน่วยกิต": "0 (0-0-3)"
                    },
                    "วอ.390": {
                        "ชื่อไทย": "การฝึกงาน",
                        "ชื่ออังกฤษ": "Industrial Training",
                        "หน่วยกิต": "1",
                        "หมายเหตุ": "ไม่น้อยกว่า 240 ชั่วโมงต่อภาคการศึกษา"
                    },
                    "วอ.433": {
                        "ชื่อไทย": "การออกแบบสิ่งอำนวยความสะดวกและโรงงานอุตสาหกรรม",
                        "ชื่ออังกฤษ": "Industrial Facilities Design",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.490": {
                        "ชื่อไทย": "สัมมนาสำหรับวิศวกรรมอุตสาหการ",
                        "ชื่ออังกฤษ": "Seminar for Industrial Engineering",
                        "หน่วยกิต": "0 (0-0-3)"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 8,
        "details": [
            {
                "category": "หมวดที่ 4 โครงสร้างหลักสูตร รายวิชา และหน่วยกิต",
                "subcategories": {
                    "4.1 ระบบการจัดการศึกษาและระยะเวลาการศึกษา": {
                        "4.1.1 ระบบ": "เป็นหลักสูตรแบบเต็มเวลา ใช้ระบบการศึกษาแบบทวิภาค โดย 1 ปีการศึกษาแบ่งออกเป็น 2 ภาคการศึกษาปกติ 1 ภาคการศึกษาปกติ มีระยะเวลาศึกษาไม่น้อยกว่า 15 สัปดาห์ และมีการจัดการศึกษาภาคฤดูร้อน ในปีการศึกษาที่ 3",
                        "4.1.2 ระยะเวลาการศึกษาสูงสุด": [
                            "ไม่กำหนด",
                            "ไม่เกิน 16 ภาคการศึกษาปกติ"
                        ]
                    },
                    "4.2 การดำเนินการหลักสูตร": {
                        "4.2.1 วัน-เวลาในการดำเนินการเรียนการสอน": [
                            "วัน – เวลาราชการปกติ",
                            "นอกวัน – เวลาราชการ"
                        ],
                        "4.2.2 ระบบการศึกษา": [
                            "แบบชั้นเรียน (Onsite)",
                            "แบบทางไกล (Online)",
                            "แบบประสมประสาน (Hybrid)",
                            "อื่น ๆ (ระบุ)"
                        ]
                    },
                    "4.3 โครงสร้างหลักสูตร รายวิชา และหน่วยกิต": {
                        "4.3.1 หลักสูตร": {
                            "4.3.1.1 จำนวนหน่วยกิตรวม": "จำนวนหน่วยกิตรวมตลอดหลักสูตร 145 หน่วยกิต",
                            "4.3.1.2 โครงสร้างหลักสูตร": {
                                "รายละเอียด": "นักศึกษาจะต้องจดทะเบียนศึกษารายวิชา รวมไม่น้อยกว่า 145 หน่วยกิต โดยศึกษารายวิชาต่าง ๆ ครบตามโครงสร้างองค์ประกอบ และข้อกำหนดของหลักสูตรดังนี้",
                                "โครงสร้าง": [
                                    {
                                        "หมวด": "วิชาศึกษาทั่วไป",
                                        "หน่วยกิต": 30
                                    },
                                    {
                                        "หมวด": "วิชาเฉพาะ",
                                        "หน่วยกิต": 109,
                                        "รายละเอียด": [
                                            {
                                                "หมวดย่อย": "วิชาเฉพาะพื้นฐาน",
                                                "หน่วยกิต": 25,
                                                "รายละเอียดเพิ่มเติม": [
                                                    {
                                                        "กลุ่มวิชา": "กลุ่มวิชาพื้นฐานทางคณิตศาสตร์และวิทยาศาสตร์",
                                                        "หน่วยกิต": 18
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 65,
        "details": [
            {
                "category": "วอ.261 สถิติวิศวกรรม",
                "subcategories": {
                    "รหัสวิชา": "วอ.261",
                    "ชื่อวิชาภาษาไทย": "สถิติวิศวกรรม",
                    "ชื่อวิชาภาษาอังกฤษ": "Engineering Statistics",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "การนำเสนอและการวิเคราะห์ข้อมูล": "",
                        "ทฤษฎีความน่าจะเป็น": "",
                        "การแจกแจงทางสถิติ": "",
                        "ทฤษฎีการสุ่มตัวอย่าง": "",
                        "การประมาณค่า": "",
                        "การอนุมานทางสถิติ": "",
                        "การทดสอบสมมติฐาน": "",
                        "การวิเคราะห์ความแปรปรวน": "",
                        "การวิเคราะห์การถดถอยและสหสัมพันธ์": "",
                        "การใช้วิธีการทางสถิติในการแก้ไขปัญหา": "",
                        "การประยุกต์สถิติในเชิงวิศวกรรม": ""
                    }
                }
            },
            {
                "category": "วอ.302 เศรษฐศาสตร์วิศวกรรม",
                "subcategories": {
                    "รหัสวิชา": "วอ.302",
                    "ชื่อวิชาภาษาไทย": "เศรษฐศาสตร์วิศวกรรม",
                    "ชื่อวิชาภาษาอังกฤษ": "Engineering Economy",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "ค่าของเงินตามเวลา": "",
                        "การวิเคราะห์โครงการทางวิศวกรรมเชิงเศรษฐศาสตร์": "",
                        "การวิเคราะห์การแทนที่": "",
                        "ค่าเสื่อมราคา": "",
                        "ภาษี": "",
                        "การวิเคราะห์และตัดสินใจภายใต้ผลกระทบของภาษี": "",
                        "การวิเคราะห์และตัดสินใจเมื่อพิจารณาความเสี่ยงและความไม่แน่นอน": ""
                    }
                }
            },
            {
                "category": "วอ.304 การบริหารการดำเนินงาน",
                "subcategories": {
                    "รหัสวิชา": "วอ.304",
                    "ชื่อวิชาภาษาไทย": "การบริหารการดำเนินงาน",
                    "ชื่อวิชาภาษาอังกฤษ": "Operation Management",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "ระบบการวางแผนและควบคุมการผลิต": "",
                        "วิธีการวิจัยดำเนินงานในการแก้ปัญหาระบบการวางแผนและควบคุมการผลิต": "",
                        "เทคนิคการพยากรณ์": "",
                        "การวางแผนการผลิต": "",
                        "การวางแผนความต้องการวัสดุ": "",
                        "การจัดการพัสดุคงคลัง": "",
                        "ระบบการผลิตแบบทันเวลาพอดี/เทคนิคการผลิตแบบลีน": "",
                        "การจัดการโซ่อุปทาน": "",
                        "การจัดการโซ่อุปทานแบบยั่งยืน": "",
                        "เทคนิคการจัดลำดับงาน": "",
                        "การจัดการโครงการโดยใช้เทคนิค PERT/CPM": "",
                        "การจัดสมดุลสายการผลิต": ""
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 55,
        "details": [
            {
                "category": "วอ.466 การวิจัยดำเนินงาน 2",
                "subcategories": {
                    "รหัสวิชา": "IE466",
                    "ชื่อภาษาอังกฤษ": "Operations Research II",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วอ.364",
                    "เนื้อหาวิชา": {
                        "หัวข้อ_1": "หลักการเบื้องต้นของการจำแนกประเภทข้อมูลเพื่อการวิจัยดำเนินงาน",
                        "หัวข้อ_2": "โครงข่ายงานวิศวกรรม",
                        "หัวข้อ_3": "กำหนดการเชิงเลขจำนวนเต็ม",
                        "หัวข้อ_4": "กำหนดการแบบไม่เชิงเส้น",
                        "หัวข้อ_5": "กำหนดการเชิงพลวัต",
                        "หัวข้อ_6": "กระบวนการมาร์คอฟ",
                        "หัวข้อ_7": "กระบวนการหาคำตอบแบบมีเหตุผลเพื่อการดำเนินงานทางวิศวกรรม"
                    },
                    "Prerequisites": "Have earned credits of IE364",
                    "Course_Description_English": "Basic principles of data classification for OR. Engineering Network. Integer/Non-Linear/Dynamic Programming Approaches. Markov Processes. Metaheuristics Algorithms for Engineering Operations."
                }
            },
            {
                "category": "วอ.467 การออกแบบการทดลอง",
                "subcategories": {
                    "รหัสวิชา": "IE467",
                    "ชื่อภาษาอังกฤษ": "Design of Experiment",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วอ.361",
                    "เนื้อหาวิชา": {
                        "หัวข้อ_1": "การวิเคราะห์ข้อมูลเชิงธุรกิจ และการวิเคราะห์ข้อมูลอุตสาหกรรม",
                        "หัวข้อ_2": "การเรียนรู้ด้วยเครื่องสำหรับกระบวนการมาตรฐานเพื่อการเชื่อมโยงอุตสาหกรรม",
                        "หัวข้อ_3": "หลักการเบื้องต้นของการจำแนกประเภทข้อมูล",
                        "หัวข้อ_4": "หลักการออกแบบการทดลองเพื่อพัฒนาประสิทธิภาพของกระบวนการและผลิตภัณฑ์",
                        "หัวข้อ_5": "การวางแผนและการดำเนินการทดลองอย่างเป็นระบบ",
                        "หัวข้อ_6": "การศึกษาหลักการออกแบบชนิดต่าง ๆ สำหรับการทดลอง",
                        "หัวข้อ_7": "การทดลองเชิงเดี่ยวหรือเป็นชุด",
                        "หัวข้อ_8": "การวิเคราะห์ผลตอบสนองที่เกิดขึ้นจากการเปลี่ยนแปลงค่าระดับของปัจจัย",
                        "หัวข้อ_9": "การออกแบบแฟคทอเรียลทั่วไป",
                        "หัวข้อ_10": "การออกแบบชนิด 2k แฟคทอเรียล",
                        "หัวข้อ_11": "การออกแบบที่มีข้อจำกัดจากการทดลอง เช่น การออกแบบชนิดแรนดอมไมซ์บล็อก การออกแบบชนิดลาตินสแควร์ และการออกแบบคอนฟาวด์",
                        "หัวข้อ_12": "กรณีศึกษาการประยุกต์ใช้ในโรงงานอุตสาหกรรม",
                        "หัวข้อ_13": "การวางแผนและการควบคุมการผลิต",
                        "หัวข้อ_14": "การดำเนินงาน การวิเคราะห์และการออกแบบผลิตภัณฑ์และกระบวนการ",
                        "หัวข้อ_15": "การควบคุมคุณภาพ"
                    },
                    "Prerequisites": "Have earned credits of IE361",
                    "Course_Description_English": "Business data analytics and industrial data anlysis. Introductory machine learning for cross-industry standard process. Basic principles of data classification. Principles of a design of experiment for product and process improvement, planning and performing single or sequential experiments, output response analysis with the changes of input factors, general factorial designs, 2k factorial designs, and some limitations of experiments, randomised blocks and latin squares designs, including confounding in experimental design"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 28,
        "details": [
            {
                "category": "หมวดสุขภาวะและทักษะแห่งอนาคต",
                "subcategories": {
                    "รายวิชา": "มธ.108 การพัฒนาและจัดการตนเอง",
                    "ชื่อภาษาอังกฤษ": "TU108 Self Development and Management",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา": {
                        "ภาษาไทย": "การจัดการและการปรับเข้ากับชีวิตในรั้วมหาวิทยาลัย ท่ามกลางความหลากหลายและเสรีภาพ การพัฒนาทักษะทางสังคมและความฉลาดทางอารมณ์ การเข้าใจตนเองและการวางแผนอนาคต การพัฒนาบุคลิกภาพและมารยาททางสังคม การเรียนรู้ตลอดชีวิต การอยู่ร่วมกับผู้อื่นอย่างสงบสุขและเคารพซึ่งกันและกัน และการดูแลสุขภาพแบบองค์รวม",
                        "ภาษาอังกฤษ": "Coping with and adaptation to university life. Development of social skill and emotional intelligence. Self-understanding and planning for the future. Personality and social etiquette. Lifelong learning. Learning to live harmoniously and respectfully with others and the society. Holistic healthcare."
                    }
                }
            },
            {
                "category": "หมวดการบริการสังคมและการเรียนรู้จากการปฏิบัติ",
                "subcategories": {
                    "รายวิชา": "มธ.100 พลเมืองกับการลงมือแก้ปัญหา",
                    "ชื่อภาษาอังกฤษ": "TU100 Civic Engagement",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา": {
                        "ภาษาไทย": "ปลูกฝังจิตสำนึก บทบาท และหน้าที่ความรับผิดชอบของการเป็นสมาชิกที่ดีของสังคมในฐานะพลเมืองโลกผ่านกระบวนการหลากหลายวิธี เช่น การบรรยาย การอภิปรายกรณีศึกษาต่าง ๆ ดูงาน เป็นต้น โดยนักศึกษาจะต้องจัดทำโครงการรณรงค์ เพื่อให้เกิดการรับรู้ หรือเกิดการเปลี่ยนแปลง ในประเด็นที่สนใจ",
                        "ภาษาอังกฤษ": "Instillation of social conscience and awareness of one's role and duties as a good global citizen. This is done through a variety of methods such as lectures, discussion of various case studies and field study outings. Students are required to organise a campaign to raise awareness or bring about change in an area of their interest."
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 64,
        "details": [
            {
                "category": "รายวิชาในหลักสูตรที่เปิดสอนให้วิทยาลัย/คณะ/ภาควิชา/หลักสูตรอื่นต้องมาเรียน",
                "subcategories": {
                    "วอ.121_วัสดุวิศวกรรม": {
                        "รหัสวิชา": "วอ.121",
                        "ชื่อวิชา": "วัสดุวิศวกรรม",
                        "หน่วยกิต": "3 (3-0-6)",
                        "ชื่อภาษาอังกฤษ": "IE121 Engineering Materials",
                        "คำอธิบายรายวิชา": "ความสัมพันธ์ระหว่าง โครงสร้าง สมบัติ กระบวนการผลิต และการประยุกต์ใช้งานของกลุ่มวิศวกรรมหลัก ได้แก่ โลหะ พอลิเมอร์ เซรามิกส์ และวัสดุผสม แผนภูมิสมดุล สมบัติทางกล และการเสื่อมสภาพของวัสดุ",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Relationship between structures, properties, production processed and applications of main groups of engineering materials i.e, metals, polymers, Ceramics and composites; phase equilibrium diagrams mechanical properties and materials degradation."
                    },
                    "วอ.250_กรรมวิธีการผลิต": {
                        "รหัสวิชา": "วอ.250",
                        "ชื่อวิชา": "กรรมวิธีการผลิต",
                        "หน่วยกิต": "3 (3-0-6)",
                        "ชื่อภาษาอังกฤษ": "IE250 Manufacturing Processes",
                        "คำอธิบายรายวิชา": "กรรมวิธีการผลิตแบบต่าง ๆ เช่น การหล่อ การขึ้นรูป การเชื่อม การใช้อุปกรณ์ เครื่องมือ และเครื่องจักรที่ควบคุมด้วยระบบคอมพิวเตอร์ และต้นทุนในการผลิต ระบบมาตรฐานในเรื่องความสามารถการแลกเปลี่ยน ข้อกำหนดของพิกัดความเผื่อ อาชีวอนามัย หลักการการทำงานที่ปลอดภัย การผลิตที่คำนึงถึงสิ่งแวดล้อม และการบำรุงรักษาเครื่องจักรเบื้องต้น",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Various manufacturing processes such as casting, forming, welding, machine tools and CNC machines, and production costs. Standards in engineering metrology and interchangeability. Occupational health and safety. Environmentally conscious production and basic machine maintenance."
                    },
                    "วอ.252_ปฏิบัติการเครื่องมือพื้นฐานทางวิศวกรรมและการใช้งาน": {
                        "รหัสวิชา": "วอ.252",
                        "ชื่อวิชา": "ปฏิบัติการเครื่องมือพื้นฐานทางวิศวกรรมและการใช้งาน",
                        "หน่วยกิต": "1 (0-3-3)",
                        "ชื่อภาษาอังกฤษ": "IE252 Engineering Tools and Operations Laboratory",
                        "คำอธิบายรายวิชา": "ปฏิบัติการที่เกี่ยวข้องกับกระบวนการผลิตงานโลหะพื้นฐาน เช่น งานร่างแบบ งานโลหะแผ่น งานเชื่อม งานกัด งานกลึง งานเจียระไน การใช้เครื่องมือวัดในงานวิศวกรรม อาชีวอนามัย หลักการการทำงานที่ปลอดภัย การผลิตที่คำนึงถึงสิ่งแวดล้อม และการบำรุงรักษาเครื่องจักรเบื้องต้น",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Work in basic workshop. Working processes such as bench work, sheet metal working, welding, shaping, turning, milling and grinding. Engineering metrology. Occupational health and safety. Environmentally conscious production and basic machine maintenance."
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 52,
        "details": [
            {
                "category": "วอ.415 การจำลองระบบเสมือนจริงในรูปแบบดิจิทัล",
                "subcategories": {
                    "รหัสวิชา": "วอ.415",
                    "ชื่อวิชาภาษาไทย": "การจำลองระบบเสมือนจริงในรูปแบบดิจิทัล",
                    "ชื่อวิชาภาษาอังกฤษ": "Digital Twins Modelling",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหาภาษาไทย": {
                        "หัวข้อ_1": "หลักการและพื้นฐานเทคโนโลยีดิจิทัลในการจำลองระบบเสมือนจริงในรูปแบบดิจิทัล",
                        "หัวข้อ_2": "การประยุกต์ใช้งานในธุรกิจและกระบวนการผลิต",
                        "หัวข้อ_3": "หลักการออกแบบและประยุกต์ใช้เทคโนโลยีดิจิทัลในการพัฒนากระบวนการผลิต",
                        "หัวข้อ_4": "การสร้างระบบเสมือนจริงในรูปแบบดิจิทัล",
                        "หัวข้อ_5": "การทวนสอบความถูกต้องของระบบเสมือนจริง",
                        "หัวข้อ_6": "การวิเคราะห์เปรียบเทียบแผนการปรับปรุงกระบวนการ"
                    },
                    "เนื้อหาภาษาอังกฤษ": {
                        "หัวข้อ_1": "Introduction to digital technologies for industrial visualization",
                        "หัวข้อ_2": "Application in various real-world domains in the context of Industry 4.0",
                        "หัวข้อ_3": "Design concepts of production processes that implement digital technologies",
                        "หัวข้อ_4": "Development of industrial visualization models using software",
                        "หัวข้อ_5": "Model validation and verification",
                        "หัวข้อ_6": "Comparison analysis of improvement plans"
                    }
                }
            },
            {
                "category": "วอ.416 การจัดการซัพพลายเชน",
                "subcategories": {
                    "รหัสวิชา": "วอ.416",
                    "ชื่อวิชาภาษาไทย": "การจัดการซัพพลายเชน",
                    "ชื่อวิชาภาษาอังกฤษ": "Supply Chain Management",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วอ.312",
                    "เนื้อหาภาษาไทย": {
                        "หัวข้อ_1": "แนวคิดการจัดการซัพพลายเชน",
                        "หัวข้อ_2": "ระบบการบริหารข้อมูลและการแลกเปลี่ยนข้อมูลอิเลคทรอนิคส์",
                        "หัวข้อ_3": "การจัดการซัพพลายเชนแบบดิจิทัล",
                        "หัวข้อ_4": "การสร้างพันธมิตรในการผลิต",
                        "หัวข้อ_5": "กลยุทธ์แผนการจัดซื้อ",
                        "หัวข้อ_6": "การพัฒนาผู้ส่งมอบและสร้างความร่วมมือระยะยาว",
                        "หัวข้อ_7": "การบริหารความเสี่ยงในซัพพลายเชน",
                        "หัวข้อ_8": "ระบบการขนถ่ายวัสดุแบบอัตโนมัติ",
                        "หัวข้อ_9": "คลังสินค้าอัจฉริยะ",
                        "หัวข้อ_10": "การกระจายสินค้า",
                        "หัวข้อ_11": "การบริการลูกค้า",
                        "หัวข้อ_12": "การจัดการซัพพลายเชนแบบยั่งยืน",
                        "หัวข้อ_13": "นโยบายส่งเสริมการจัดการซัพพลายเชน"
                    },
                    "เนื้อหาภาษาอังกฤษ": {
                        "หัวข้อ_1": "Concept of supply chain management",
                        "หัวข้อ_2": "Data interchange and information sharing",
                        "หัวข้อ_3": "Digital supply chain management",
                        "หัวข้อ_4": "Manufacturing alliance strategy",
                        "หัวข้อ_5": "Strategic procurement",
                        "หัวข้อ_6": "Suppliers' development and long-term relationship",
                        "หัวข้อ_7": "Supply chain risk management",
                        "หัวข้อ_8": "Automated material handling technologies",
                        "หัวข้อ_9": "Smart warehouse",
                        "หัวข้อ_10": "Distribution",
                        "หัวข้อ_11": "Customer services",
                        "หัวข้อ_12": "Sustainable supply chain",
                        "หัวข้อ_13": "Supply chain management at policy level"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 17,
        "details": [
            {
                "category": "ด้านการออกแบบทางอุตสาหกรรมอย่างอัจฉริยะ (SMART INDUSTRIAL DESIGN)",
                "subcategories": {
                    "วอ.436": {
                        "ชื่อไทย": "การออกแบบโดยเน้นประสบการณ์ของลูกค้า",
                        "ชื่ออังกฤษ": "Customer Experience Design",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.437": {
                        "ชื่อไทย": "การออกแบบเพื่อความยั่งยืน",
                        "ชื่ออังกฤษ": "Sustainability Design",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.445": {
                        "ชื่อไทย": "การยศาสตร์และปัจจัยมนุษย์ในการออกแบบทางวิศวกรรม",
                        "ชื่ออังกฤษ": "Human factors and Ergonomics in Engineering and Design",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.446": {
                        "ชื่อไทย": "การออกแบบการปฏิสัมพันธ์ระบบกับคน",
                        "ชื่ออังกฤษ": "Human System Interaction and Design",
                        "หน่วยกิต": "3 (3-0-6)"
                    }
                }
            },
            {
                "category": "หัวข้อพิเศษ",
                "subcategories": {
                    "วอ.429": {
                        "ชื่อไทย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการ 1",
                        "ชื่ออังกฤษ": "Special Topics for Industrial Engineering I",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.439": {
                        "ชื่อไทย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการ 2",
                        "ชื่ออังกฤษ": "Special Topics for Industrial Engineering II",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.449": {
                        "ชื่อไทย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการ 3",
                        "ชื่ออังกฤษ": "Special Topics for Industrial Engineering III",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.459": {
                        "ชื่อไทย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการ 4",
                        "ชื่ออังกฤษ": "Special Topics for Industrial Engineering IV",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.479": {
                        "ชื่อไทย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการ 5",
                        "ชื่ออังกฤษ": "Special Topics for Industrial Engineering V",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.499": {
                        "ชื่อไทย": "หัวข้อพิเศษทางวิศวกรรมอุตสาหการ 6",
                        "ชื่ออังกฤษ": "Special Topics for Industrial Engineering VI",
                        "หน่วยกิต": "3 (3-0-6)"
                    }
                }
            },
            {
                "category": "วิชาเลือกเสรี",
                "subcategories": {
                    "รายละเอียด": "นักศึกษาสามารถเลือกศึกษาวิชาใดก็ได้ โดยเป็นรายวิชาที่มีรหัสวิชาตั้งแต่ ระดับ 200 ขึ้นไป ที่เปิดสอนในมหาวิทยาลัยธรรมศาสตร์ เป็นวิชาเลือกเสรีไม่น้อยกว่า 6 หน่วยกิต",
                    "จำนวนหน่วยกิต": "6 หน่วยกิต"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 24,
        "details": [
            {
                "category": "มธ.109 นวัตกรรมกับกระบวนคิดผู้ประกอบการ",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "TU109 Innovation and Entrepreneurial Mindset",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา_ภาษาไทย": "การประเมินความเสี่ยงและการสร้างโอกาสใหม่ การคิดและการวางแผนแบบผู้ประกอบการ การตัดสินใจและการพัฒนาธุรกิจ การสื่อสารเชิงธุรกิจและการสร้างแรงจูงใจอย่างมีประสิทธิภาพ การสร้างคุณค่าร่วมเพื่อสังคม",
                    "คำอธิบายรายวิชา_ภาษาอังกฤษ": "Risk assessment and creating new opportunities. Thinking and planning as an entrepreneur. Decision making and entrepreneurial venture development. Business communication for delivering concept or initiative in an efficient, effective and compelling manner. Social shared value creation."
                }
            },
            {
                "category": "หมวดสุนทรียะและทักษะการสื่อสาร",
                "subcategories": {
                    "ศศ.101": {
                        "ชื่อวิชา": "การคิด อ่าน และเขียนอย่างมีวิจารณญาณ",
                        "ชื่อภาษาอังกฤษ": "LAS101 Critical Thinking, Reading, and Writing",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา_ภาษาไทย": "พัฒนาทักษะการคิดอย่างมีวิจารณญาณผ่านการตั้งคำถาม การวิเคราะห์ การสังเคราะห์ และการประเมินค่า พัฒนาทักษะการอ่านเพื่อจับสาระสำคัญ เข้าใจจุดมุ่งหมาย ทัศนคติ สมมติฐาน หลักฐานสนับสนุน การใช้เหตุผลที่นำไปสู่ข้อสรุปของงานเขียน พัฒนาทักษะการเขียนแสดงความคิดเห็นอย่างมีเหตุผลและการเขียนเชิงวิชาการ รู้จักถ่ายทอดความคิด และเชื่อมโยงข้อมูลเข้ากับมุมมองของตนเอง รวมถึงสามารถอ้างอิงหลักฐานและข้อมูลมาใช้ในการสร้างสรรค์งานเขียนได้อย่างมีประสิทธิภาพ",
                        "คำอธิบายรายวิชา_ภาษาอังกฤษ": "Development of critical thinking through questioning, analytical, synthetic and evaluation skills. Students learn how to read without necessarily accepting all the information presented in the text, but rather consider the content in depth, taking into account the objectives, perspectives, assumptions, bias and supporting evidence, as well as logic or strategies leading to the author's conclusion. The purpose is to apply these methods to students' own persuasive writing based on information researched from various sources, using effective presentation techniques."
                    },
                    "สษ.105": {
                        "ชื่อวิชา": "ทักษะการสื่อสารทางภาษาอังกฤษ",
                        "ชื่อภาษาอังกฤษ": "EL105 English Communication Skills",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา_ภาษาไทย": "พัฒนาทักษะการสื่อสารทางภาษาอังกฤษด้านการฟัง พูด อ่าน และเขียน ฝึกการใช้ภาษาคำศัพท์ และสำนวนในบริบททางวิชาการและสังคม"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 12,
        "details": [
            {
                "category": "วิชาพื้นฐานทางวิทยาศาสตร์และคณิตศาสตร์",
                "subcategories": {
                    "วท.184": {
                        "ชื่อวิชา": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 2",
                        "หน่วยกิต": "1 (0-3-0)",
                        "ชื่อภาษาอังกฤษ": "Physics for Engineers Laboratory II"
                    }
                }
            },
            {
                "category": "กลุ่มวิชาพื้นฐานทางวิศวกรรม",
                "subcategories": {
                    "วก.100": {
                        "ชื่อวิชา": "กราฟิกวิศวกรรม",
                        "หน่วยกิต": "3 (2-3-4)",
                        "ชื่อภาษาอังกฤษ": "Engineering Graphics"
                    },
                    "วศว.100": {
                        "ชื่อวิชา": "จริยธรรมสำหรับวิศวกร",
                        "หน่วยกิต": "0 (0-0-0)",
                        "ชื่อภาษาอังกฤษ": "Ethics for Engineers"
                    },
                    "วศว.101": {
                        "ชื่อวิชา": "เทคโนโลยีสารสนเทศสมัยใหม่เบื้องต้น",
                        "หน่วยกิต": "1 (1-0-2)",
                        "ชื่อภาษาอังกฤษ": "Introduction to Modern Information Technologies"
                    },
                    "วอ.121": {
                        "ชื่อวิชา": "วัสดุวิศวกรรม",
                        "หน่วยกิต": "3 (3-0-6)",
                        "ชื่อภาษาอังกฤษ": "Engineering Materials"
                    }
                }
            },
            {
                "category": "วิชาเฉพาะด้าน",
                "subcategories": {
                    "กลุ่มวิชาบังคับทางวิศวกรรม": {
                        "หน่วยกิตรวม": "69 หน่วยกิต",
                        "วิชาบังคับในสาขา": {
                            "หน่วยกิตรวม": "46 หน่วยกิต",
                            "รายวิชา": {
                                "วอ.230": {
                                    "ชื่อวิชา": "การเขียนแบบทางวิศวกรรมอุตสาหการ",
                                    "หน่วยกิต": "1 (0-3-3)",
                                    "ชื่อภาษาอังกฤษ": "Industrial Drawing"
                                },
                                "วอ.250": {
                                    "ชื่อวิชา": "กรรมวิธีการผลิต",
                                    "หน่วยกิต": "3 (3-0-6)",
                                    "ชื่อภาษาอังกฤษ": "Manufacturing Processes"
                                },
                                "วอ.261": {
                                    "ชื่อวิชา": "สถิติวิศวกรรม",
                                    "หน่วยกิต": "3 (3-0-6)",
                                    "ชื่อภาษาอังกฤษ": "Engineering Statistics"
                                },
                                "วอ.301": {
                                    "ชื่อวิชา": "ปฏิบัติการทางสถิติและวิศวกรรมอุตสาหการ",
                                    "หน่วยกิต": "1 (0-3-3)",
                                    "ชื่อภาษาอังกฤษ": "Statistics and Industrial Engineering Laboratory"
                                },
                                "วอ.302": {
                                    "ชื่อวิชา": "เศรษฐศาสตร์วิศวกรรม",
                                    "หน่วยกิต": "3 (3-0-6)",
                                    "ชื่อภาษาอังกฤษ": "Engineering Economy"
                                },
                                "วอ.311": {
                                    "ชื่อวิชา": "การศึกษาการปฏิบัติงานทางอุตสาหกรรม",
                                    "หน่วยกิต": "3 (3-0-6)",
                                    "ชื่อภาษาอังกฤษ": "Industrial Work Study"
                                },
                                "วอ.312": {
                                    "ชื่อวิชา": "การวางแผนและควบคุมการผลิต",
                                    "หน่วยกิต": "3 (3-0-6)",
                                    "ชื่อภาษาอังกฤษ": "Production Planning and Control"
                                },
                                "วอ.313": {
                                    "ชื่อวิชา": "วิศวกรรมการบำรุงรักษา",
                                    "หน่วยกิต": "3 (3-0-6)",
                                    "ชื่อภาษาอังกฤษ": "Maintenance Engineering"
                                }
                            }
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 30,
        "details": [
            {
                "category": "ค.214 สมการเชิงอนุพันธ์",
                "subcategories": {
                    "รหัสวิชา": "ค.214",
                    "ชื่อวิชาภาษาไทย": "สมการเชิงอนุพันธ์",
                    "ชื่อวิชาภาษาอังกฤษ": "MA214 Differential Equations",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ ค.112 หรือ ค.219",
                    "เนื้อหา": {
                        "ภาษาไทย": "สมการเชิงอนุพันธ์อันดับหนึ่ง, สมการเชิงอนุพันธ์อันดับสอง, สมการเชิงอนุพันธ์เชิงเส้นเอกพันธ์, สมการเชิงอนุพันธ์เชิงเส้นไม่เอกพันธ์, สมการเชิงอนุพันธ์อันดับสูง, ผลเฉลยในรูปอนุกรมของสมการเชิงอนุพันธ์เชิงเส้น, ฟังก์ชันพิเศษ, สมการเชิงอนุพันธ์ย่อย, การแปลงลาปลาซ, สมการเชิงอนุพันธ์สามัญไม่เชิงเส้นเบื้องต้น, การประยุกต์ในการแก้ปัญหาทางวิศวกรรม",
                        "ภาษาอังกฤษ": "First order differential equations, second order differential equations, homogeneous linear differential equations, nonhomogeneous linear differential equations, differential equations of higher order, series solutions of linear differential equations, special functions, partial differential equations, the Laplace transform, introduction to nonlinear ordinary differential equations, applications in engineering problem solving"
                    }
                }
            },
            {
                "category": "วท.133 ฟิสิกส์สำหรับวิศวกร 1",
                "subcategories": {
                    "รหัสวิชา": "วท.133",
                    "ชื่อวิชาภาษาไทย": "ฟิสิกส์สำหรับวิศวกร 1",
                    "ชื่อวิชาภาษาอังกฤษ": "SC133 Physics for Engineers I",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "ภาษาไทย": "การเคลื่อนที่, แรง, ความโน้มถ่วง, งานและพลังงาน, การชน, การเคลื่อนที่แบบหมุน, วัตถุในสภาพสมดุล, ความยืดหยุ่นและการแตกร้าว, ของไหล, การสั่นและคลื่น, เสียงและการประยุกต์, ความร้อนและทฤษฎีจลน์ของก๊าซ, กฎข้อ 1 และ 2 ของอุณหพลศาสตร์",
                        "ภาษาอังกฤษ": "Motion, force, gravity, work and energy, collisions, rotational motion, bodies in equilibrium, elastic and fractures, fluids, vibrations and waves, sound and applications, heat and the kinetic theory, the first and the second laws of thermodynamics"
                    }
                }
            },
            {
                "category": "วท.134 ฟิสิกส์สำหรับวิศวกร 2",
                "subcategories": {
                    "รหัสวิชา": "วท.134",
                    "ชื่อวิชาภาษาไทย": "ฟิสิกส์สำหรับวิศวกร 2",
                    "ชื่อวิชาภาษาอังกฤษ": "SC134 Physics for Engineers II",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วท.133",
                    "เนื้อหา": {
                        "ภาษาไทย": "ประจุไฟฟ้าและสนามไฟฟ้า, กฎของเกาส์, ศักย์ไฟฟ้า, ความจุไฟฟ้า, ไดอิเล็กตริก, กระแสไฟฟ้า, วงจรไฟฟ้ากระแสตรงและอุปกรณ์, แม่เหล็กและแม่เหล็กไฟฟ้า, การเหนี่ยวนำแม่เหล็กและกฎของฟาราเดย์, ตัวเหนี่ยวนำ, วงจรไฟฟ้ากระแสสลับ, ทฤษฎีคลื่นแม่เหล็กไฟฟ้าและการประยุกต์, แสง, เลนส์และทัศนอุปกรณ์, การสะท้อน, การหักเห, การเลี้ยวเบน, การแทรกสอดและโพลาไรเซชัน, ฟิสิกส์แผนใหม่"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 3,
        "details": [
            {
                "category": "สถานที่จัดการเรียนการสอน",
                "subcategories": {
                    "ศูนย์_1": "ศูนย์รังสิต",
                    "ศูนย์_2": "ท่าพระจันทร์",
                    "ศูนย์_3": "ศูนย์พัทยา",
                    "ศูนย์_4": "ศูนย์ลำปาง"
                }
            },
            {
                "category": "ค่าใช้จ่ายตลอดหลักสูตร",
                "subcategories": {
                    "ประเภทโครงการ": {
                        "โครงการ_1": "โครงการปกติ",
                        "โครงการ_2": "โครงการพิเศษ",
                        "โครงการ_3": "โครงการปกติและโครงการพิเศษ"
                    },
                    "ค่าใช้จ่าย": {
                        "นักศึกษาไทย": "147,440 บาท",
                        "นักศึกษาต่างชาติ": "ไม่ระบุ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 11,
        "details": [
            {
                "category": "วิชาเฉพาะ",
                "subcategories": {
                    "จำนวนหน่วยกิตรวม": "109 หน่วยกิต",
                    "วิชาเฉพาะพื้นฐาน": {
                        "จำนวนหน่วยกิต": "25 หน่วยกิต",
                        "กลุ่มวิชาพื้นฐานทางคณิตศาสตร์และวิทยาศาสตร์": {
                            "จำนวนหน่วยกิต": "18 หน่วยกิต",
                            "รายวิชา": [
                                {
                                    "รหัสวิชา": "ค.111",
                                    "ชื่อวิชาภาษาไทย": "แคลคูลัสพื้นฐาน",
                                    "ชื่อวิชาภาษาอังกฤษ": "Fundamentals of Calculus",
                                    "หน่วยกิต": "3 (3-0-6)"
                                },
                                {
                                    "รหัสวิชา": "ค.112",
                                    "ชื่อวิชาภาษาไทย": "เรขาคณิตวิเคราะห์และแคลคูลัสประยุกต์",
                                    "ชื่อวิชาภาษาอังกฤษ": "Analytic Geometry and Applied Calculus",
                                    "หน่วยกิต": "3 (3-0-6)"
                                },
                                {
                                    "รหัสวิชา": "ค.214",
                                    "ชื่อวิชาภาษาไทย": "สมการเชิงอนุพันธ์",
                                    "ชื่อวิชาภาษาอังกฤษ": "Differential Equations",
                                    "หน่วยกิต": "3 (3-0-6)"
                                },
                                {
                                    "รหัสวิชา": "วท.133",
                                    "ชื่อวิชาภาษาไทย": "ฟิสิกส์สำหรับวิศวกร 1",
                                    "ชื่อวิชาภาษาอังกฤษ": "Physics for Engineers I",
                                    "หน่วยกิต": "3 (3-0-6)"
                                },
                                {
                                    "รหัสวิชา": "วท.134",
                                    "ชื่อวิชาภาษาไทย": "ฟิสิกส์สำหรับวิศวกร 2",
                                    "ชื่อวิชาภาษาอังกฤษ": "Physics for Engineers II",
                                    "หน่วยกิต": "3 (3-0-6)"
                                },
                                {
                                    "รหัสวิชา": "วท.173",
                                    "ชื่อวิชาภาษาไทย": "ปฏิบัติการเคมีพื้นฐาน",
                                    "ชื่อวิชาภาษาอังกฤษ": "Fundamental Chemistry Laboratory",
                                    "หน่วยกิต": "1 (0-3-0)"
                                },
                                {
                                    "รหัสวิชา": "วท.183",
                                    "ชื่อวิชาภาษาไทย": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 1",
                                    "ชื่อวิชาภาษาอังกฤษ": "Physics Laboratory for Engineers I",
                                    "หน่วยกิต": "1 (0-3-0)"
                                }
                            ]
                        }
                    }
                }
            },
            {
                "category": "วิชาบังคับเลือก",
                "subcategories": {
                    "จำนวนหน่วยกิต": "3 หน่วยกิต",
                    "จำนวนวิชาที่ต้องเลือก": "1 วิชา",
                    "รายวิชา": [
                        {
                            "รหัสวิชา": "วคม.106",
                            "ชื่อวิชาภาษาไทย": "ความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน",
                            "ชื่อวิชาภาษาอังกฤษ": "Sustainability of Natural Resources and Energy",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วคม.107",
                            "ชื่อวิชาภาษาไทย": "เทคโนโลยีอัจฉริยะเพื่อชีวิตยุคใหม่",
                            "ชื่อวิชาภาษาอังกฤษ": "Smart Technology for Modern Life",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "มธ.103",
                            "ชื่อวิชาภาษาไทย": "ชีวิตกับความยั่งยืน",
                            "ชื่อวิชาภาษาอังกฤษ": "Life and Sustainability",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "มธ.107",
                            "ชื่อวิชาภาษาไทย": "ทักษะดิจิทัลกับการแก้ปัญหา",
                            "ชื่อวิชาภาษาอังกฤษ": "Digital Skill and Problem Solving",
                            "หน่วยกิต": "3 (3-0-6)"
                        }
                    ]
                }
            },
            {
                "category": "หมวดสุขภาวะและทักษะแห่งอนาคต",
                "subcategories": {
                    "จำนวนหน่วยกิต": "3 หน่วยกิต",
                    "จำนวนวิชาที่ต้องเรียน": "1 วิชา",
                    "รายวิชา": [
                        {
                            "รหัสวิชา": "มธ.108",
                            "ชื่อวิชาภาษาไทย": "การพัฒนาและจัดการตนเอง",
                            "ชื่อวิชาภาษาอังกฤษ": "Self Development and Management",
                            "หน่วยกิต": "3 (3-0-6)"
                        }
                    ]
                }
            },
            {
                "category": "หมวดการบริการสังคมและการเรียนรู้จากการปฏิบัติ",
                "subcategories": {
                    "จำนวนหน่วยกิต": "3 หน่วยกิต",
                    "จำนวนวิชาที่ต้องเรียน": "1 วิชา",
                    "รายวิชา": [
                        {
                            "รหัสวิชา": "มธ.100",
                            "ชื่อวิชาภาษาไทย": "พลเมืองกับการลงมือแก้ปัญหา",
                            "ชื่อวิชาภาษาอังกฤษ": "Civic Engagement",
                            "หน่วยกิต": "3 (3-0-6)"
                        }
                    ]
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 50,
        "details": [
            {
                "category": "วิชาเลือกด้านการดำเนินงานอย่างอัจฉริยะและการเป็นผู้ประกอบการ (SMART OM & ENTREPRENEUR)",
                "subcategories": {
                    "วอ.405 สตาร์ทอัพเทคโนโลยี": {
                        "ชื่อภาษาอังกฤษ": "IE405 Tech Start Up",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "แนะนำธุรกิจสตาร์ทอัพเทคโนโลยี ความแตกต่างของธุรกิจสตาร์ทอัพเทคโนโลยี กับวิสาหกิจขนาดกลางและขนาดย่อม ระบบนิเวศน์ของธุรกิจสตาร์ทอัพเทคโนโลยี ตัวแบบทางธุรกิจ การนำออกสู่ตลาด แหล่งเงินทุนและการระดมทุน ปัจจัยที่ทำให้ธุรกิจสตาร์ทอัพเทคโนโลยีประสบความสำเร็จ ทดลองทำโครงการธุรกิจสตาร์ทอัพเทคโนโลยี",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Introduction to Tech Startup business. Different between Startup and SMEs. Startup ecosystem. Tech Startup ideas and design. Startup business model and market launch. Startup sources of fund and funding. Success factors of Tech Startup. Case study project."
                    },
                    "วอ.406 การจัดการทางวิศวกรรม": {
                        "ชื่อภาษาอังกฤษ": "IE406 Engineering Management",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "วิวัฒนาการของการจัดการ แนวคิดและทฤษฎีของการจัดการเพื่อการแข่งขันในระบบเศรษฐกิจแบบใหม่ การจัดการกับงานวิศวกรรม บทบาทของวิศวกรกับการจัดการในองค์การ การวางแผนงานวิศวกรรม การบริหารโครงการ การบริหารความปลอดภัย การตลาดและการเงินเบื้องต้นสำหรับวิศวกร การวิเคราะห์สภาพแวดล้อมทางการจัดการ แรงจูงใจในการทำงาน ภาวะผู้นำ หลักการสื่อสารในองค์การ กฎหมายอุตสาหกรรมและพาณิชยกรรมเบื้องต้น",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Evolution of management. Concepts and theories of modern management for competing in the new economy. Management and engineering. Role of engineer and organization management. Engineering planning. Project management. Industrial safety management. Marketing and basic finance for engineer. Management environment analyses. Work incentive. Leadership. Principle of organization communication. Industrial and commercial laws."
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 49,
        "details": [
            {
                "category": "IE486 Industrial Engineering Project",
                "subcategories": {
                    "Prerequisites": "Have taken IE302, IE311, IE312, IE313, IE341, IE362 and IE364",
                    "Description": "Study and problem solving in industry for the purpose of research and development",
                    "Group_Size": "Conducted individually or in groups not exceeding 3 students",
                    "Project_Types": {
                        "Type_1": "A search for invention that can be developed into commercialized product",
                        "Type_2": "Problem solving in manufacturing, process improvement, or utilization of defections or rejects",
                        "Type_3": "Technological improvement, management of information and servicing for business decision making"
                    },
                    "Course_Components": {
                        "Component_1": "Defining research topic",
                        "Component_2": "Analyzing data and problem",
                        "Component_3": "Identifying research objectives",
                        "Component_4": "Setting scope of study",
                        "Component_5": "Outlining research steps",
                        "Component_6": "Studying methodology",
                        "Component_7": "Reviewing related literature"
                    },
                    "Evaluation": "Evaluated by committee consisting of lecturers and industrial associates",
                    "Deliverables": {
                        "Deliverable_1": "Submit reports",
                        "Deliverable_2": "Make oral presentation"
                    }
                }
            },
            {
                "category": "IE487 Industrial Engineering Co-operative Education II",
                "subcategories": {
                    "Course_Code": "วอ.487",
                    "Thai_Name": "สหกิจศึกษาวิศวกรรมอุตสาหการ 2",
                    "Credits": "9",
                    "Duration": "ปฏิบัติงานไม่น้อยกว่า 16 สัปดาห์/ภาคการศึกษา",
                    "Prerequisites": "Have earned credits of IE486",
                    "Description": "Study and analyse problem in industry which is a continuous study from IE486",
                    "Course_Components": {
                        "Component_1": "Analyse work following methodologies of study from IE486",
                        "Component_2": "Improve work following methodologies of study from IE486"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 57,
        "details": [
            {
                "category": "วอ.473 การวิเคราะห์ข้อมูลขนาดใหญ่และการเรียนรู้ของเครื่อง",
                "subcategories": {
                    "บทนำ": "บทนำเกี่ยวกับปัญญาประดิษฐ์ การเรียนรู้ของเครื่องและสถิติที่เกี่ยวข้อง",
                    "ประเภทการเรียนรู้": {
                        "การเรียนรู้แบบมีผู้สอน": "Supervised learning",
                        "การเรียนรู้แบบไม่มีผู้สอน": "Unsupervised learning",
                        "การเรียนรู้แบบกึ่งมีผู้สอน": "Semi-supervised learning",
                        "การเรียนรู้แบบเสริมกำลัง": "Reinforcement learning"
                    },
                    "เทคนิคการเรียนรู้ขั้นสูง": "เครือข่ายประสาทประดิษฐ์และการเรียนรู้เชิงลึก",
                    "การประยุกต์ใช้งาน": "Applications"
                }
            },
            {
                "category": "วอ.476 เทคโนโลยีการประมวลผลภาพสำหรับงานอุตสาหกรรม",
                "subcategories": {
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วอ.362",
                    "เนื้อหา": {
                        "หลักการและแนวคิด": "หลักการและแนวคิดของการประมวลผลภาพและการจัดการข้อมูลขนาดใหญ่",
                        "เทคนิคการประมวลผลภาพ": "เทคนิคการการประมวลผลภาพ",
                        "การเรียนรู้เชิงลึก": "การประยุกต์ใช้หลักกการเรียนรู้เชิงลึกในการคัดแยกและจัดกลุ่มภาพ",
                        "ระบบกล้อง": "ระบบกล้องตรวจสอบคุณภาพและการวิเคราะห์ภาพด้วยซอฟต์แวร์",
                        "สถิติ": "หลักสถิติในการตรวจสอบคุณภาพสำหรับเทคโนโลยีการประมวลผลภาพ",
                        "การประยุกต์ใช้": "การประยุกต์ใช้การประมวลผลภาพในงานอุตสาหกรรม"
                    }
                }
            },
            {
                "category": "วิชาเลือกด้านการผลิตอย่างอัจฉริยะ (SMART MANUFACTURING)",
                "subcategories": {
                    "วอ.425 วิศวกรรมพอลิเมอร์": {
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ วอ.121",
                        "เนื้อหา": [
                            "หลักการของพอลิเมอร์ในเชิงวิทยาศาสตร์และเชิงวิศวกรรม",
                            "โครงสร้างของวัสดุพอลิเมอร์",
                            "สมบัติทางกลและทางความร้อนของพอลิเมอร์",
                            "สมบัติวิสโคอีลาสติก",
                            "การแตกหักและการเสริมแรงในพอลิเมอร์",
                            "พอลิเมอร์ในเทคโนโลยีขั้นสูง"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 9,
        "details": [
            {
                "category": "โครงสร้างหลักสูตร",
                "subcategories": {
                    "วิชาพื้นฐานทางวิศวกรรม": "7 หน่วยกิต",
                    "วิชาเฉพาะด้าน": "84 หน่วยกิต",
                    "วิชาบังคับทางวิศวกรรม": "69 หน่วยกิต",
                    "วิชาเลือกทางวิศวกรรม": "15 หน่วยกิต",
                    "วิชาเลือกเสรี": "6 หน่วยกิต",
                    "รวม": "145 หน่วยกิต"
                }
            },
            {
                "category": "รหัสวิชา",
                "subcategories": {
                    "อักษรย่อ": "วอ./ IE หมายถึง อักษรย่อของสาขาวิชาวิศวกรรมอุตสาหการ",
                    "เลขหลักหน่วย": {
                        "0-4": "วิชาบังคับ",
                        "5-9": "วิชาเลือกของสาขา"
                    },
                    "เลขหลักสิบ": {
                        "0": "วิชาในหมวดวิชาการบริหารและการจัดการ",
                        "1": "วิชาในหมวดวิชาการวางแผน",
                        "2": "วิชาในหมวดวิชาวัสดุศาสตร์",
                        "3": "วิชาในหมวดวิชาการออกแบบ",
                        "4": "วิชาในหมวดวิชาความปลอดภัย",
                        "5": "วิชาในหมวดวิชาการผลิต",
                        "6": "วิชาในหมวดวิชาสถิติ",
                        "7": "วิชาในหมวดวิชาระบบการผลิตและเทคโนโลยีสมัยใหม่",
                        "8": "วิชาในหมวดวิชาสหกิจศึกษาและการเยี่ยมชมโรงงาน",
                        "9": "วิชาในหมวดวิชาทั่วไป"
                    },
                    "เลขหลักร้อย": {
                        "1": "รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 1",
                        "2": "รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 2",
                        "3": "รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 3",
                        "4": "รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 4"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 21,
        "details": [
            {
                "category": "กรณีเลือกเรียนวิชาโครงงานวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "ปีการศึกษาที่_4": {
                        "ภาคเรียนที่_1": [
                            {
                                "รหัสวิชา": "มธ.124",
                                "ชื่อวิชา": "สังคมกับเศรษฐกิจ",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "มธ.108",
                                "ชื่อวิชา": "การพัฒนาและจัดการตนเอง",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.433",
                                "ชื่อวิชา": "การออกแบบสิ่งอำนวยความสะดวกและโรงงานอุตสาหกรรม",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.490",
                                "ชื่อวิชา": "สัมมนาสำหรับวิศวกรรมอุตสาหการ",
                                "หน่วยกิต": 0
                            },
                            {
                                "รหัสวิชา": "วอ.496",
                                "ชื่อวิชา": "โครงงานทางวิศวกรรมอุตสาหการ 1",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วอ.xxx",
                                "ชื่อวิชา": "วิชาเลือกหรือหัวข้อพิเศษ",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.xxx",
                                "ชื่อวิชา": "วิชาเลือกหรือหัวข้อพิเศษ",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "XX xxx",
                                "ชื่อวิชา": "วิชาเลือกเสรี",
                                "หน่วยกิต": 3
                            }
                        ],
                        "รวมหน่วยกิตภาคเรียนที่_1": 19,
                        "ภาคเรียนที่_2": [
                            {
                                "รหัสวิชา": "วอ.497",
                                "ชื่อวิชา": "โครงงานทางวิศวกรรมอุตสาหการ 2",
                                "หน่วยกิต": 2
                            },
                            {
                                "รหัสวิชา": "วอ.xxx",
                                "ชื่อวิชา": "วิชาเลือกหรือหัวข้อพิเศษ",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.xxx",
                                "ชื่อวิชา": "วิชาเลือกหรือหัวข้อพิเศษ",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "XX xxx",
                                "ชื่อวิชา": "วิชาเลือกเสรี",
                                "หน่วยกิต": 3
                            }
                        ],
                        "รวมหน่วยกิตภาคเรียนที่_2": 11
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 40,
        "details": [
            {
                "category": "วอ.362 การควบคุมคุณภาพ",
                "subcategories": {
                    "รหัสวิชา": "วอ.362",
                    "ชื่อวิชา": "การควบคุมคุณภาพ",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วอ.261",
                    "คำอธิบายรายวิชา": "เทคนิคทางด้านการจัดการคุณภาพ ต้นทุนคุณภาพ เทคนิคในการวิเคราะห์และปรับปรุงคุณภาพ เช่น แผนภูมิการควบคุมเชิงผันแปรและเชิงคุณลักษณะ การวิเคราะห์ความสามารถของกระบวนการผลิต การสุ่มตัวอย่างและการออกแบบแผนการสุ่มชักตัวอย่าง ระบบการควบคุมคุณภาพแบบอัตโนมัติ ความน่าเชื่อถือทางวิศวกรรมในการผลิต การประกันคุณภาพเบื้องต้น",
                    "Course Description": "Concept of quality management. Cost of quality. Techniques of analyzing and improving quality such as control chart, process capability analysis, sampling plan, and designing of sampling plan. Automated quality control system. Engineering reliability for manufacturing. Introduction to quality assurance system."
                }
            },
            {
                "category": "วอ.364 การวิจัยดำเนินงาน 1",
                "subcategories": {
                    "รหัสวิชา": "วอ.364",
                    "ชื่อวิชา": "การวิจัยดำเนินงาน 1",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.261",
                    "คำอธิบายรายวิชา": "แนะนำวิธีการวิจัยดำเนินงานในการแก้ไขปัญหาทางวิศวกรรมอุตสาหการสมัยใหม่โดยเน้นการใช้ตัวแบบทางคณิตศาสตร์ กำหนดการเชิงเส้น ตัวแบบการขนส่งและการมอบหมายงาน ทฤษฎีเกม ทฤษฎีแถวคอย ตัวแบบการจัดการพัสดุคงคลัง และการใช้การจำลองสถานการณ์ในกระบวนการตัดสินใจ เพื่อการวางแผนและการควบคุมการผลิต",
                    "Course Description": "Introduction to the methodology of operations research in modern industrial engineering problem solving, emphasis is made on the use of mathematical models, linear programming, transportation model, game theory, queuing theory, inventory model and simulation in decision making process for production planning and control."
                }
            },
            {
                "category": "วอ.370 ปฏิบัติการอินเทอร์เน็ตของสรรพสิ่งเชิงประยุกต์",
                "subcategories": {
                    "รหัสวิชา": "วอ.370",
                    "ชื่อวิชา": "ปฏิบัติการอินเทอร์เน็ตของสรรพสิ่งเชิงประยุกต์",
                    "หน่วยกิต": "1 (0-3-3)"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 54,
        "details": [
            {
                "category": "วอ.495 ความเป็นผู้ประกอบการทางเทคโนโลยี",
                "subcategories": {
                    "รหัสวิชา": "วอ.495",
                    "ชื่อวิชาภาษาไทย": "ความเป็นผู้ประกอบการทางเทคโนโลยี",
                    "ชื่อวิชาภาษาอังกฤษ": "Technology Entrepreneurship",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วอ.302",
                    "เนื้อหาวิชา": {
                        "การพัฒนาและการประเมินแนวคิด": "การสร้างธุรกิจทางเทคโนโลยี",
                        "ทรัพย์สินทางปัญญา": "การก่อตั้งธุรกิจในทางกฎหมาย",
                        "หลักการตลาด": "การตลาดดิจิทัล",
                        "การจัดการการดำเนินงาน": "",
                        "พื้นฐานด้านการเงินและบัญชี": "สำหรับผู้ประกอบการ",
                        "การจัดทำแผนธุรกิจ": "",
                        "การวิเคราะห์ความเป็นไปได้ของโครงการ": "",
                        "การนำเสนอแผนและการระดมทุน": "",
                        "การบริหารความเสี่ยงองค์กร": ""
                    },
                    "Prerequisites": "Have earned credits of IE302",
                    "Course_Content_English": {
                        "Idea_Identification_and_assessment": "",
                        "Intellectual_property": "legal establishment of business",
                        "Principles_of_Marketing": "Digital marketing",
                        "Operations_management": "",
                        "Fundamentals_of_finance_and_accounting": "",
                        "Business_plan": "",
                        "Project_feasibility": "",
                        "Pitching_and_funding": "",
                        "Enterprise_risk_management": ""
                    }
                }
            },
            {
                "category": "วอ.465 การจำลองสถานการณ์ด้วยคอมพิวเตอร์",
                "subcategories": {
                    "รหัสวิชา": "วอ.465",
                    "ชื่อวิชาภาษาไทย": "การจำลองสถานการณ์ด้วยคอมพิวเตอร์",
                    "ชื่อวิชาภาษาอังกฤษ": "Computer Simulation",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วอ.261",
                    "เนื้อหาวิชา": {
                        "การสร้างตัวเลขสุ่ม": "การทดสอบความถูกต้อง",
                        "การรวบรวมและวิเคราะห์ข้อมูลเบื้องต้น": "",
                        "การออกแบบและวิเคราะห์ระบบจำลอง": "",
                        "การสร้างแบบจำลองสถานการณ์": "ด้วยโปรแกรมคอมพิวเตอร์",
                        "การทดสอบความถูกต้องของแบบจําลอง": "",
                        "การวิเคราะห์ผลลัพธ์จากการจําลองสถานการณ์": "",
                        "การประยุกต์ใช้การจําลองสถานการณ์": "กับปัญหาในอุตสาหกรรม",
                        "กรณีศึกษา": ""
                    },
                    "Prerequisites": "Have earned credits of IE261",
                    "Course_Content_English": {
                        "Random_number_generation": "validity test",
                        "Data_collection_and_analysis": "",
                        "Design_and_analysis_of_simulation_system": "",
                        "Building_simulation_model": "using computer software",
                        "Verification_and_validation": "",
                        "Simulation_output_analysis": "",
                        "Application_of_industry_problem": "using simulation",
                        "Case_studies": ""
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 43,
        "details": [
            {
                "category": "วิชาบังคับ",
                "subcategories": {
                    "อก.381": {
                        "ชื่อวิชา": "สัมมนาทางวิศวกรรมอุตสาหการ",
                        "หน่วยกิต": "1 (0-3-0)",
                        "คำอธิบายรายวิชา": "นักศึกษาร่วมกันเสนอหัวข้อที่น่าสนใจทางวิศวกรรมอุตสาหการ ดำเนินการระดมสมอง อภิปรายหัวข้อเหล่านั้น เพื่อคัดเลือกหัวข้อสัมมนาและจัดเตรียมความพร้อมในการเป็นวิศวกรอุตสาหการ วัดผลด้วยระดับ S และ U",
                        "วิชาบังคับก่อน": "Have earned credits of IE311, IE341 and IE362",
                        "ชื่อวิชาภาษาอังกฤษ": "Seminar in Industrial Engineering",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Presentation and discussion in interested industrial engineering topics in order to enhance students' knowledge and experiences; and well-prepared students to be industrial engineers."
                    }
                }
            },
            {
                "category": "วิชาบังคับนอกสาขาหรือนอกคณะ",
                "subcategories": {
                    "ค.251": {
                        "ชื่อวิชา": "วิธีเชิงตัวเลขและการประยุกต์",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ ค.214",
                        "คำอธิบายรายวิชา": "ผลเฉลยเชิงตัวเลขของสมการตัวแปรเดียว การประมาณพหุนาม การหาอนุพันธ์และปริพันธ์โดยวิธีเชิงตัวเลข ผลเฉลยเชิงตัวเลขของสมการเชิงอนุพันธ์สามัญและตัวอย่างการนำไปใช้แก้ปัญหาทางวิศวกรรม การวิเคราะห์ค่าผิดพลาด การหาผลเฉลยเชิงตัวเลขของระบบสมการเชิงเส้นโดยวิธีตรงและโดยวิธีทำซ้ำ การคำนวณเชิงตัวเลขของค่าเฉพาะและเวกเตอร์เฉพาะ สมาชิกจำกัด การแก้ปัญหาทางวิศวกรรมโดยใช้วิธีเชิงตัวเลขและโปรแกรมสำเร็จรูป",
                        "ชื่อวิชาภาษาอังกฤษ": "Numerical Methods and Applications",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Numerical solutions of one variable equations, polynomial interpolation, numerical methods of differentiation and integration, numerical solutions of ordinary differential equations, draw examples in engineering problem solving, error analysis, numerical solutions of systems of linear equations (direct methods and iteration methods), numerical methods in determining eigenvalues and eigenvectors, finite elements, solving engineering problems by using numerical methods and mathematical package."
                    },
                    "วก.220": {
                        "ชื่อวิชา": "กลศาสตร์วิศวกรรม-พลศาสตร์",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ วย.202",
                        "คำอธิบายรายวิชา": "ทบทวนกฎเบื้องต้นเกี่ยวกับการเคลื่อนที่ของวัตถุ จลนศาสตร์ของอนุภาคและวัตถุแข็งเกร็ง ได้แก่ การขจัด ความเร็ว และความเร่ง การเคลื่อนที่แบบสัมบูรณ์และสัมพัทธ์ จลนพลศาสตร์ของอนุภาคและวัตถุแข็งเกร็ง ได้แก่ แรง โมเมนตัม งานและพลังงาน กฎการเคลื่อนข้อที่สองของนิวตัน หลักการของงานและ",
                        "ชื่อวิชาภาษาอังกฤษ": "Engineering Mechanics – Dynamics"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 27,
        "details": [
            {
                "category": "Life and Sustainability (TU103)",
                "subcategories": {
                    "Course_Code": "มธ.103 / TU103",
                    "Course_Name": "ชีวิตกับความยั่งยืน / Life and Sustainability",
                    "Credits": "3 (3-0-6)",
                    "Course_Description": "การดำเนินชีวิตอย่างเท่าทันกับการเปลี่ยนแปลงของโลก เข้าใจความสัมพันธ์ระหว่างพลวัตของธรรมชาติ มนุษย์ และสรรพสิ่ง ทั้งสิ่งแวดล้อมสรรสร้าง การใช้พลังงาน เศรษฐกิจ สังคมในความขัดแย้งและการแปรเปลี่ยน ตลอดจนองค์ความรู้ทางวิทยาศาสตร์สิ่งแวดล้อม ที่นำไปสู่การปรับเปลี่ยนวิถีชีวิตสู่ความยั่งยืน",
                    "Course_Description_English": "This course provides an introduction to the importance of life-cycle systems perspectives in understanding major challenges and solutions to achieving more sustainable societies in this changing world. Students will learn about the relationship between mankind and the environment in the context of energy and resource use, consumption and development, and environmental constraints. Furthermore, an examination of social conflict and change from the life-cycle perspective will be used to develop an understanding of potential solution pathways for sustainable lifestyle modifications."
                }
            },
            {
                "category": "Digital Skill and Problem Solving (TU107)",
                "subcategories": {
                    "Course_Code": "มธ.107 / TU107",
                    "Course_Name": "ทักษะดิจิทัลกับการแก้ปัญหา / Digital Skill and Problem Solving",
                    "Credits": "3 (3-0-6)",
                    "Course_Description": "ทักษะการคิดเชิงคำนวณเพื่อการแก้ปัญหาและการพัฒนาโอกาสใหม่ด้านสังคมและเศรษฐกิจ ความสามารถในค้นหาและการเข้าถึงสารสนเทศได้อย่างมีประสิทธิภาพ การประเมินความน่าเชื่อถือของสารสนเทศ การกลั่นกรองและจัดการสารสนเทศอย่างเป็นระบบ การใช้และจรรยาบรรณด้านดิจิทัล การสื่อสารออนไลน์อย่างมือาชีพ",
                    "Course_Description_English": "Basic computational thinking skill for solving problems and developing new social and economic opportunities. Efficient access and search for information. Information reliability evaluation. Filtering and managing information systematically. Ethical digital usage and professional online communication."
                }
            },
            {
                "category": "Emerging Technologies",
                "subcategories": {
                    "Biotechnology": "",
                    "Stem_cell": "",
                    "Smart_material": "",
                    "Nanotechnology": "",
                    "3D_printing": "",
                    "Big_data": "",
                    "5G": "",
                    "Internet_of_things": "",
                    "Artificial_intelligence": "",
                    "Technology_for_global_security": ""
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 10,
        "details": [
            {
                "category": "วิชาศึกษาทั่วไป",
                "subcategories": {
                    "จำนวนหน่วยกิต": "30 หน่วยกิต",
                    "เงื่อนไข": "นักศึกษาจะต้องศึกษารายวิชาครบทั้ง 5 หมวด ตามเงื่อนไขที่คณะกำหนด"
                }
            },
            {
                "category": "หมวดความเท่าทันโลกและสังคม",
                "subcategories": {
                    "จำนวนวิชา": "บังคับ 2 วิชา",
                    "จำนวนหน่วยกิต": "6 หน่วยกิต",
                    "วิชาบังคับ": {
                        "รหัสวิชา": "มธ.124",
                        "ชื่อวิชา": "สังคมกับเศรษฐกิจ",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วิชาบังคับเลือก": [
                        {
                            "รหัสวิชา": "มธ.101",
                            "ชื่อวิชา": "โลก อาเซียน และไทย",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "มธ.109",
                            "ชื่อวิชา": "นวัตกรรมกับกระบวนคิดผู้ประกอบการ",
                            "หน่วยกิต": "3 (3-0-6)"
                        }
                    ]
                }
            },
            {
                "category": "หมวดสุนทรียะและทักษะการสื่อสาร",
                "subcategories": {
                    "จำนวนวิชา": "บังคับ 3 วิชา",
                    "จำนวนหน่วยกิต": "9 หน่วยกิต",
                    "วิชาบังคับ": [
                        {
                            "รหัสวิชา": "ศศ.101",
                            "ชื่อวิชา": "การคิด อ่าน และเขียนอย่างมีวิจารณญาณ",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "สษ.105",
                            "ชื่อวิชา": "ทักษะการสื่อสารทางภาษาอังกฤษ",
                            "หน่วยกิต": "3 (3-0-6)"
                        }
                    ],
                    "วิชาบังคับเลือก": [
                        {
                            "รหัสวิชา": "มธ.102",
                            "ชื่อวิชา": "ชีวิตกับสุนทรียภาพ",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "มธ.106",
                            "ชื่อวิชา": "ความคิดสร้างสรรค์และการสื่อสาร",
                            "หน่วยกิต": "3 (3-0-6)"
                        }
                    ]
                }
            },
            {
                "category": "หมวดคณิตศาสตร์ วิทยาศาสตร์ และเทคโนโลยี",
                "subcategories": {
                    "จำนวนวิชา": "บังคับ 3 วิชา",
                    "จำนวนหน่วยกิต": "9 หน่วยกิต",
                    "วิชาบังคับ": [
                        {
                            "รหัสวิชา": "วท.123",
                            "ชื่อวิชา": "เคมีพื้นฐาน",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วพ.101",
                            "ชื่อวิชา": "การเขียนโปรแกรมคอมพิวเตอร์เบื้องต้น",
                            "หน่วยกิต": "3 (3-0-6)"
                        }
                    ]
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 14,
        "details": [
            {
                "category": "วิชาบังคับนอกสาขาหรือนอกคณะ",
                "subcategories": {
                    "จำนวนหน่วยกิต": "23 หน่วยกิต",
                    "รายวิชา": [
                        {
                            "รหัสวิชา": "ค.251",
                            "ชื่อวิชา": "วิธีเชิงตัวเลขและการประยุกต์",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วก.220",
                            "ชื่อวิชา": "กลศาสตร์วิศวกรรม-พลศาสตร์",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วก.290",
                            "ชื่อวิชา": "กลศาสตร์ของไหลเบื้องต้น",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วก.390",
                            "ชื่อวิชา": "ปฏิบัติการพื้นฐานวิศวกรรมเครื่องกล",
                            "หน่วยกิต": "1 (0-3-1)"
                        },
                        {
                            "รหัสวิชา": "วคม.211",
                            "ชื่อวิชา": "เธอร์โมไดนามิกส์",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วฟ.203",
                            "ชื่อวิชา": "ปฏิบัติการทางวิศวกรรมไฟฟ้าเบื้องต้น",
                            "หน่วยกิต": "1 (0-3-1)"
                        },
                        {
                            "รหัสวิชา": "วฟ.209",
                            "ชื่อวิชา": "วิศวกรรมไฟฟ้าเบื้องต้น",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วย.202",
                            "ชื่อวิชา": "กลศาสตร์วิศวกรรม-สถิตยศาสตร์",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วย.221",
                            "ชื่อวิชา": "กลศาสตร์ของแข็ง",
                            "หน่วยกิต": "3 (3-0-6)"
                        }
                    ]
                }
            },
            {
                "category": "กลุ่มวิชาเลือกทางวิศวกรรม",
                "subcategories": {
                    "จำนวนหน่วยกิต": "15 หน่วยกิต",
                    "รูปแบบการเลือก": "นักศึกษาต้องเลือกศึกษารายวิชาในรูปแบบใดรูปแบบหนึ่ง",
                    "รูปแบบที่_1": {
                        "ชื่อ": "วิชาโครงงานวิศวกรรมอุตสาหการ และ วิชาเลือกด้านต่าง ๆ หรือหัวข้อพิเศษ",
                        "วิชาโครงงานวิศวกรรมอุตสาหการ": {
                            "จำนวนหน่วยกิต": "3 หน่วยกิต",
                            "รายวิชา": [
                                {
                                    "รหัสวิชา": "วอ.496",
                                    "ชื่อวิชา": "โครงงานทางวิศวกรรมอุตสาหการ 1",
                                    "หน่วยกิต": "1 (0-3-3)"
                                },
                                {
                                    "รหัสวิชา": "วอ.497",
                                    "ชื่อวิชา": "โครงงานทางวิศวกรรมอุตสาหการ 2",
                                    "หน่วยกิต": "2 (0-6-6)"
                                }
                            ]
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 5,
        "details": [
            {
                "category": "หมวดที่ 3 ปรัชญา วัตถุประสงค์ และผลลัพธ์การเรียนรู้ของหลักสูตร",
                "subcategories": {
                    "3.1_ความสอดคล้องของหลักสูตร": {
                        "แผนยุทธศาสตร์มหาวิทยาลัยธรรมศาสตร์": [
                            "ยุทธศาสตร์ 1 พัฒนากำลังคนแห่งอนาคต (Future Workforce)",
                            "ยุทธศาสตร์ 2 พัฒนาที่ทำงานแห่งอนาคต (Future Workplace)",
                            "ยุทธศาสตร์ 3 พัฒนาคุณภาพชีวิตและสังคมแห่งอนาคต (Future Life and Society)",
                            "ยุทธศาสตร์ 4 พัฒนารูปแบบความร่วมมือแห่งอนาคต (Future Collaboration)"
                        ],
                        "การพัฒนาหลักสูตร": "พัฒนาและปรับปรุงหลักสูตรให้สอดรับกับแผนกลยุทธ์ระดับคณะและระดับมหาวิทยาลัย"
                    },
                    "3.2_ปรัชญา": "ผลิตวิศวกรอุตสาหการที่มีความรู้ ทักษะ และความสามารถในการเรียนรู้ การคิดวิเคราะห์ปัญหา การเรียนรู้ ก้าวทันต่อการเปลี่ยนแปลงเทคโนโลยีใหม่ ตลอดจนมีจรรยาบรรณในการประกอบวิชาชีพ และสามารถพัฒนาความรู้ได้อย่างต่อเนื่อง",
                    "3.3_วัตถุประสงค์ของหลักสูตร": [
                        "1) เพื่อผลิตบัณฑิตที่มีความรู้ความสามารถตามมาตรฐานวิชาการและวิชาชีพของสาขาวิชาวิศวกรรมอุตสาหการ",
                        "2) เพื่อผลิตบัณฑิตให้มีความรอบรู้ทั้งภาคทฤษฎีและภาคปฏิบัติสามารถนำความรู้ไปประยุกต์ใช้ได้อย่างเหมาะสม",
                        "3) เพื่อผลิตบัณฑิตที่มีความสามารถในการวิเคราะห์และสังเคราะห์อย่างเป็นระบบ",
                        "4) เพื่อผลิตบัณฑิตที่มีทักษะ มีความพร้อมในการรับ-การถ่ายทอดและพัฒนาเทคโนโลยีระดับสูง รวมทั้ง สามารถติดต่อสื่อสารกับผู้อื่นได้เป็นอย่างดี",
                        "5) เพื่อผลิตบัณฑิตที่มีความคิดสร้างสรรค์มีความใฝ่รู้และหมั่นแสวงหาความรู้ด้วยตนเอง",
                        "6) เพื่อผลิตบัณฑิตให้เป็นผู้มีคุณธรรมและจริยธรรม คำนึงถึงสังคมและส่วนรวม"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 33,
        "details": [
            {
                "category": "วิชาพื้นฐานทางวิศวกรรม",
                "subcategories": {
                    "วอ.121_วัสดุวิศวกรรม": {
                        "รหัสวิชา": "วอ.121",
                        "ชื่อวิชา": "วัสดุวิศวกรรม",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "ความสัมพันธ์ระหว่าง โครงสร้าง สมบัติ กระบวนการผลิต และการประยุกต์ใช้งานของกลุ่มวิศวกรรมหลัก ได้แก่ โลหะ พอลิเมอร์ เซรามิกส์ และวัสดุผสม แผนภูมิสมดุล สมบัติทางกล และการเสื่อมสภาพของวัสดุ",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Relationship between structures, properties, production processed and applications of main groups of engineering materials i.e, metals, polymers, Ceramics and composites; phase equilibrium diagrams mechanical properties and materials degradation."
                    }
                }
            },
            {
                "category": "วิชาเฉพาะด้าน",
                "subcategories": {
                    "กลุ่มวิชาบังคับทางวิศวกรรม": {
                        "วิชาบังคับในสาขา": {
                            "วอ.230_การเขียนแบบทางวิศวกรรมอุตสาหการ": {
                                "รหัสวิชา": "วอ.230",
                                "ชื่อวิชา": "การเขียนแบบทางวิศวกรรมอุตสาหการ",
                                "หน่วยกิต": "1 (0-3-3)",
                                "วิชาบังคับก่อน": "สอบได้ วก.100",
                                "คำอธิบายรายวิชา": "คอมพิวเตอร์ช่วยการออกแบบ (CAD) โดยใช้แพ็คเกจซอฟต์แวร์สร้างแบบจำลองสามมิติ สัญลักษณ์ในงานเขียนแบบอุตสาหกรรม เช่น ระบบไฟฟ้า ระบบท่อ ระบบสาธารณูปโภค การวาดองค์ประกอบของเครื่องจักร การประกอบและการเขียนแบบ ค่าเผื่อและความคลาดเคลื่อน การเขียนผังโรงงาน คอมพิวเตอร์ช่วยการผลิต (CAM)",
                                "คำอธิบายรายวิชาภาษาอังกฤษ": "Computer-aided design (CAD) using a 3D solid modeling software package. Symbols in industrial drawing such as electric, pipe, facilities systems. Drawing of machine elements. Assembly and detailed drawing. Plant Layout drawing. Allowance and tolerance. Computer aided manufacturing (CAM)."
                            }
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 48,
        "details": [
            {
                "category": "วอ.497 โครงงานทางวิศวกรรมอุตสาหการ 2",
                "subcategories": {
                    "รหัสวิชา": "วอ.497",
                    "ชื่อวิชาภาษาไทย": "โครงงานทางวิศวกรรมอุตสาหการ 2",
                    "ชื่อวิชาภาษาอังกฤษ": "Industrial Engineering Project II",
                    "หน่วยกิต": "2 (0-6-6)",
                    "วิชาบังคับก่อน": "สอบได้ วอ.496",
                    "คำอธิบายรายวิชา": {
                        "ภาษาไทย": "โครงงานที่น่าสนใจในแขนงต่าง ๆ ทางวิศวกรรมอุตสาหการ โดยศึกษาต่อเนื่องในหัวข้อจาก วอ.496 และมีการนำเสนอโครงการ การนำเสนอดังกล่าวจะเน้นการเสนอรายงานโดยใช้ภาษาไทยที่ถูกต้องตามหลักไวยากรณ์ และหลักการเขียนรายงาน",
                        "ภาษาอังกฤษ": "Continuation of industrial engineering project from IE496 to the final stage. A project report and a presentation are required at the end of course. The report must be written correctly according to both structure and grammar in Thai and report guidelines."
                    }
                }
            },
            {
                "category": "รูปแบบที่ 2 วิชาสหกิจศึกษาวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "รหัสวิชา": "วอ.486",
                    "ชื่อวิชาภาษาไทย": "สหกิจศึกษาวิศวกรรมอุตสาหการ 1",
                    "ชื่อวิชาภาษาอังกฤษ": "Industrial Engineering Co-operative Education I",
                    "หน่วยกิต": "3 (0-9-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.302, วอ.311, วอ.312, วอ.313, วอ.341, วอ.362 และ วอ.364",
                    "คำอธิบายรายวิชา": {
                        "ลักษณะงาน": "การศึกษาและแก้ปัญหางานในสถานประกอบการด้านอุตสาหกรรมเพื่อผลิตงานวิจัย โดยมีลักษณะเป็นงานเดี่ยวหรือกลุ่มไม่เกิน 3 คน",
                        "ลักษณะโครงการ": [
                            "เป็นการค้นหาสิ่งใหม่ ๆ ที่สามารถนำไปผลิตเป็นผลิตภัณฑ์ใหม่ในเชิงพาณิชย์",
                            "เป็นการแก้ปัญหาทางด้านการผลิต การปรับปรุงกระบวนการผลิต หรือนำส่วนที่เสียหรือไม่ได้คุณภาพไปใช้ประโยชน์",
                            "เป็นการปรับปรุงเทคโนโลยี (เพิ่มเติมจากการที่มีการจดสิทธิบัตรแล้ว) รวมถึงการจัดการบริหารและการบริการ เพื่อให้ได้ข้อมูลและทางเลือกที่เหมาะสมทางด้านธุรกิจ"
                        ],
                        "ขั้นตอนการดำเนินงาน": [
                            "การระบุหัวข้อวิจัย",
                            "การศึกษาข้อมูลและรายละเอียดของปัญหา",
                            "การกำหนดวัตถุประสงค์ ขอบเขตและขั้นตอนการศึกษา",
                            "ระเบียบวิธีการวิจัย",
                            "การศึกษาทฤษฎีและวรรณกรรมที่เกี่ยวข้อง",
                            "จัดทำรายงานเพื่อนำเสนอต่อคณะกรรมการ"
                        ],
                        "การประเมินผล": "คณะกรรมการประกอบด้วยอาจารย์และบุคลากรจากภาคอุตสาหกรรมร่วมกันประเมินผล"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 1,
        "details": [
            {
                "category": "รายละเอียดของหลักสูตร",
                "subcategories": {
                    "ชื่อสถาบันอุดมศึกษา": "มหาวิทยาลัยธรรมศาสตร์",
                    "คณะ/วิทยาลัย/สถาบัน": "คณะวิศวกรรมศาสตร์"
                }
            },
            {
                "category": "หมวดที่ 1 ข้อมูลทั่วไป",
                "subcategories": {
                    "1.1 รหัสและชื่อหลักสูตร": {
                        "รหัสหลักสูตร": "25470051100334",
                        "ชื่อหลักสูตร": {
                            "ภาษาไทย": "หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ",
                            "ภาษาอังกฤษ": "Bachelor of Engineering Program in Industrial Engineering"
                        }
                    },
                    "1.2 ชื่อปริญญาและสาขาวิชา": {
                        "ภาษาไทย": {
                            "ชื่อเต็ม": "วิศวกรรมศาสตรบัณฑิต (วิศวกรรมอุตสาหการ)",
                            "ชื่อย่อ": "วศ.บ. (วิศวกรรมอุตสาหการ)"
                        },
                        "ภาษาอังกฤษ": {
                            "ชื่อเต็ม": "Bachelor of Engineering (Industrial Engineering)",
                            "ชื่อย่อ": "B.Eng. (Industrial Engineering)"
                        }
                    },
                    "1.3 วิชาเอก (ถ้ามี)": "ไม่มี",
                    "1.4 รูปแบบของหลักสูตร": {
                        "1.4.1 รูปแบบ": "หลักสูตรระดับปริญญาตรี 4 ปี",
                        "1.4.2 ประเภทของหลักสูตร": "หลักสูตรปริญญาตรีทางวิชาการ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 47,
        "details": [
            {
                "category": "วย.221 กลศาสตร์ของแข็ง",
                "subcategories": {
                    "รหัสวิชา": "CE221",
                    "ชื่อภาษาอังกฤษ": "Mechanics of Solids",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วย.202",
                    "คำอธิบายรายวิชา": "หลักการเบื้องต้นเกี่ยวกับกลศาสตร์ของวัตถุที่เปลี่ยนรูปได้ภายใต้การกระทำของแรง ความสัมพันธ์ระหว่างแรงหน่วยแรงและการเสียรูปของวัตถุ ความสัมพันธ์ระหว่างหน่วยแรงและความเครียด ทฤษฎีการบิดและการดัดของวัตถุในช่วงยืดหยุ่นเชิงเส้น และไดอะแกรมแรงเฉือนและโมเมนต์ดัด หน่วยแรงดัดและหน่วยแรงเฉือนในคานรวมถึงหน่วยแรงรวม ทฤษฎีวงกลมของมอร์และหน่วยแรงรวม ทฤษฎีการวิบัติของวัสดุเบื้องต้นการโก่งของคานโดยวิธีอินติเกรต แรงเยื้องศูนย์ ทฤษฎีเบื้องต้นของการโก่งเดาะของวัตถุรับแรงอัด การทดสอบวัตถุ",
                    "Course_Description": "Introduction to mechanics of deformable bodies; Relations among loads and deformations; Stress-strain relationship; Axial loading. Torsion; Bending in elastic range; Bending and shearing stresses in beams; Transformation of stress; Mohr's circles and combined stresss. Introduction to failure theory; Deflection of beams by integration; Eccentric loading; Buckling of compression members; Material testing."
                }
            },
            {
                "category": "กลุ่มวิชาเลือกทางวิศวกรรม",
                "subcategories": {
                    "รูปแบบที่_1": "วิชาโครงงานวิศวกรรมอุตสาหการ",
                    "รหัสวิชา": "วอ.496",
                    "ชื่อวิชา": "โครงงานทางวิศวกรรมอุตสาหการ 1",
                    "ชื่อภาษาอังกฤษ": "Industrial Engineering Project I",
                    "หน่วยกิต": "1 (0-3-3)",
                    "วิชาบังคับก่อน": "เคยศึกษา วอ.302, วอ.311, วอ.312, วอ.313, วอ.341, วอ.362 และ วอ.364",
                    "คำอธิบายรายวิชา": "การศึกษาขั้นต้นในโครงงานที่น่าสนใจทางวิศวกรรมอุตสาหการ และนำเสนอโครงการในรายงานดังกล่าวและส่งรายงานของโครงงาน โดยใช้ภาษาไทยที่ถูกต้องตามหลักไวยากรณ์ และหลักการเขียนรายงาน",
                    "Course_Description": "Students carry out industrial engineering projects of interests. A project report and a presentation are required at the end of course. The report must be written correctly according to both structure and grammar in Thai and report guideline."
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 62,
        "details": [
            {
                "category": "Course Information",
                "subcategories": {
                    "Course_Code": "วอ.446 / IE446",
                    "Course_Name_Thai": "การออกแบบการปฏิสัมพันธ์ระบบกับคน",
                    "Course_Name_English": "Human System Interaction and Design",
                    "Credits": "3 (3-0-6)",
                    "Prerequisites": "สอบได้ วอ.445 / Have earned credits of IE445"
                }
            },
            {
                "category": "Course Content",
                "subcategories": {
                    "Engineering_Design": "ข้อกำหนดและความต้องการของการออกแบบทางวิศวกรรม",
                    "Usability_and_Accessibility": "การออกแบบเพื่อการใช้งานและการเข้าถึงกับทุกคน",
                    "Physical_Design_Standards": "ข้อกำหนด ข้อบังคับ แนวทาง และมาตรฐานสำหรับการออกแบบทางกายภาพ",
                    "Human_Machine_Interaction": "การออกบบการเชื่อมต่อทางกายภาพเพื่อการทำงานร่วมกันของคนกับเครื่องจักรและหุ่นยนต์",
                    "Input_Output_Interfaces": "รูปแบบและอุปกรณ์สำหรับการป้อนข้อมูลและการแสดงผลเพื่อการทำงานร่วมกันในระบบคนและระบบงาน",
                    "Physical_Design_Assessment": "กลไกสำหรับการออกแบบทางกายภาพและการประเมินระบบงาน",
                    "Visual_Tasks_Design": "การออกแบบงานที่ใช้การรับรู้ด้วยการมองเห็น",
                    "Display_and_Control_Design": "การออกแบบส่วนแสดงผลและส่วนควบคุม",
                    "Control_Room_Design": "การออกแบบห้องควบคุม",
                    "Workspace_Design_Standards": "ข้อกำหนด ข้อบังคับ แนวทาง และมาตรฐานสำหรับการออกแบบพื้นที่ปฏิบัติงานทั้งภายในและภายนอกอาคารรวมถึงเครื่องมือและอุปกรณ์ต่าง ๆ ที่เกี่ยวข้อง",
                    "Environmental_Design": "หลักการออกแบบและประเมินทางด้านสภาพแวดล้อมสำหรับระบบการทำงาน (เช่น เสียง ภาพ แสง การสั่นสะเทือน ความเร่งและความหน่วง อุณหภูมิ เป็นต้น)",
                    "Virtual_and_Augmented_Reality": "การออกแบบด้วยการจำลองสภาพแวดล้อมเสมือนจริงและการรวมสภาพแวดล้อมจริง"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 22,
        "details": [
            {
                "category": "กรณีเลือกเรียนวิชาสหกิจศึกษาวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "ปีการศึกษาที่_4": {
                        "ภาคเรียนที่_1": {
                            "รายวิชา": [
                                {
                                    "รหัสวิชา": "มธ.124",
                                    "ชื่อวิชา": "สังคมกับเศรษฐกิจ",
                                    "หน่วยกิต": 3
                                },
                                {
                                    "รหัสวิชา": "มธ.108",
                                    "ชื่อวิชา": "การพัฒนาและจัดการตนเอง",
                                    "หน่วยกิต": 3
                                },
                                {
                                    "รหัสวิชา": "วอ.433",
                                    "ชื่อวิชา": "การออกแบบสิ่งอำนวยความสะดวกและโรงงานอุตสาหกรรม",
                                    "หน่วยกิต": 3
                                },
                                {
                                    "รหัสวิชา": "วอ.486",
                                    "ชื่อวิชา": "สหกิจศึกษาวิศวกรรมอุตสาหการ 1",
                                    "หน่วยกิต": 3
                                },
                                {
                                    "รหัสวิชา": "วอ.490",
                                    "ชื่อวิชา": "สัมมนาสำหรับวิศวกรรมอุตสาหการ",
                                    "หน่วยกิต": 0
                                },
                                {
                                    "รหัสวิชา": "วอ.xxx",
                                    "ชื่อวิชา": "วิชาเลือกหรือหัวข้อพิเศษ",
                                    "หน่วยกิต": 3
                                },
                                {
                                    "รหัสวิชา": "XX xxx",
                                    "ชื่อวิชา": "วิชาเลือกเสรี",
                                    "หน่วยกิต": 3
                                },
                                {
                                    "รหัสวิชา": "XX xxx",
                                    "ชื่อวิชา": "วิชาเลือกเสรี",
                                    "หน่วยกิต": 3
                                }
                            ],
                            "รวมหน่วยกิต": 21
                        },
                        "ภาคเรียนที่_2": {
                            "รายวิชา": [
                                {
                                    "รหัสวิชา": "วอ.487",
                                    "ชื่อวิชา": "สหกิจศึกษาวิศวกรรมอุตสาหการ 2",
                                    "หน่วยกิต": 9
                                }
                            ],
                            "รวมหน่วยกิต": 9
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 20,
        "details": [
            {
                "category": "ปีการศึกษาที่ 3",
                "subcategories": {
                    "ภาคเรียนที่ 1": {
                        "หน่วยกิตรวม": 20,
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "วอ.302",
                                "ชื่อวิชา": "เศรษฐศาสตร์วิศวกรรม",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.311",
                                "ชื่อวิชา": "การศึกษาการปฏิบัติงานทางอุตสาหกรรม",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.341",
                                "ชื่อวิชา": "วิศวกรรมความปลอดภัย",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.351",
                                "ชื่อวิชา": "ปฏิบัติการกรรมวิธีการผลิต",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วอ.353",
                                "ชื่อวิชา": "ระบบอัตโนมัติในการผลิต",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.362",
                                "ชื่อวิชา": "การควบคุมคุณภาพ",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.364",
                                "ชื่อวิชา": "การวิจัยดำเนินงาน 1",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.370",
                                "ชื่อวิชา": "ปฏิบัติการอินเทอร์เน็ตของสรรพสิ่งเชิงประยุกต์",
                                "หน่วยกิต": 1
                            }
                        ]
                    },
                    "ภาคเรียนที่ 2": {
                        "หน่วยกิตรวม": 18,
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "มธ.100",
                                "ชื่อวิชา": "พลเมืองกับการลงมือแก้ปัญหา",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.301",
                                "ชื่อวิชา": "ปฏิบัติการทางสถิติและวิศวกรรมอุตสาหการ",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วอ.312",
                                "ชื่อวิชา": "การวางแผนและควบคุมการผลิต",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.313",
                                "ชื่อวิชา": "วิศวกรรมการบำรุงรักษา",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.354",
                                "ชื่อวิชา": "ปฏิบัติการระบบอัตโนมัติ",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วอ.361",
                                "ชื่อวิชา": "การวิเคราะห์ข้อมูลอุตสาหกรรม",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.380",
                                "ชื่อวิชา": "การเยี่ยมชมอุตสาหกรรม",
                                "หน่วยกิต": 0
                            },
                            {
                                "รหัสวิชา": "วอ.371",
                                "ชื่อวิชา": "วิทยาการข้อมูลสำหรับวิศวกรรม",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วก.390",
                                "ชื่อวิชา": "ปฏิบัติการพื้นฐานวิศวกรรมเครื่องกล",
                                "หน่วยกิต": 1
                            }
                        ]
                    },
                    "ภาคฤดูร้อน": {
                        "หน่วยกิตรวม": 1,
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "วอ.390",
                                "ชื่อวิชา": "การฝึกงาน",
                                "หน่วยกิต": 1
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 16,
        "details": [
            {
                "category": "วิชาเลือกด้านเทคนิคการขับเคลื่อนด้วยข้อมูล (DATA DRIVEN TECHNIC)",
                "subcategories": {
                    "วอ.465": {
                        "ชื่อวิชา": "การจำลองสถานการณ์ด้วยคอมพิวเตอร์",
                        "ชื่อวิชาภาษาอังกฤษ": "Computer Simulation",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.466": {
                        "ชื่อวิชา": "การวิจัยดำเนินงาน 2",
                        "ชื่อวิชาภาษาอังกฤษ": "Operations Research II",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.467": {
                        "ชื่อวิชา": "การออกแบบการทดลอง",
                        "ชื่อวิชาภาษาอังกฤษ": "Design of Experiment",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.468": {
                        "ชื่อวิชา": "เทคโนโลยีสำหรับการตัดสินใจ",
                        "ชื่อวิชาภาษาอังกฤษ": "Decision Technology",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.469": {
                        "ชื่อวิชา": "วิศวกรรมความน่าเชื่อถือ",
                        "ชื่อวิชาภาษาอังกฤษ": "Reliability Engineering",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.475": {
                        "ชื่อวิชา": "ปัญญาประดิษฐ์",
                        "ชื่อวิชาภาษาอังกฤษ": "Artificial Intelligence",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.476": {
                        "ชื่อวิชา": "เทคโนโลยีการประมวลผลภาพสำหรับงานอุตสาหกรรม",
                        "ชื่อวิชาภาษาอังกฤษ": "Industrial Image processing technology",
                        "หน่วยกิต": "3 (3-0-6)"
                    }
                }
            },
            {
                "category": "วิชาเลือกด้านการผลิตอย่างอัจฉริยะ (SMART MANUFACTURING)",
                "subcategories": {
                    "วอ.425": {
                        "ชื่อวิชา": "วิศวกรรมพอลิเมอร์",
                        "ชื่อวิชาภาษาอังกฤษ": "Polymer Engineering",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.426": {
                        "ชื่อวิชา": "เทคโนโลยีวัสดุเพื่ออุตสาหกรรมยานยนต์",
                        "ชื่อวิชาภาษาอังกฤษ": "Materials Technology for Automotive Industries",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.427": {
                        "ชื่อวิชา": "การเลือกใช้โลหะในงานอุตสาหกรรม",
                        "ชื่อวิชาภาษาอังกฤษ": "Metal Selection for Industrial Applications",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.455": {
                        "ชื่อวิชา": "การพิมพ์ 3 มิติ และ การผลิตแบบเพิ่มเนื้อ",
                        "ชื่อวิชาภาษาอังกฤษ": "3D Printing and Additive Manufacturing",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.456": {
                        "ชื่อวิชา": "การออกแบบแม่พิมพ์",
                        "ชื่อวิชาภาษาอังกฤษ": "Mold and Die Design",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.457": {
                        "ชื่อวิชา": "เทคโนโลยีพลาสติก",
                        "ชื่อวิชาภาษาอังกฤษ": "Plastics Technology",
                        "หน่วยกิต": "3 (3-0-6)"
                    }
                }
            },
            {
                "category": "วิชาอื่นๆ",
                "subcategories": {
                    "วอ.495": {
                        "ชื่อวิชา": "ความเป็นผู้ประกอบการทางเทคโนโลยี",
                        "ชื่อวิชาภาษาอังกฤษ": "Technology Entrepreneurship",
                        "หน่วยกิต": "3 (3-0-6)"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 70,
        "details": [
            {
                "category": "วอ.374 ปฏิบัติการอัตโนมัติในอุตสาหกรรม 1",
                "subcategories": {
                    "รหัสวิชา": "วอ.374",
                    "ชื่อวิชาภาษาไทย": "ปฏิบัติการอัตโนมัติในอุตสาหกรรม 1",
                    "ชื่อวิชาภาษาอังกฤษ": "Industrial Automation Laboratory",
                    "หน่วยกิต": "0-3-3"
                }
            },
            {
                "category": "เนื้อหารายวิชา",
                "subcategories": {
                    "ระบบควบคุมอัตโนมัติ": [
                        "ระบบนิวเมติกส์",
                        "นิวแมติกส์ไฟฟ้า",
                        "พีแอลซี",
                        "ไมโครคอนโทรลเลอร์"
                    ],
                    "อุปกรณ์อื่นๆ": [
                        "เซ็นเซอร์ชนิดต่าง ๆ ในงานอุตสาหกรรม",
                        "หุ่นยนต์อุตสาหกรรม"
                    ]
                }
            },
            {
                "category": "Course Description",
                "subcategories": {
                    "Automatic Control Systems": [
                        "Pneumatic",
                        "Electro-pneumatic",
                        "Programmable Logic Controller",
                        "Microcontroller"
                    ],
                    "Other Equipment": [
                        "Variety types of industrial sensors",
                        "Industrial Robot"
                    ]
                }
            },
            {
                "category": "ลักษณะการเรียนการสอน",
                "subcategories": {
                    "รูปแบบ": "ปฏิบัติการ",
                    "ประสบการณ์": "Hand on experiences"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 18,
        "details": [
            {
                "category": "แผนการศึกษา",
                "subcategories": {
                    "ปีการศึกษาที่_1": {
                        "ภาคเรียนที่_1": [
                            {
                                "รหัสวิชา": "ศศ.101",
                                "ชื่อวิชา": "การคิด อ่าน และเขียนอย่างมีวิจารณญาณ",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วท.123",
                                "ชื่อวิชา": "เคมีพื้นฐาน",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "ค.111",
                                "ชื่อวิชา": "แคลคูลัสพื้นฐาน",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วท.133",
                                "ชื่อวิชา": "ฟิสิกส์สำหรับวิศวกร 1",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วท.173",
                                "ชื่อวิชา": "ปฏิบัติการเคมีพื้นฐาน",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วท.183",
                                "ชื่อวิชา": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 1",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วก.100",
                                "ชื่อวิชา": "กราฟิกวิศวกรรม",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วศว.100",
                                "ชื่อวิชา": "จริยธรรมสำหรับวิศวกร",
                                "หน่วยกิต": 0
                            }
                        ],
                        "รวมหน่วยกิตภาคเรียนที่_1": 17,
                        "ภาคเรียนที่_2": [
                            {
                                "รหัสวิชา": "มธ.101/มธ.109",
                                "ชื่อวิชา": "โลก อาเซียน และไทย/ นวัตกรรมกับกระบวนการคิดผู้ประกอบการ",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "สษ.105",
                                "ชื่อวิชา": "ทักษะการสื่อสารทางภาษาอังกฤษ",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วพ.101",
                                "ชื่อวิชา": "การเขียนโปรแกรมคอมพิวเตอร์เบื้องต้น",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "ค.112",
                                "ชื่อวิชา": "เรขาคณิตวิเคราะห์และแคลคูลัสประยุกต์",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วท.134",
                                "ชื่อวิชา": "ฟิสิกส์สำหรับวิศวกร 2",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วท.184",
                                "ชื่อวิชา": "ปฎิบัติการฟิสิกส์สำหรับวิศวกร 2",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วอ.121",
                                "ชื่อวิชา": "วัสดุวิศวกรรม",
                                "หน่วยกิต": 3
                            }
                        ],
                        "รวมหน่วยกิตภาคเรียนที่_2": 19
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 2,
        "details": [
            {
                "category": "ข้อมูลหลักสูตร",
                "subcategories": {
                    "ภาษาที่ใช้": [
                        "จัดการศึกษาเป็นภาษาไทย",
                        "จัดการศึกษาเป็นภาษาอังกฤษ",
                        "จัดการศึกษาทั้งภาษาไทยและภาษาอังกฤษ",
                        "จัดการศึกษาเป็นภาษาต่างประเทศ ระบุ...................."
                    ],
                    "ความร่วมมือกับสถาบันอื่น": [
                        "เป็นหลักสูตรของสถาบันโดยเฉพาะ",
                        "เป็นหลักสูตรที่ได้รับความร่วมมือสนับสนุนจากสถาบันอื่น หรือ เป็นหลักสูตรร่วมกับสถาบันอื่น"
                    ],
                    "การให้ปริญญา": [
                        "ให้ปริญญาเพียงสาขาวิชาเดียว",
                        "ให้ปริญญามากกว่า 1 สาขาวิชา (เช่น ทวิปริญญา) หรือเป็นปริญญาร่วมระหว่างสถาบันอุดมศึกษา)"
                    ],
                    "สถานภาพของหลักสูตร": {
                        "ประเภท": "หลักสูตรปรับปรุง พ.ศ. 2566",
                        "ปรับปรุงจาก": "หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมอุตสาหการ พ.ศ. 2561",
                        "กำหนดเปิดสอน": "ภาคการศึกษาที่ 1 ปีการศึกษา 2566",
                        "การพิจารณา": [
                            {
                                "โดย": "คณะกรรมการนโยบายวิชาการ",
                                "ครั้งที่": "1/2566",
                                "วันที่": "1 มีนาคม 2566"
                            },
                            {
                                "โดย": "สภามหาวิทยาลัย",
                                "ครั้งที่": "ยังไม่ระบุ",
                                "วันที่": "ยังไม่ระบุ"
                            }
                        ]
                    }
                }
            },
            {
                "category": "อาชีพที่สามารถประกอบได้หลังสำเร็จการศึกษา",
                "subcategories": {
                    "อาชีพ": [
                        "วิศวกรในส่วนต่าง ๆ ภาคการผลิต",
                        "วิศวกรในส่วนต่าง ๆ ภาคการบริการ",
                        "ผู้วิจัย หรือ ผู้ช่วยวิจัย",
                        "นักวิเคราะห์และออกแบบระบบการทำงาน",
                        "งานด้านการวิเคราะห์ความเป็นไปได้ของโครงการ",
                        "งานทางด้านการเงิน",
                        "งานทางด้านการวางแผนการผลิต"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-ACRD20241003-01",
        "document": "2.ie66",
        "page": 58,
        "details": [
            {
                "category": "วอ.426 เทคโนโลยีวัสดุเพื่ออุตสาหกรรมยานยนต์",
                "subcategories": {
                    "รหัสวิชา": "IE426",
                    "ชื่อภาษาอังกฤษ": "Materials Technology for Automotive Industries",
                    "หน่วยกิต": "3 (3-0-6)",
                    "หัวข้อหลัก": {
                        "วิวัฒนาการการพัฒนาของยานยนต์": "Evolution of the Automobile",
                        "ความรู้พื้นฐานเกี่ยวกับการออกแบบยานยนต์": "Basic Knowledge of Automotive-Design",
                        "การผลิตและการทดสอบยานยนต์": "Automotive-Manufacturing Process and Automotive testing",
                        "ประเภทของรถยนต์": "Type of Automobile",
                        "ส่วนประกอบของรถยนต์": "Automotive Components",
                        "สถานการณ์ปัจจุบันและแนวโน้มการพัฒนาของอุตสาหกรรมยานยนต์": "Current Situation and Development Trend of Automotive Industries",
                        "ทิศทางการพัฒนาวัสดุยานยนต์": "Trends of Materials for Automobile",
                        "ความรู้พื้นฐานเกี่ยวกับวัสดุ": "Basic Knowledge of Materials",
                        "เทคโนโลยีวัสดุสำหรับยานยนต์": "Materials Technology for Automobile",
                        "การวิเคราะห์การเลือกใช้วัสดุสำหรับชิ้นส่วนยานยนต์": "Material Selection Analysis for Automotive Components"
                    }
                }
            },
            {
                "category": "วอ.427 การเลือกใช้โลหะในงานอุตสาหกรรม",
                "subcategories": {
                    "รหัสวิชา": "IE427",
                    "ชื่อภาษาอังกฤษ": "Metal Selection for Industrial Applications",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วอ.121",
                    "หัวข้อหลัก": {
                        "พฤติกรรมของวัสดุโลหะ": "Behavior of metals in industrial service",
                        "สภาวะแวดล้อมที่ทำให้เสื่อมคุณภาพ": "Environmental degradation",
                        "การสึกหรอ": "Wear",
                        "การใช้งานที่อุณหภูมิสูง": "High temperature applications",
                        "กลไกที่ทำให้เกิดความเสียหาย": "Mechanisms of the failure process",
                        "วิธีการป้องกัน": "Methods of prevention and protection against failure",
                        "การเลือกใช้วัสดุและการออกแบบทางวิศวกรรม": "Materials selection and engineering design",
                        "กรณีศึกษา": "Case studies of engineering failures and strategies to solve problems"
                    }
                }
            },
            {
                "category": "วอ.455 การพิมพ์ 3 มิติ และ การผลิตแบบเพิ่มเนื้อ",
                "subcategories": {
                    "รหัสวิชา": "IE455",
                    "ชื่อภาษาอังกฤษ": "3D Printing and Additive Manufacturing",
                    "หน่วยกิต": "3 (3-0-6)"
                }
            }
        ]
    }
]