[
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 41,
        "details": [
            {
                "category": "วคม.315 วิศวกรรมปฏิกิริยา",
                "subcategories": {
                    "รหัสวิชา": "CHE315",
                    "ชื่อภาษาอังกฤษ": "Reaction Engineering",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ ค.111",
                    "คำอธิบายรายวิชา": "การพัฒนาและการประยุกต์ทฤษฎีจลนพลศาสตร์ทางเคมีซึ่งรวมทั้งทฤษฎีการชนกันและทฤษฎีการเปลี่ยนสถานะ การตีความข้อมูลอัตราเร็วทางเคมีและข้อมูลสมรรถนะการเลือกในระบบปฏิกิริยาเอกพันธุ์ การออกแบบและคำนวณขนาดเครื่องปฏิกรณ์ทางเคมีทางอุดมคติและไม่อุดมคติ การแจกแจงเรซิเดนซ์ไทม์สำหรับเครื่องปฏิกรณ์ทางเคมี การออกแบบเครื่องปฏิกรณ์ของระบบที่อุณหภูมิไม่คงที่ เบื้องต้นเกี่ยวกับจลนพลศาสตร์ของปฏิกิริยาที่มีการเร่งปฏิกิริยาบนพื้นผิวและข้อจำกัดการถ่ายโอนมวล",
                    "Course_Description": "Development and application of the theory of chemical kinetics including collision and transition state. Interpretation of chemical rate and selectivity data in homogeneous reaction systems. Design and sizing of ideal and non-ideal chemical reactors. Distributions of residence times for chemical reactors. Reactor design of non-isothermal systems. Introduction to kinetics of surface-catalyzed reactions and mass-transfer limitation."
                }
            },
            {
                "category": "วคม.320 การบำบัดของเสียจากอุตสาหกรรม",
                "subcategories": {
                    "รหัสวิชา": "CHE320",
                    "ชื่อภาษาอังกฤษ": "Industrial Waste Treatment",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา": "ผลกระทบต่อสิ่งแวดล้อมอันเนื่องมาจากมลพิษจากอุตสาหกรรม คุณลักษณะและองค์ประกอบของของเสียจากโรงงานอุตสาหกรรมทั้งที่เป็นน้ำเสีย อากาศเสียและกากของเสีย มาตรฐานคุณภาพของของเสีย การบำบัดของเสียได้แก่การบำบัดน้ำเสีย การควบคุมมลพิษทางอากาศและการจัดการกากของเสีย",
                    "Course_Description": "Impacts of environmental pollution from industrial sector. Characteristics of wastes. Environmental quality standards. Waste treatment including wastewater treatment, air pollution control, solid waste management."
                }
            },
            {
                "category": "วคม.323 ความปลอดภัยทางวิศวกรรมเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE323",
                    "ชื่อภาษาอังกฤษ": "Chemical Engineering Safety",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา": "หลักการความปลอดภัยและการป้องกันความสูญเสียในโรงงาน ตัวอย่างอุบัติเหตุที่อาจเกิดขึ้นในโรงงานเคมี อันตรายของสารเคมีที่มีต่อบุคคลและสิ่งแวดล้อม ข้อบังคับต่าง ๆ วิธีการป้องกันและควบคุมในการใช้และการเก็บรักษาสารเคมี อุปกรณ์ป้องกันส่วนบุคคล แบบจำลองแหล่งกำเนิดและการปลดปล่อยวัสดุอันตราย ไฟและการะเบิด การป้องกันไฟและการระเบิด การประเมินความเสี่ยง การวิเคราะห์แบบ HAZOP"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 19,
        "details": [
            {
                "category": "หลักสูตร",
                "subcategories": {
                    "รายวิชา": "วคม.586 การเขียนบทความวิจัย 3 (2-3-4)",
                    "ชื่อภาษาอังกฤษ": "CHE586 Research paper writing"
                }
            },
            {
                "category": "โครงสร้างหลักสูตร",
                "subcategories": {
                    "วิชาเลือกเสรี": "6 หน่วยกิต",
                    "เงื่อนไขวิชาเลือกเสรี": "นักศึกษาสามารถเลือกศึกษาวิชาใดก็ได้ โดยเป็นรายวิชาที่มีรหัสวิชาตั้งแต่ ระดับ 200 ขึ้นไป ที่เปิดสอนในมหาวิทยาลัยธรรมศาสตร์ เป็นวิชาเลือกเสรีไม่น้อยกว่า 6 หน่วยกิต"
                }
            },
            {
                "category": "แผนการศึกษา",
                "subcategories": {
                    "ปีการศึกษาที่_1": {
                        "ภาคเรียนที่_1": [
                            {
                                "รหัสวิชา": "มธ.124",
                                "ชื่อวิชา": "สังคมกับเศรษฐกิจ",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "ศศ.101",
                                "ชื่อวิชา": "การคิด อ่าน และเขียนอย่างมีวิจารณญาณ",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วท.123",
                                "ชื่อวิชา": "เคมีพื้นฐาน",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "มธ.100",
                                "ชื่อวิชา": "พลเมืองกับการลงมือแก้ไขปัญหา",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "ค.111",
                                "ชื่อวิชา": "แคลคูลัสพื้นฐาน",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วท.133",
                                "ชื่อวิชา": "ฟิสิกส์สำหรับวิศวกร 1",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วท.173",
                                "ชื่อวิชา": "ปฏิบัติการเคมีพื้นฐาน",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วท.183",
                                "ชื่อวิชา": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 1",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วศว.100",
                                "ชื่อวิชา": "จริยธรรมสำหรับวิศวกร",
                                "หน่วยกิต": 0
                            },
                            {
                                "รหัสวิชา": "วศว.101",
                                "ชื่อวิชา": "เทคโนโลยีสารสนเทศสมัยใหม่เบื้องต้น",
                                "หน่วยกิต": 1
                            }
                        ],
                        "รวมหน่วยกิตภาคเรียนที่_1": 21,
                        "ภาคเรียนที่_2": [
                            {
                                "รหัสวิชา": "สษ.105",
                                "ชื่อวิชา": "ทักษะการสื่อสารทางภาษาอังกฤษ",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วพ.101",
                                "ชื่อวิชา": "การเขียนโปรแกรมเบื้องต้นคอมพิวเตอร์",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "ค.112",
                                "ชื่อวิชา": "เรขาคณิตวิเคราะห์และแคลคูลัสประยุกต์",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วท.134",
                                "ชื่อวิชา": "ฟิสิกส์สำหรับวิศวกร 2",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วท.184",
                                "ชื่อวิชา": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 2",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วก.100",
                                "ชื่อวิชา": "กราฟิกวิศวกรรม",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.121",
                                "ชื่อวิชา": "วัสดุวิศวกรรม",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.100",
                                "ชื่อวิชา": "เคมีวิเคราะห์และเคมีฟิสิกส์พื้นฐาน",
                                "หน่วยกิต": 3
                            }
                        ],
                        "รวมหน่วยกิตภาคเรียนที่_2": 22
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 29,
        "details": [
            {
                "category": "มธ.103 ชีวิตกับความยั่งยืน",
                "subcategories": {
                    "รหัสวิชา": "มธ.103",
                    "ชื่อวิชาภาษาไทย": "ชีวิตกับความยั่งยืน",
                    "ชื่อวิชาภาษาอังกฤษ": "Life and Sustainability",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "การดำเนินชีวิตอย่างเท่าทันกับการเปลี่ยนแปลงของโลก เข้าใจความสัมพันธ์ระหว่างพลวัตของธรรมชาติ มนุษย์ และสรรพสิ่ง ทั้งสิ่งแวดล้อมสรรสร้าง การใช้พลังงาน เศรษฐกิจ สังคมในความขัดแย้งและการแปรเปลี่ยน ตลอดจนองค์ความรู้ทางวิทยาศาสตร์สิ่งแวดล้อม ที่นำไปสู่การปรับเปลี่ยนวิถีชีวิตสู่ความยั่งยืน",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "This course provides an introduction to the importance of life-cycle systems perspectives in understanding major challenges and solutions to achieving more sustainable societies in this changing world. Students will learn about the relationship between mankind and the environment in the context of energy and resource use, consumption and development, and environmental constraints. Furthermore, an examination of social conflict and change from the life-cycle perspective will be used to develop an understanding of potential solution pathways for sustainable lifestyle modifications."
                }
            },
            {
                "category": "มธ.107 ทักษะดิจิทัลกับการแก้ปัญหา",
                "subcategories": {
                    "รหัสวิชา": "มธ.107",
                    "ชื่อวิชาภาษาไทย": "ทักษะดิจิทัลกับการแก้ปัญหา",
                    "ชื่อวิชาภาษาอังกฤษ": "Digital Skill and Problem Solving",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "ทักษะการคิดเชิงคำนวณเพื่อการแก้ปัญหาและการพัฒนาโอกาสใหม่ด้านสังคมและเศรษฐกิจ ความสามารถในค้นหาและการเข้าถึงสารสนเทศได้อย่างมีประสิทธิภาพ การประเมินความน่าเชื่อถือของสารสนเทศ การกลั่นกรองและจัดการสารสนเทศอย่างเป็นระบบ การใช้และจรรยาบรรณด้านดิจิทัล การสื่อสารออนไลน์อย่างมืออาชีพ",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Basic computational thinking skill for solving problems and developing new social and economic opportunities. Efficient access and search for information. Information reliability evaluation. Filtering and managing information systematically. Ethical digital usage and professional online communication."
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 44,
        "details": [
            {
                "category": "วคม.373 เศรษฐศาสตร์วิศวกรรมเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE373",
                    "ชื่อภาษาอังกฤษ": "Chemical Engineering Economics",
                    "หน่วยกิต": "2 (2-0-4)",
                    "เนื้อหา": {
                        "หลักการเบื้องต้น": "หลักการเบื้องต้นทางเศรษฐศาสตร์วิศวกรรม",
                        "การคำนวณค่าเงิน": "การคำนวณค่าเงินที่เปลี่ยนตามเวลา",
                        "เทคนิคการประมาณราคา": "เทคนิคการประมาณราคา",
                        "ค่าเสื่อมราคา": "ค่าเสื่อมราคา",
                        "การลงทุนและค่าดำเนินการ": "เงินลงทุนและค่าดำเนินโครงการ",
                        "การวิเคราะห์ความคุ้มค่า": {
                            "วิธีการ": [
                                "Payback Period",
                                "Return on Investment",
                                "Net Present Value",
                                "Internal Rate of Return"
                            ]
                        },
                        "การประเมินทางเลือก": "การประเมินทางเลือกของโครงการทางวิศวกรรมเคมี"
                    }
                }
            },
            {
                "category": "วคม.374 การจัดการทางวิศวกรรมเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE374",
                    "ชื่อภาษาอังกฤษ": "Chemical Engineering Management",
                    "หน่วยกิต": "2 (2-0-4)",
                    "เนื้อหา": {
                        "บทนำและหน้าที่การบริหาร": "บทนำ และหน้าที่การบริหาร",
                        "การเพิ่มผลผลิต": "การเพิ่มผลผลิต",
                        "การบริหารการผลิตและการปฏิบัติการ": "การบริหารการผลิตและการปฏิบัติการ",
                        "การควบคุมคุณภาพ": "การควบคุมคุณภาพ",
                        "การจัดการห่วงโซ่อุปทาน": "การจัดการห่วงโซ่อุปทาน",
                        "การบริหารแบบลีน": "การบริหารแบบลีน",
                        "การบริหารความเสี่ยง": "การบริหารความเสี่ยง",
                        "การบริหารโครงการ": "การบริหารโครงการ",
                        "การสร้างแผนกลยุทธ์": "การสร้างแผนกลยุทธ์",
                        "การตัดสินใจ": "การตัดสินใจ",
                        "ระบบมาตรฐานในอุตสาหกรรม": {
                            "ISO9000": "quality management system",
                            "ISO14000": "environmental management system",
                            "ISO5000": "energy management system",
                            "ISO45000": "occupational health & safety management system"
                        }
                    }
                }
            },
            {
                "category": "วคม.381 ปฏิบัติการทางวิศวกรรมเคมี 1",
                "subcategories": {
                    "รหัสวิชา": "CHE381",
                    "ชื่อภาษาอังกฤษ": "Chemical Engineering Laboratory I",
                    "หน่วยกิต": "1 (0-3-0)",
                    "วิชาบังคับก่อน": "สอบได้ วคม.311",
                    "เนื้อหา": {
                        "หัวข้อการทดลอง": [
                            "ปรากฏการณ์ถ่ายโอน",
                            "ปฏิกิริยาเคมีและสมดุลเคมี"
                        ],
                        "ทักษะที่ได้รับ": [
                            "การใช้เครื่องมือวิเคราะห์",
                            "ความปลอดภัยในการทำปฏิบัติการ",
                            "การออกแบบการทดลอง"
                        ],
                        "ตัวอย่างหัวข้อปฏิบัติการ": [
                            "การนำความร้อน",
                            "ความหนืดของของเหลว",
                            "การแพร่",
                            "ค่าคงที่ของการเกิดปฏิกิริยา",
                            "ค่าคงที่ของสมดุลเคมี"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 39,
        "details": [
            {
                "category": "Laboratory Skills",
                "subcategories": {
                    "Quantitative Analysis": "Gravimetry, titrimetry by acid-base, precipitation and redox reactions",
                    "Separation Techniques": "Extraction, recrystallization, various kinds of distillation, filtration, chromatography",
                    "Synthesis": "Chemical compounds synthesis, organic compounds synthesis using various reactions",
                    "Physical Chemistry Experiments": "Adsorption, 3-components system, reaction kinetics, UV-Vis spectroscopy, heat of solution determination",
                    "Other Techniques": "Fermentation, determination of chemical equilibrium constant"
                }
            },
            {
                "category": "Course Information",
                "subcategories": {
                    "CHE284": "Chemistry Laboratory for Chemical Engineers I, 1 (0-3-3)",
                    "CHE285": "Chemistry Laboratory for Chemical Engineers II, 1 (0-3-3), Prerequisite: CHE284"
                }
            },
            {
                "category": "Document Writing Skills",
                "subcategories": {
                    "Forms": "Generating forms",
                    "Correspondence": "Writing memoranda, emails, letters",
                    "Reports": "Writing weekly reports, experimental notebooks, laboratory reports",
                    "Academic Writing": "Writing abstracts, research articles",
                    "Data Presentation": "Expressing results in graphs, figures, tables, diagrams, using infographics",
                    "References": "Making a list of references",
                    "Software Skills": "Using document writing software",
                    "Language Skills": "Writing in English"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 45,
        "details": [
            {
                "category": "วคม.382 การฝึกงาน",
                "subcategories": {
                    "รหัสวิชา": "CHE382",
                    "ชื่อวิชาภาษาอังกฤษ": "Industrial Training",
                    "จำนวนชั่วโมง": "ไม่น้อยกว่า 240 ชั่วโมงต่อภาคการศึกษา",
                    "วิชาบังคับก่อน": "สอบได้ วคม.311",
                    "คำอธิบายรายวิชา": "การฝึกงานในบริษัทหรือองค์กรที่ได้รับอนุญาตจากอาจารย์ผู้สอนภายในช่วงเวลาที่กำหนดโดยอาจารย์ผู้สอนซึ่งจะต้องไม่น้อยกว่า 240 ชั่วโมง หลังการฝึกงานมีการนำเสนอและการส่งรายงานแก่อาจารย์ผู้สอน วัดผลการศึกษาด้วยระดับ S หรือ U",
                    "Course Description": "Practical training in a company or an organization with permission from the instructor, during a period decided by the instructor which is not less than 240 hours. After the training, the presentation is done and a report is submitted to the instructor. Measuring level is S or U."
                }
            },
            {
                "category": "วคม.461 พลศาสตร์ของกระบวนการและการควบคุม",
                "subcategories": {
                    "รหัสวิชา": "CHE461",
                    "ชื่อวิชาภาษาอังกฤษ": "Process Dynamics and Control",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วคม.205",
                    "คำอธิบายรายวิชา": "การวิเคราะห์พฤติกรรมทางพลศาสตร์ของกระบวนการทางเคมีทั้งแบบเชิงเส้นและไม่เชิงเส้น การวิเคราะห์ความเสถียรของกระบวนการ การออกแบบระบบควบคุมแบบ PID การเลือกตัวแปรควบคุมและถูกควบคุม การควบคุมกระบวนการด้วยโปรแกรมคอมพิวเตอร์",
                    "Course Description": "Analysis of chemical process dynamics whose behavior is linear or linearized. Process stability analysis. Design of PID controllers. Selections of control and manipulated variables. Process control study using computer program."
                }
            },
            {
                "category": "วคม.474 การออกแบบกระบวนการผลิตและการออกแบบโรงงาน",
                "subcategories": {
                    "รหัสวิชา": "CHE474",
                    "ชื่อวิชาภาษาอังกฤษ": "Chemical Process and Plant Design",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วคม.233"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 35,
        "details": [
            {
                "category": "วิชาพื้นฐานทางวิศวกรรม",
                "subcategories": {
                    "วอ.121_วัสดุวิศวกรรม": {
                        "รหัสวิชา": "วอ.121",
                        "ชื่อวิชา": "วัสดุวิศวกรรม",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "ความสัมพันธ์ระหว่าง โครงสร้าง สมบัติ กระบวนการผลิต และการประยุกต์ใช้งานของกลุ่มวิศวกรรมหลัก ได้แก่ โลหะ พอลิเมอร์ เซรามิกส์ และวัสดุผสม แผนภูมิสมดุล สมบัติทางกล และการเสื่อมสภาพของวัสดุ",
                        "Course_Description": "Relationship between structures, properties, production processed and applications of main groups of engineering materials i.e, metals, polymers, Ceramics and composites; phase equilibrium diagrams mechanical properties and materials degradation."
                    }
                }
            },
            {
                "category": "วิชาเฉพาะด้าน",
                "subcategories": {
                    "กลุ่มวิชาบังคับทางวิศวกรรม": {
                        "วิชาบังคับในสาขา": {
                            "วคม.100_เคมีวิเคราะห์และเคมีเชิงฟิสิกส์พื้นฐาน": {
                                "รหัสวิชา": "วคม.100",
                                "ชื่อวิชา": "เคมีวิเคราะห์และเคมีเชิงฟิสิกส์พื้นฐาน",
                                "หน่วยกิต": "3 (3-0-6)",
                                "คำอธิบายรายวิชา": "หลักการคำนวณพื้นฐานด้านเคมีวิเคราะห์ การวิเคราะห์เชิงน้ำหนัก การวิเคราะห์เชิงปริมาตร การไตเตรตแบบต่าง ๆ พื้นฐานด้านเคมีเชิงฟิสิกส์ พื้นฐานทางเธอร์โมไดนามิกส์ ฟังก์ชันต่าง ๆ ทางเธอร์โมไดนามิกส์ เคมีควอนตัม สมดุลเคมี เคมีไฟฟ้า",
                                "Course_Description": "Fundamental of calculation in analytical chemistry. Gravimetric analysis. Volumetric analysis. Titrations. Fundamental in physical chemistry. Fundamental of thermodynamics. Thermodynamic functions. Quantum chemistry. Chemical equilibrium. Electrochemistry."
                            }
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 53,
        "details": [
            {
                "category": "วคม.327 การประเมินวัฏจักรชีวิตของผลิตภัณฑ์",
                "subcategories": {
                    "รหัสวิชา": "CHE327",
                    "ชื่อวิชาภาษาอังกฤษ": "Life Cycle Assessment of Products",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "การประเมินผลกระทบต่อสิ่งแวดล้อมของผลิตภัณฑ์หรือกระบวนการ ความสำคัญของการประเมินผลกระทบ นิยามของจุดประสงค์และขอบเขตในการประเมินวัฏจักรชีวิต โดยศึกษาผลกระทบต่อสิ่งแวดล้อมในเชิงปริมาณ ขั้นตอนการดำเนินการประเมินวัฏจักรชีวิตของผลิตภัณฑ์ และการแปรผลการประเมินการเปรียบเทียบผลกระทบต่อสิ่งแวดล้อมของกระบวนการหรือผลิตภัณฑ์มากกว่าหนึ่งชนิด การประยุกต์ใช้โปรแกรมช่วยในการประเมินผลกระทบ",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Principle of Life Cycle Assessment and its application. Goal and scope definition including inventory and impact assessment in terms of quantitative analysis. Life cycle assessment methodology and interpretation. Computer simulation of product systems. Comparison of environmental impacts of products."
                }
            },
            {
                "category": "วคม.328 การวิเคราะห์ปัจจัยการผลิตและผลผลิตสำหรับการจัดการสิ่งแวดล้อม",
                "subcategories": {
                    "รหัสวิชา": "CHE328",
                    "ชื่อวิชาภาษาอังกฤษ": "Environmental input-output analysis",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "ความรู้พื้นฐานในการวิเคราะห์ปัจจัยการผลิตและผลผลิต แบบจำลองเชิงปริมาณ แบบจำลองเชิงมูลค่า แบบจำลองด้านนิเวศน์อุตสาหกรรม แบบจำลองแบบขยายขอบเขต การวิเคราะห์ waste input-output",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Basic principle of input-output analysis. Physical model. Monetary model. Industrial ecology model. Expansion model. Waste input-output analysis."
                }
            },
            {
                "category": "วคม.329 การจัดการคาร์บอนสำหรับภาคธุรกิจและอุตสาหกรรม",
                "subcategories": {
                    "รหัสวิชา": "CHE329",
                    "ชื่อวิชาภาษาอังกฤษ": "Carbon management for business and industry",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "หลักการเบื้องต้นของการบริหารจัดการห่วงโซ่การผลิต การประเมินคาร์บอนฟุตพริ้นท์ประเภทต่าง ๆ หลักการบริหารจัดการเพื่อลดการปล่อยก๊าซเรือนกระจก เช่น ระเบียบวิธีการลดก๊าซเรือนกระจกภาคสมัครใจ หลักการกักเก็บคาร์บอน",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Basic principle of supply chain management. Carbon footprint analysis. Carbon reduction management such as voluntary emission reduction program, carbon capture and storage."
                }
            },
            {
                "category": "วคม.336 เทคโนโลยีการทำน้ำบริสุทธิ์",
                "subcategories": {
                    "รหัสวิชา": "CHE336",
                    "ชื่อวิชาภาษาอังกฤษ": "Water Purification Technology",
                    "หน่วยกิต": "3 (3-0-6)"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 59,
        "details": [
            {
                "category": "วิชาวิศวกรรมเคมี",
                "subcategories": {
                    "วคม.359": {
                        "ชื่อวิชา": "การจำลองกระบวนการทางวิศวกรรมเคมี",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "การจำลองกระบวนการโดยโปรแกรมสำเร็จรูปที่นิยมใช้กันในอุตสาหกรรม เพื่อศึกษาผลกระทบขององค์ประกอบต่าง ๆ ที่มีต่อกระบวนการต่าง ๆ ทางวิศวกรรมเคมี",
                        "ชื่อภาษาอังกฤษ": "Chemical Engineering Process Simulation",
                        "คำอธิบายภาษาอังกฤษ": "Process simulations by using a well-known commercial software to study the effects of various factors in chemical engineering processes."
                    },
                    "วคม.377": {
                        "ชื่อวิชา": "การออกแบบกระบวนการเคมีในอุตสาหกรรมปิโตรเคมี 1",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ วคม.205",
                        "คำอธิบายรายวิชา": "ให้เข้าพื้นฐานอุตสาหกรรมปิโตรเคมีทั้งระบบ โดยเป็นการเรียนแบบ Problem-based ใช้ความรู้ทางเธอร์โมไดนามิกส์ร่วมกับสมดุลมวล สมดุลพลังงาน และการออกแบบระบบท่อ ระบบส่งสารเคมีและแก๊ส อาศัยการจำลองกระบวนการและการกำหนดผังโรงงาน",
                        "ชื่อภาษาอังกฤษ": "Chemical Process Design in Petrochemical Industry I",
                        "คำอธิบายภาษาอังกฤษ": "Basic in Petrochemical industrials; Problem-based learning involving thermodynamics mass and energy balance, piping design, and gas/solution delivery system; Process simulation and process layout are also included."
                    },
                    "วคม.378": {
                        "ชื่อวิชา": "การออกแบบการทดลองสำหรับงานทางวิศวกรเคมี",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "หลักการทางสถิติที่เกี่ยวข้องกับการออกแบบการทดลอง การสร้างและการประเมินแบบจำลองที่ได้จากการทดลอง การออกแบบการทดลองในรูปแบบต่าง ๆ ซึ่งรวมถึงการออกแบบการทดลองแบบบล็อก การออกแบบการทดลองแบบแฟกทอเรียลแบบเต็มรูปแบบและแบบบางส่วน การออกแบบการทดลองสำหรับแบบการสร้างแบบจำลองที่มีพจน์ที่มีกำลังมากกว่าหนึ่ง การประยุกต์ใช้หลักการพื้นผิวตอบสองเพื่อหาค่าที่เหมาะสมของกระบวนการ การประยุกต์ใช้การออกแบบการทดลองในรูปแบบต่าง ๆ สำหรับงานด้านวิศวกรรมเคมี",
                        "ชื่อภาษาอังกฤษ": "Design of Experiments for Chemical Engineers"
                    }
                }
            },
            {
                "category": "เนื้อหาเพิ่มเติม",
                "subcategories": {
                    "การแก้ปัญหาในอุตสาหกรรม": "เน้นการแก้ปัญหาในอุตสาหกรรมการกลั่น ด้วยวิธีการที่เหมาะสมและเป็นแนวทางปฏิบัติในอุตสาหกรรม เพื่อให้การดำเนินการในกระบวนการควบคุมได้อย่างเหมาะสม",
                    "Problem Solving in Petroleum Industry": "An emphasis on problem solving in the petroleum and refinery industries. This handy go-to emphasizes single and well-established process engineering principles that will help switch manual control loops to automatic control."
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 38,
        "details": [
            {
                "category": "วคม.213 กลศาสตร์ของไหลสำหรับวิศวกรเคมี",
                "subcategories": {
                    "วิชาบังคับก่อน": "สอบได้ ค.111",
                    "เนื้อหา": "คุณสมบัติของของไหล, สมการอนุพันธ์ของกลศาสตร์ของไหล, การไหลของของไหลในพิกัดต่างๆ, สมดุลมวล พลังงาน และโมเมนตัมในกลศาสตร์ของไหล, สมการเบอร์นูลลี, การไหลของของไหลและการสูญเสียในท่อกลมและไม่กลม, สถิตศาสตร์ของของไหล, หลักการและการประยุกต์ใช้อุปกรณ์วัดการไหล, ปั๊มและคอมเพรสเซอร์, การไหลผ่านวัตถุจมและวัสดุพรุน รวมถึงการกวน การแยกแบบหมุนเหวี่ยง การตกตะกอน การทำให้เป็นของไหล และการกรอง"
                }
            },
            {
                "category": "วคม.250 การแก้ปัญหากระบวนการทางวิศวกรรมเคมี",
                "subcategories": {
                    "วิชาบังคับก่อน": "สอบได้ ค.214",
                    "เนื้อหา": "การหาคำตอบของชุดสมการเชิงเส้น, การหาคำตอบของชุดสมการไม่เชิงเส้น, การแก้สมการอนุพันธ์ด้วยเทคนิคต่างๆ, วิธีเชิงตัวเลขสำหรับการแก้สมการอนุพันธ์ทั้งแบบปัญหาเงื่อนไขเริ่มต้นและเงื่อนไขขอบเขต, การประมาณค่าพารามิเตอร์ของแบบจำลองจากผลการทดลอง, การใช้โปรแกรมช่วยในการคำนวณปัญหาทางวิศวกรรมเคมี",
                    "การประยุกต์ใช้": "การไหลของของไหล, การถ่ายเทความร้อน, การถ่ายโอนมวล, การวิเคราะห์เครื่องปฏิกรณ์"
                }
            },
            {
                "category": "วคม.280 การเขียนเชิงเทคนิคสำหรับวิศวกรเคมี",
                "subcategories": {
                    "ทักษะการเขียน": "การสร้างแบบฟอร์ม, การเขียนบันทึกข้อความ, การเขียนอีเมล, การเขียนจดหมาย, การเขียนรายงานประจำสัปดาห์, การเขียนบันทึกการทดลอง, การเขียนรายงานการทดลอง, การเขียนบทคัดย่อ, การเขียนบทความวิจัย",
                    "การนำเสนอข้อมูล": "การแสดงผลการทดลองด้วยรูปแบบต่างๆ เช่น กราฟ รูปภาพ ตาราง แผนภูมิ, การทำรายการอ้างอิง, การใช้เทคนิคเช่นอินโฟกราฟฟิคในการนำเสนอข้อมูล",
                    "ทักษะเสริม": "การฝึกใช้โปรแกรมที่เกี่ยวข้องกับการเขียน, การเขียนเป็นภาษาอังกฤษ"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 26,
        "details": [
            {
                "category": "หมวดความเป็นผู้ประกอบการ",
                "subcategories": {
                    "การประเมินความเสี่ยงและการสร้างโอกาสใหม่": "วิเคราะห์และประเมินความเสี่ยงในการทำธุรกิจ พร้อมทั้งมองหาโอกาสใหม่ๆ",
                    "การคิดและการวางแผนแบบผู้ประกอบการ": "พัฒนาความคิดและวางแผนธุรกิจในแบบของผู้ประกอบการ",
                    "การตัดสินใจและการพัฒนาธุรกิจ": "ฝึกการตัดสินใจทางธุรกิจและพัฒนาโครงการผู้ประกอบการ",
                    "การสื่อสารเชิงธุรกิจและการสร้างแรงจูงใจ": "พัฒนาทักษะการสื่อสารทางธุรกิจและการนำเสนอแนวคิดอย่างมีประสิทธิภาพ",
                    "การสร้างคุณค่าร่วมเพื่อสังคม": "เรียนรู้การสร้างคุณค่าร่วมกันระหว่างธุรกิจและสังคม"
                }
            },
            {
                "category": "หมวดสุนทรียะและทักษะการสื่อสาร",
                "subcategories": {
                    "ศศ.101 การคิด อ่าน และเขียนอย่างมีวิจารณญาณ": {
                        "รหัสวิชา": "ศศ.101",
                        "ชื่อวิชา": "การคิด อ่าน และเขียนอย่างมีวิจารณญาณ",
                        "หน่วยกิต": "3 (3-0-6)",
                        "ทักษะที่พัฒนา": [
                            "การคิดอย่างมีวิจารณญาณ",
                            "การอ่านเพื่อจับสาระสำคัญ",
                            "การเขียนแสดงความคิดเห็นอย่างมีเหตุผล",
                            "การเขียนเชิงวิชาการ"
                        ],
                        "รายละเอียด": "พัฒนาทักษะการคิด อ่าน และเขียนอย่างมีวิจารณญาณ ผ่านการวิเคราะห์ สังเคราะห์ และประเมินค่า เพื่อนำไปสู่การสร้างสรรค์งานเขียนที่มีประสิทธิภาพ"
                    },
                    "สษ.105 ทักษะการสื่อสารทางภาษาอังกฤษ": {
                        "รหัสวิชา": "สษ.105",
                        "ชื่อวิชา": "ทักษะการสื่อสารทางภาษาอังกฤษ",
                        "หน่วยกิต": "3 (3-0-6)",
                        "ทักษะที่พัฒนา": [
                            "การฟัง",
                            "การพูด",
                            "การอ่าน",
                            "การเขียน"
                        ],
                        "รายละเอียด": "พัฒนาทักษะการสื่อสารภาษาอังกฤษทั้งสี่ด้าน ฝึกการใช้ภาษา คำศัพท์ และสำนวนในบริบททางวิชาการและสังคม"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 25,
        "details": [
            {
                "category": "วิชาศึกษาทั่วไป",
                "subcategories": {
                    "หมวดความเท่าทันโลกและสังคม": {
                        "มธ.124 สังคมกับเศรษฐกิจ": {
                            "รหัสวิชา": "TU124",
                            "ชื่อวิชาภาษาอังกฤษ": "Society and Economy",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คำอธิบายรายวิชา": "แนวทางการศึกษาและการวิเคราะห์สังคม และเศรษฐกิจในฐานะที่วิชานี้เป็นการศึกษาทางด้านสังคมศาสตร์ แล้วนำสู่การวิเคราะห์วิวัฒนาการของสังคมและเศรษฐกิจที่เกิดขึ้นในภาพกว้างของโลกและของประเทศไทย โดยเน้นให้เห็นถึงอิทธิพลของวัฒนธรรมและสถาบันที่มีต่อระบบสังคมเศรษฐกิจ",
                            "Course Description": "To provide guidelines for the study and analysis of society and economy. To analyze social and economic evolution in Thailand and worldwide. To emphasize the influence of culture and institutions on the social and economic system."
                        },
                        "มธ.101 โลก อาเซียน และไทย": {
                            "รหัสวิชา": "TU101",
                            "ชื่อวิชาภาษาอังกฤษ": "Thailand, ASEAN, and the World",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คำอธิบายรายวิชา": "ศึกษาปรากฏการณ์ที่สำคัญของโลก อาเซียนและไทย ในมิติทางการเมือง เศรษฐกิจ สังคมวัฒนธรรม โดยใช้กรอบแนวคิด ทฤษฎี และระเบียบวิจัยทางสังคมศาสตร์ ผ่านการอภิปรายและยกตัวอย่างสถานการณ์หรือบุคคลที่ได้รับความสนใจ เพื่อให้เกิดมุมมองต่อความหลากหลายและเข้าใจความซับซ้อนที่สัมพันธ์กันทั้งโลก มีจิตสำนึกสากล (GLOBAL MINDSET) สามารถท้าทายกรอบความเชื่อเดิมและเปิดโลกทัศน์ใหม่ให้กว้างขวางขึ้น",
                            "Course Description": "Study of significant phenomena around the world, in the ASEAN region and in Thailand in terms of their political, economic and sociocultural dimensions. This is done through approaches, theories and principles of social science research via discussion and raising examples of situations or people of interest. The purpose of this is to create a perspective of diversity, to understand the complexity of global interrelationships, to build a global mindset and to be able to challenge old paradigms and open up a new, broader worldview."
                        },
                        "มธ.109 นวัตกรรมกับกระบวนคิดผู้ประกอบการ": {
                            "รหัสวิชา": "TU109",
                            "ชื่อวิชาภาษาอังกฤษ": "Innovation and Entrepreneurial Mindset",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คำอธิบายรายวิชา": "ไม่มีข้อมูลในเอกสารอ้างอิง",
                            "Course Description": "ไม่มีข้อมูลในเอกสารอ้างอิง"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 61,
        "details": [
            {
                "category": "วิชาวิศวกรรมเคมี",
                "subcategories": {
                    "วคม.478": {
                        "ชื่อวิชา": "ปรากฏการณ์การถ่ายโอนในการออกแบบผลิตภัณฑ์เคมี",
                        "หน่วยกิต": "3 (3-0-6)",
                        "รหัสวิชาภาษาอังกฤษ": "CHE478",
                        "ชื่อวิชาภาษาอังกฤษ": "Transport Phenomena in Chemical Product Design",
                        "คำอธิบายรายวิชา": {
                            "ภาษาไทย": "ทบทวนความรู้เกี่ยวกับการถ่ายโอนโมเมนตัม ความร้อน และมวลสาร ตลอดจนแบบจำลองการถ่ายโอนในมิติต่าง ๆ ทั้งระบบคงตัวและระบบที่เปลี่ยนแปลงตามเวลา การประยุกต์ใช้กับการออกแบบผลิตภัณฑ์เคมีที่ต้องอาศัยแบบจำลองเพื่อทำนายสมบัติที่จำเป็นของผลิตภัณฑ์นั้น ๆ เช่น การออกแบบระบบปลดปล่อยยา การออกแบบฉนวนกันความร้อนจากวัสดุเหลือใช้ หรือ การออกแบบวัสดุเพื่อทำหลอดเลือดเทียม เป็นต้น",
                            "ภาษาอังกฤษ": "Review of momentum, heat and mass transfers. Model equations for transport in multi-dimension for stead state systems and transient systems. Applications to chemical product design which needs models to predict required properties of products. For example, the design of drug release system, the design of insulator made of waste materials or the design of materials for artificial blood vessels."
                        }
                    }
                }
            },
            {
                "category": "กลุ่มเทคโนโลยีชีวภาพและวิทยาศาสตร์ชีวภาพ",
                "subcategories": {
                    "วคม.366": {
                        "ชื่อวิชา": "ชีววิทยาสำหรับวิศวกรรมเคมี",
                        "หน่วยกิต": "3 (3-0-6)",
                        "รหัสวิชาภาษาอังกฤษ": "CHE366",
                        "ชื่อวิชาภาษาอังกฤษ": "Biology for Chemical Engineering",
                        "คำอธิบายรายวิชา": {
                            "ภาษาไทย": "องค์ประกอบทางเคมีของสิ่งมีชีวิต สารโมเลกุลใหญ่ของสิ่งมีชีวิต ดีเอ็นเอ อาร์เอ็นเอ โครงสร้างของโปรตีน เซลล์และกระบวนการภายในเซลล์ เซลล์เมมเบรนและการถ่ายโอน โครงการจีโนม การสื่อสารของเซลล์ การแบ่งเซลล์ เซลล์ต้นกำเนิดและวิศวกรรมเนื้อเยื่อ",
                            "ภาษาอังกฤษ": "Chemical composition of an organism. Macromolecules of life. DNA. RNA. Protein structures. Cells and processes inside the cells. Cell membrane and transport mechanism. Genome project. Cell communication. Cell division. Stem cells and tissue engineering."
                        }
                    },
                    "วคม.367": {
                        "ชื่อวิชา": "วิศวกรรมกระบวนการทางชีวภาพ",
                        "หน่วยกิต": "3 (3-0-6)",
                        "รหัสวิชาภาษาอังกฤษ": "CHE367",
                        "ชื่อวิชาภาษาอังกฤษ": "Bioprocess Engineering",
                        "วิชาบังคับก่อน": "สอบได้ วคม.315"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 42,
        "details": [
            {
                "category": "วคม.334 การถ่ายโอนมวลสำหรับวิศวกรเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE334",
                    "ชื่อภาษาอังกฤษ": "Mass Transfer for Chemical Engineers",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วคม.205",
                    "เนื้อหาภาษาไทย": "การทำสมดุลมวลสารแบบมหภาคและแบบเฉพาะสาร กลไกการถ่ายโอนมวล กฎของฟิก การแพร่ในสภาวะคงตัว สัมประสิทธิ์การถ่ายโอนมวล และการถ่ายโอนมวลระหว่างเฟส ปรากฏการณ์การถ่ายโอนมวลและความร้อนพร้อมกัน ปรากฏการณ์การถ่ายโอนมวลและการเกิดปฏิกิริยาพร้อมกัน อุปกรณ์ที่ใช้การถ่ายโอนมวล อันได้แก่ การดูดซึมแบบหอบรรจุ การดูดซับ การทำชื้น หอลดอุณหภูมิ การทำแห้ง และการแยกโดยเยื่อบาง",
                    "เนื้อหาภาษาอังกฤษ": "Macroscopic mass balance and mass balance of a single species. Mass transfer mechanisms. Fick's law. Steady-state diffusion. Mass transfer coefficient. Interphase mass transfer. Simultaneous mass and heat transfer. Mass transfer with chemical reactions. Mass transfer unit operations including packed bed absorption, adsorption, humidification, cooling tower, drying, and membrane separations."
                }
            },
            {
                "category": "วคม.335 กระบวนการแยกสำหรับวิศวกรเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE335",
                    "ชื่อภาษาอังกฤษ": "Separation Processes for Chemical Engineers",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วคม.205",
                    "เนื้อหาภาษาไทย": "ความรู้พื้นฐานสำหรับกระบวนการแยกทางวิศวกรรม การกลั่นแบบสมดุลเดี่ยว การกลั่นด้วยการใช้หอกลั่น การทำสมดุลภายในหอกลั่น กระบวนการกลั่นแยกคู่สารและของผสมหลายองค์ประกอบ ระบบการกลั่นแบบกะและแบบต่อเนื่อง กระบวนการดูดซึม กระบวนการสกัดของเหลวด้วยของเหลว กระบวนการกรอง",
                    "เนื้อหาภาษาอังกฤษ": "Introduction to separation process. Method of flash distillation. Column distillation. Internal stage-by-stage balance. Distillation of binary solution and multi-component mixture. Batch and continuous distillation. Absorption and stripping. Liquid-liquid extraction. Filtration."
                }
            },
            {
                "category": "Principles of safety and loss prevention in plant",
                "subcategories": {
                    "Types_of_accidents": "Types of accidents in chemical plants",
                    "Chemical_Exposure": "Chemical Exposure to people and environment",
                    "Regulations": "Information on regulation",
                    "Prevention_and_control": "Prevention and control of chemical hazards during operations and storage",
                    "Personal_protective_equipment": "Personal protective equipment",
                    "Hazardous_material_release": "Source model and hazardous material release",
                    "Fire_and_explosion": {
                        "Description": "Fire and explosion",
                        "Prevention": "Fire and explosion prevention"
                    },
                    "Risk_assessment": "Risk assessment",
                    "HAZOP_Analysis": "HAZOP Analysis"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 36,
        "details": [
            {
                "category": "วคม.200 เคมีอินทรีย์และชีวเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE200",
                    "ชื่อวิชาภาษาอังกฤษ": "Organic and Biochemistry",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "สารอินทรีย์": [
                            "การสร้างพันธะในสารอินทรีย์",
                            "วิธีเรียกชื่อสารอินทรีย์",
                            "ลักษณะของปฏิกิริยาที่เกิดขึ้นในหมู่สารอินทรีย์",
                            "กลไกการเกิดปฏิกิริยา",
                            "สเตอริโอเคมี"
                        ],
                        "ผลกระทบ": [
                            "ด้านอินดัคทีฟ",
                            "ด้านสเตอริค",
                            "ด้านเรโซแนนซ์"
                        ],
                        "ปฏิกิริยา": [
                            "ปฏิกิริยานิวคลิโอฟิลิคซับสติติวชัน",
                            "ปฏิกิริยานิวคลิโอฟิลิคแอดดิชัน",
                            "ปฏิกิริยาอิลิมิเนชัน",
                            "ปฏิกิริยาอิเลคโตรฟิลิคแอดดิชัน",
                            "ปฏิกิริยาอิเลคโตรฟิลิคซับสติติวชัน"
                        ],
                        "ชีวเคมี": [
                            "กรดอะมิโนและโปรตีน",
                            "น้ำตาลและคาร์โบไฮเดรต",
                            "ไขมันและน้ำมัน",
                            "สารละลายบัฟเฟอร์"
                        ],
                        "การประยุกต์": [
                            "การออกแบบยาและระบบนำส่งยา"
                        ]
                    }
                }
            },
            {
                "category": "วคม.201 เคมีประยุกต์สำหรับวิศวกรเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE201",
                    "ชื่อวิชาภาษาอังกฤษ": "Applied Chemistry for Chemical Engineers",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "หัวข้อหลัก": [
                            "จลนพลศาสตร์ของปฏิกิริยา",
                            "สมดุลเฟส",
                            "การแยกด้วยการกลั่นและการสกัด",
                            "ปรากฏการณ์ดูดซับ",
                            "ลักษณะของผลึก",
                            "หลักการของเครื่องมือวิเคราะห์แบบต่าง ๆ",
                            "สารประกอบอนินทรีย์และการประยุกต์ใช้"
                        ],
                        "หัวข้อพิเศษ": [
                            "วัสดุในอุตสาหกรรมวิศวกรรมเคมี",
                            "เซลล์แสงอาทิตย์",
                            "เซลล์เชื้อเพลิง"
                        ]
                    }
                }
            },
            {
                "category": "วคม.202 วิศวกรรมไฟฟ้าเบื้องต้นสำหรับวิศวกรเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE202",
                    "ชื่อวิชาภาษาอังกฤษ": "Introduction to Electrical Engineering for Chemical Engineers",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "วงจรไฟฟ้า": [
                            "การวิเคราะห์วงจรไฟฟ้ากระแสตรงและกระแสสลับเบื้องต้น",
                            "แรงดัน กระแส และกำลังงาน"
                        ],
                        "อุปกรณ์ไฟฟ้า": [
                            "หม้อแปลงไฟฟ้า",
                            "เครื่องจักรกลไฟฟ้า",
                            "เครื่องกำเนิดไฟฟ้า",
                            "มอเตอร์ไฟฟ้าและการนำไปใช้งาน"
                        ],
                        "ระบบไฟฟ้า": [
                            "ระบบไฟฟ้าสามเฟส",
                            "วิธีการส่งถ่ายพลังงานไฟฟ้า"
                        ],
                        "อื่นๆ": [
                            "เครื่องมือวัดพื้นฐานทางไฟฟ้า",
                            "สารกึ่งตัวนำ"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 56,
        "details": [
            {
                "category": "วคม.344 การประยุกต์วิศวกรรมเคมีในกระบวนการนำส่งยา",
                "subcategories": {
                    "รหัสวิชา": "CHE344",
                    "ชื่อภาษาอังกฤษ": "Chemical Engineering Applications in Drug Delivery",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา_ภาษาไทย": "การประยุกต์ใช้ความรู้ทางด้านวิศวกรรมเคมีที่เกี่ยวข้องกับกระบวนการนำส่งยา วิธีการปลดปล่อยตัวยา วัสดุที่เกี่ยวข้องกับการนำส่งยา ฟิล์มบาง วัสดุไฮโดรเจล การใช้สารในลักษณะของอิมัลชั่น ระบบการนำส่งยาไปยังบริเวณเป้าหมาย รวมไปถึงการพัฒนาระบบการนำส่งยา",
                    "คำอธิบายรายวิชา_ภาษาอังกฤษ": "Applying fundamental Chemical Engineering knowledges to understand and develop drug delivery system. Introduction of controlled-release system involving materials design with clinical applications, thin films materials, self-microemulsifying materials, targeted area, drug administration, and drug effectiveness."
                }
            },
            {
                "category": "วคม.345 การพัฒนาเครื่องสำอาง และกระบวนการผลิต",
                "subcategories": {
                    "รหัสวิชา": "CHE345",
                    "ชื่อภาษาอังกฤษ": "Cosmetic formulation and processing",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา_ภาษาไทย": "กระบวนการออกแบบผลิตภัณฑ์เครื่องสำอาง องค์ประกอบของเครื่องสำอางและหน้าที่ อิมัลชัน การคิดสูตรเครื่องสำอางบำรุงผิว เช่น น้ำมัน เจล และอิมัลชัน สำหรับผิวประเภทต่าง ๆ กระบวนการผลิตเครื่องสำอาง การศึกษารีโอโลยีของอิมัลชัน และเจล และการทดสอบผลิตภัณฑ์เครื่องสำอาง",
                    "คำอธิบายรายวิชา_ภาษาอังกฤษ": "Cosmetic product design process, cosmetic ingredients and their functions, emulsion, formulation of various skincare such as oil, gel, and emulsion for various skin types, cosmetic processing, rheological study of emulsions and gels and testing of cosmetic products."
                }
            },
            {
                "category": "วคม.346 หัวข้อพิเศษเกี่ยวกับวัสดุสำหรับอุตสาหกรรม",
                "subcategories": {
                    "รหัสวิชา": "CHE346",
                    "ชื่อภาษาอังกฤษ": "Special Topic in Materials for Industries",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา_ภาษาไทย": "ศึกษาเกี่ยวกับงานวิจัยใหม่ ๆ ที่เกี่ยวข้องกับวัสดุสำหรับนำไปประยุกต์ใช้ในอุตสาหกรรม",
                    "คำอธิบายรายวิชา_ภาษาอังกฤษ": "Study about recent research works concerning materials to be applied and used in industries."
                }
            },
            {
                "category": "วคม.347 เคมีวัสดุ",
                "subcategories": {
                    "รหัสวิชา": "CHE347",
                    "ชื่อภาษาอังกฤษ": "Material Chemistry",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา_ภาษาไทย": "วัสดุชนิดต่าง ๆ ทั้งที่เป็นสารอนินทรีย์และสารอินทรีย์ซึ่งมีคุณสมบัติพิเศษ วัสดุนาโนจำพวกสารกึ่งตัวนำ วัสดุเชิงชีวภาพ เช่น วัสดุทดแทนอวัยวะเทียมและการนำส่งยา วัสดุที่ใช้แก้ไขปัญหาสิ่งแวดล้อมและประหยัดพลังงาน วัสดุที่ใช้ในการแสดงผล วัสดุทางไฟฟ้าและแม่เหล็ก รวมถึงการสร้างความเข้าใจระหว่างโครงสร้างทางเคมีและคุณสมบัติของสารที่เกิดขึ้น และวิธีการวิเคราะห์โครงสร้างและคุณสมบัติของวัสดุเบื้องต้น",
                    "คำอธิบายรายวิชา_ภาษาอังกฤษ": "This information is not provided in the given document."
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 63,
        "details": [
            {
                "category": "วิชาวิศวกรรมเคมี",
                "subcategories": {
                    "วคม.408": {
                        "ชื่อวิชา": "หัวข้อพิเศษทางวิศวกรรมเคมี 3",
                        "ชื่อภาษาอังกฤษ": "Special Topics in Chemical Engineering III",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "หัวข้อที่น่าสนใจและทันสมัยทางวิศวกรรมเคมี",
                        "คำอธิบายภาษาอังกฤษ": "Current interesting topics and modern developments in various fields of chemical engineering."
                    },
                    "วคม.409": {
                        "ชื่อวิชา": "หัวข้อพิเศษทางวิศวกรรมเคมี 4",
                        "ชื่อภาษาอังกฤษ": "Special Topics in Chemical Engineering IV",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "หัวข้อที่น่าสนใจและทันสมัยทางวิศวกรรมเคมี",
                        "คำอธิบายภาษาอังกฤษ": "Current interesting topics and modern developments in various fields of chemical engineering."
                    },
                    "วคม.586": {
                        "ชื่อวิชา": "การเขียนบทความวิจัย",
                        "ชื่อภาษาอังกฤษ": "Research paper writing",
                        "หน่วยกิต": "3 (2-3-4)",
                        "คำอธิบายรายวิชา": "วิธีการทำงานวิจัย ข้อเสนอโครงการวิจัย การโจรกรรมทางวิชาการ องค์ประกอบสำคัญในการรายงานผลการวิจัย อาทิ บทคัดย่อ วรรณกรรมปริทัศน์ กระบวนการศึกษา ผลการวิจัย อภิปรายผลการวิจัยและสรุปงานวิจัย เป็นต้น การเลือกคำสำคัญ การตั้งชื่อบทความ การอ้างอิงแหล่งที่มา การจัดทำโปสเตอร์และการนำเสนอ การเขียนร่างบทความวิจัย เทคนิคการนำผลงานวิจัยไปตีพิมพ์เผยแพร่",
                        "คำอธิบายภาษาอังกฤษ": "Research methodology. Research Proposal. Plagiarism. Paraphrasing and citation. Essential parts in research report including, but not limited to, abstract, literature review, methodology, results, discussion and conclusion. Keywords selection. Title creation. References. Poster preparation and presentation. Research manuscript preparation. Techniques for research paper publication."
                    },
                    "วคม.106": {
                        "ชื่อวิชา": "ความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน",
                        "ชื่อภาษาอังกฤษ": "Sustainability of Natural Resources and Energy",
                        "หน่วยกิต": "3 (3-0-6)",
                        "หมายเหตุ": "รายวิชาในหลักสูตรที่เปิดสอนให้วิทยาลัย/คณะ/ภาควิชา/หลักสูตรอื่นต้องมาเรียน"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 51,
        "details": [
            {
                "category": "วคม.316 ปิโตรเลียมและเชื้อเพลิงทดแทน",
                "subcategories": {
                    "รหัสวิชา": "CHE316",
                    "ชื่อวิชาภาษาอังกฤษ": "Petroleum and Alternative fuel",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "กำเนิดของน้ำมันปิโตรเลียม": "Origin of Petroleum",
                        "ประเภทและองค์ประกอบของปิโตรเลียม": "Classification and composition of Petroleum",
                        "หน่วยกลั่นน้ำมันดิบ": "Crude distillation unit",
                        "อนุพันธ์ของปิโตรเลียม": "Petroleum derivatives",
                        "สมบัติทางเคมีและทางกายภาพของอนุพันธ์ปิโตรเลียม": "Chemical and physical properties of petroleum derivatives",
                        "เชื้อเพลิงทดแทนแก๊สโซลีนและดีเซล": "Gasoline and diesel alternative fuels",
                        "สมบัติและปฏิกิริยาเคมีที่เกี่ยวข้อง": "Properties and related chemical reactions"
                    }
                }
            },
            {
                "category": "วคม.317 อุตสาหกรรมปิโตรเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE317",
                    "ชื่อวิชาภาษาอังกฤษ": "Petrochemical Industry",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "ความรู้เบื้องต้นเกี่ยวกับอุตสาหกรรมปิโตรเคมี": "Fundamental of petrochemical industry",
                        "วัตถุดิบและแหล่งของวัตถุดิบในอุตสาหกรรมปิโตรเคมี": "Raw material and sources",
                        "กระบวนการผลิตและผลิตภัณฑ์ทางด้านปิโตรเคมีที่สำคัญ": {
                            "เอธิลีน": "ethylene",
                            "โพรไพลีน": "propylene",
                            "บิวทะไดอีน": "butadiene",
                            "เบนซิน": "benzene",
                            "โทลูอีน": "toluene",
                            "ไซลีน": "xylenes"
                        }
                    }
                }
            },
            {
                "category": "วคม.318 วิศวกรรมเร่งปฏิกิริยา",
                "subcategories": {
                    "รหัสวิชา": "CHE318",
                    "ชื่อวิชาภาษาอังกฤษ": "Catalytic Engineering",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "ประเภทของตัวเร่งปฏิกิริยา": "Types of catalysts",
                        "หลักการเร่งปฏิกิริยาแบบวิวิธพันธ์": "Concept of heterogeneous catalysis",
                        "เส้นอุณหภูมิคงที่ของการดูดซับ": "Adsorption isotherm",
                        "อัตราเร็วและแบบจําลองทางจลนพลศาสตร์ของการเร่งปฏิกิริยา": "Rate and kinetic model of catalytic reaction",
                        "การเตรียมตัวเร่งปฏิกิริยา": "Catalyst preparation",
                        "การวิเคราะห์คุณลักษณะตัวเร่งปฏิกิริยาและการประเมินความเสี่อม": "Catalyst characterization and deactivation",
                        "การประยุกต์ใช้ตัวเร่งปฏิกิริยา": "Applications of catalysts"
                    }
                }
            },
            {
                "category": "วคม.319 เทคโนโลยีเชื้อเพลิงสะอาด",
                "subcategories": {
                    "รหัสวิชา": "CHE319",
                    "ชื่อวิชาภาษาอังกฤษ": "Clean Fuel Technology",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": "ไม่มีข้อมูลเพิ่มเติม"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 4,
        "details": [
            {
                "category": "หมวดที่ 2 คุณสมบัติผู้เข้าศึกษา",
                "subcategories": {
                    "การรับเข้าศึกษา": {
                        "ตัวเลือก": [
                            "รับเฉพาะนักศึกษาไทย",
                            "รับทั้งนักศึกษาไทยและนักศึกษาต่างชาติ ที่สามารถใช้ภาษาไทยได้ดี",
                            "รับทั้งนักศึกษาไทยและนักศึกษาต่างชาติ"
                        ]
                    },
                    "คุณสมบัติของผู้เข้าศึกษา": "คุณสมบัติของผู้เข้าศึกษาต้องเป็นไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาชั้นปริญญาตรี พ.ศ. 2561 ข้อ 14",
                    "การคัดเลือกผู้เข้าศึกษา": "การคัดเลือกผู้เข้าศึกษาให้เป็นไปตามระเบียบคัดเลือกเพื่อเข้าศึกษาในสถาบันการศึกษาขั้นอุดมศึกษาของส่วนราชการหรือหน่วยงานอื่นดำเนินการตามการมอบหมายของมหาวิทยาลัยหรือตามข้อตกลงหรือ การคัดเลือกตามวิธีการที่มหาวิทยาลัยกำหนดโดยความเห็นชอบของสภามหาวิทยาลัย และออกเป็นประกาศมหาวิทยาลัย",
                    "แผนการรับนักศึกษาและผู้สำเร็จการศึกษาในระยะ 5 ปี": {
                        "จำนวนรับต่อปี": "65 คน",
                        "ตารางแผนการรับนักศึกษา": {
                            "2566": {
                                "ชั้นปีที่ 1": 60,
                                "รวม": 60
                            },
                            "2567": {
                                "ชั้นปีที่ 1": 65,
                                "ชั้นปีที่ 2": 60,
                                "รวม": 125
                            },
                            "2568": {
                                "ชั้นปีที่ 1": 65,
                                "ชั้นปีที่ 2": 65,
                                "ชั้นปีที่ 3": 60,
                                "รวม": 190
                            },
                            "2569": {
                                "ชั้นปีที่ 1": 65,
                                "ชั้นปีที่ 2": 65,
                                "ชั้นปีที่ 3": 65,
                                "ชั้นปีที่ 4": 60,
                                "รวม": 255,
                                "คาดว่าจะจบการศึกษา": 60
                            },
                            "2570": {
                                "ชั้นปีที่ 1": 65,
                                "ชั้นปีที่ 2": 65,
                                "ชั้นปีที่ 3": 65,
                                "ชั้นปีที่ 4": 65,
                                "รวม": 260,
                                "คาดว่าจะจบการศึกษา": 65
                            }
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 15,
        "details": [
            {
                "category": "วิชาบังคับในสาขา",
                "subcategories": {
                    "วคม.373": {
                        "ชื่อไทย": "เศรษฐศาสตร์ทางวิศวกรรมเคมี",
                        "ชื่ออังกฤษ": "Chemical Engineering Economics",
                        "หน่วยกิต": "2 (2-0-4)"
                    },
                    "วคม.374": {
                        "ชื่อไทย": "การจัดการทางวิศวกรรมเคมี",
                        "ชื่ออังกฤษ": "Chemical Engineering management",
                        "หน่วยกิต": "2 (2-0-4)"
                    },
                    "วคม.381": {
                        "ชื่อไทย": "ปฏิบัติการทางวิศวกรรมเคมี 1",
                        "ชื่ออังกฤษ": "Chemical Engineering Laboratory I",
                        "หน่วยกิต": "1 (0-3-0)"
                    },
                    "วคม.382": {
                        "ชื่อไทย": "การฝึกงาน",
                        "ชื่ออังกฤษ": "Industrial Training",
                        "หน่วยกิต": "1",
                        "เงื่อนไข": "ไม่น้อยกว่า 240 ชั่วโมงต่อภาคการศึกษา"
                    },
                    "วคม.461": {
                        "ชื่อไทย": "พลศาสตร์ของกระบวนการและการควบคุม",
                        "ชื่ออังกฤษ": "Process Dynamics and Control",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วคม.474": {
                        "ชื่อไทย": "การออกแบบกระบวนการผลิตและการออกแบบโรงงาน",
                        "ชื่ออังกฤษ": "Chemical Process and Plant Design",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วคม.480": {
                        "ชื่อไทย": "สัมมนาทางวิศวกรรมเคมี",
                        "ชื่ออังกฤษ": "Chemical Engineering Seminar",
                        "หน่วยกิต": "1 (0-3-3)"
                    },
                    "วคม.482": {
                        "ชื่อไทย": "ปฏิบัติการทางวิศวกรรมเคมี 2",
                        "ชื่ออังกฤษ": "Chemical Engineering Laboratory II",
                        "หน่วยกิต": "1 (0-3-3)"
                    }
                }
            },
            {
                "category": "วิชาบังคับนอกสาขา",
                "subcategories": {
                    "วย.202": {
                        "ชื่อไทย": "กลศาสตร์วิศวกรรม - สถิตยศาสตร์",
                        "ชื่ออังกฤษ": "Engineering Mechanics – Statics",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วอ.261": {
                        "ชื่อไทย": "สถิติวิศวกรรม",
                        "ชื่ออังกฤษ": "Engineering Statistics",
                        "หน่วยกิต": "3 (3-0-6)"
                    }
                }
            },
            {
                "category": "กลุ่มวิชาเลือกทางวิศวกรรมเคมี",
                "subcategories": {
                    "จำนวนหน่วยกิต": "15 หน่วยกิต",
                    "รูปแบบที่_1": {
                        "ชื่อ": "เน้นการวิจัย",
                        "วิชา": {
                            "วคม.496": {
                                "ชื่อไทย": "การวิจัยระดับปริญญาตรี 1",
                                "ชื่ออังกฤษ": "Research for Undergraduates I",
                                "หน่วยกิต": "3 (0-9-6)"
                            },
                            "วคม.497": {
                                "ชื่อไทย": "การวิจัยระดับปริญญาตรี 2",
                                "ชื่ออังกฤษ": "Research for Undergraduates II",
                                "หน่วยกิต": "3 (0-9-6)"
                            }
                        },
                        "เงื่อนไข": "เลือกศึกษาวิชาเลือกในสาขาวิศวกรรมเคมี จำนวนไม่น้อยกว่า 9 หน่วยกิต"
                    },
                    "รูปแบบที่_2": {
                        "ชื่อ": "การฝึกงานในวิชาชีพวิศวกรรมเคมีระยะยาว",
                        "วิชา": {
                            "วคม.596": {
                                "ชื่อไทย": "การเตรียมฝึกงานในวิชาชีพวิศวกรรมเคมีระยะยาว",
                                "ชื่ออังกฤษ": "Preparation for Long-term internship in Chemical Engineering",
                                "หน่วยกิต": "3 (0-9-6)"
                            }
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 66,
        "details": [
            {
                "category": "วคม.270 กระบวนการทางวิศวกรรมเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE270",
                    "ชื่อภาษาอังกฤษ": "Chemical Process Engineering",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "กระบวนการทางวิศวกรรมเคมีในโรงงานอุตสาหกรรม": [
                            "วัตถุดิบ",
                            "พลังงาน",
                            "หน่วยปฏิบัติการที่ใช้ในโรงงาน",
                            "ความปลอดภัยในโรงงาน",
                            "ผลกระทบของโรงงานต่อสิ่งแวดล้อม"
                        ],
                        "แผนภาพ": [
                            "แผนภาพกระบวนการ",
                            "ความรู้พื้นฐานเกี่ยวกับแผนภาพอุปกรณ์ในกระบวนการ"
                        ]
                    },
                    "Topics_in_English": [
                        "Various kinds of chemical processes",
                        "Raw materials",
                        "Energy supplies",
                        "Types of unit operations",
                        "Plant safety",
                        "Environmental implications in processes"
                    ]
                }
            },
            {
                "category": "วคม.281 การจำลองกระบวนการวิศวกรรมเคมีพื้นฐาน",
                "subcategories": {
                    "รหัสวิชา": "CHE281",
                    "ชื่อภาษาอังกฤษ": "Basic chemical process simulation",
                    "หน่วยกิต": "1 (0-3-0)",
                    "เนื้อหา": {
                        "พื้นฐาน": [
                            "การประเมินคุณสมบัติเทอร์โมเคมีของสารในสายการผลิต",
                            "จำลองการทำงานของอุปกรณ์ในอุตสาหกรรมเคมี"
                        ],
                        "ตัวอย่างอุตสาหกรรม": [
                            "อุตสาหกรรมปิโตรเคมี",
                            "อุตสาหกรรมชีวภาพ"
                        ]
                    },
                    "Topics_in_English": [
                        "Basic estimation of thermochemical properties of chemicals",
                        "Apply all unit operations for petrochemical and bioprocess industrials"
                    ]
                }
            },
            {
                "category": "วคม.375 การออกแบบผลิตภัณฑ์เคมีและการพัฒนากระบวนการ",
                "subcategories": {
                    "รหัสวิชา": "CHE375",
                    "ชื่อภาษาอังกฤษ": "Chemical Product Design and Process Revamping",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "บทนำ": [
                            "การออกแบบกระบวนการและผลิตภัณฑ์",
                            "ชนิดของผลิตภัณฑ์เคมี"
                        ],
                        "ขั้นตอนการออกแบบผลิตภัณฑ์": [
                            "ความเข้าใจความต้องการของลูกค้า",
                            "การระดมแนวคิด",
                            "เทคนิคที่ใช้ในการคัดเลือกแนวคิด",
                            "การเลือกแบบผลิตภัณฑ์",
                            "เกณฑ์การเลือก",
                            "ความเสี่ยงจากการเลือกผลิตภัณฑ์",
                            "การผลิต",
                            "การคำนวณค่าใช้จ่าย"
                        ],
                        "การพัฒนากระบวนการ": [
                            "ประเมินกระบวนการที่ทำงานอยู่",
                            "การเปลี่ยนแปลงและแก้ไข",
                            "พัฒนาประสิทธิภาพการใช้วัตถุดิบและสาธารณูปโภค",
                            "ความเข้าใจในการทำงานที่ถูกสุขลักษณะและปลอดภัย"
                        ],
                        "การประยุกต์": "อุตสาหกรรมจริงเป็นตัวอย่างประกอบ"
                    },
                    "Topics_in_English": [
                        "Introduction to process and product design",
                        "Types of chemical products",
                        "Product design steps",
                        "Understanding needs of customers",
                        "Ideas generation",
                        "Techniques used to screen ideas",
                        "Design selection",
                        "Less objective criteria",
                        "Risks of product selection",
                        "Product manufacture and cost estimation",
                        "Evaluation of existing process",
                        "Retrofitting the process",
                        "Working conditions with good health and safety practice",
                        "Practice with industrial cases"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 7,
        "details": [
            {
                "category": "หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี",
                "subcategories": {
                    "ลักษณะหลักสูตร": "หลักสูตรที่ผสมผสานทั้งด้านนวัตกรรมและเทคโนโลยี เพื่อสร้างโอกาสและเปิดโอกาสให้บัณฑิตทำงานที่หลากหลาย และพร้อมต่อยอดได้ในอนาคต",
                    "ปรัชญา": "ผลิตวิศวกรเคมีที่มีความรู้ ทักษะ และความสามารถในการเรียนรู้ การคิด วิเคราะห์ปัญหาการเรียนรู้เทคโนโลยีใหม่ โดยมีวิศวกรเคมีเป็นประชากรกลุ่มเป้าหมาย ตลอดจนมีจรรยาบรรณในการประกอบวิชาชีพและสามารถพัฒนาความรู้ได้อย่างต่อเนื่อง"
                }
            },
            {
                "category": "วัตถุประสงค์ของหลักสูตร",
                "subcategories": {
                    "คุณธรรมและจริยธรรม": "มีคุณธรรม จริยธรรม และจรรยาบรรณทางวิชาชีพ",
                    "ความรู้": "มีความรู้พื้นฐานทางวิศวกรรมเคมีอย่างดีเยี่ยมและสามารถนำไปประยุกต์ใช้งานได้อย่างเหมาะสม",
                    "ทักษะปฏิบัติ": "มีทักษะในการทำปฏิบัติการทางวิศวกรรมเคมีอย่างดีเยี่ยม",
                    "การวิจัย": "สามารถนำเอาความรู้และทักษะที่มีไปพัฒนาเป็นงานวิจัยที่เป็นประโยชน์ต่อสังคมในระดับสากลได้",
                    "การสื่อสาร": "มีความสามารถในการสื่อสารได้อย่างมีประสิทธิภาพทั้งภาษาไทยและภาษาอังกฤษ รวมถึงการสื่อสารทางวิชาการทางวิศวกรรมเคมี เป็นอย่างดีเยี่ยม",
                    "การนำเสนอ": "มีความสามารถในการนำเสนอผลงานได้อย่างมีประสิทธิภาพทั้งภาษาไทยและภาษาอังกฤษ",
                    "คุณลักษณะผู้นำ": "มีคุณลักษณะของผู้นำในศตวรรษที่ 21 ที่ประกอบด้วย GREATS: Global mindset, Responsibility, Eloquence, Aesthetic appreciation, Team playing, Spirit of Thammasat"
                }
            },
            {
                "category": "ผลลัพธ์การเรียนรู้ของหลักสูตร (PLOs)",
                "subcategories": {
                    "ด้านความรู้ (Knowledge)": {
                        "K1": "ผู้เรียนสามารถจัดการปัญหาทางด้านวิศวกรรมเคมีได้ ด้วยการเลือกสรรวิธีการที่เหมาะสมโดยบูรณาการหลักการทางวิศวกรรมศาสตร์ วิทยาศาสตร์ และคณิตศาสตร์พื้นฐาน ต่อยอดความรู้ และปรับใช้ความรู้เพื่อการพัฒนางาน"
                    },
                    "ด้านทักษะ (Skills)": {
                        "S1": "ผู้เรียนมีทักษะในการสื่อสารได้อย่างมีประสิทธิภาพทั้งด้วยภาษาทั่วไปและภาษาวิชาการ โดยเน้นความสามารถในการสื่อสารโดยใช้ภาษาอังกฤษด้วย",
                        "S2": "ผู้เรียนมีทักษะในการทำปฏิบัติการทางเคมีและวิศวกรรมเคมี"
                    },
                    "ด้านจริยธรรม (Ethics)": {
                        "E1": "ผู้เรียนมีคุณธรรม จริยธรรม และจรรยาบรรณทางวิชาชีพ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 31,
        "details": [
            {
                "category": "วิชาเฉพาะ",
                "subcategories": {
                    "วิชาเฉพาะพื้นฐาน": {
                        "กลุ่มวิชาพื้นฐานทางคณิตศาสตร์และวิทยาศาสตร์": [
                            {
                                "รหัสวิชา": "ค.111",
                                "ชื่อวิชา": "แคลคูลัสพื้นฐาน",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อภาษาอังกฤษ": "MA111 Fundamentals of Calculus",
                                "คำอธิบายรายวิชา": "อุปนัยเชิงคณิตศาสตร์ ระบบจำนวนและฟังก์ชันเบื้องต้น แคลคูลัสอนุพันธ์และปริพันธ์ของฟังก์ชันตัวแปรเดียว ลิมิตความต่อเนื่อง อนุพันธ์ และการประยุกต์อนุพันธ์ ปฏิยานุพันธ์ เทคนิคการหาปริพันธ์และการประยุกต์ปริพันธ์ ปริพันธ์ไม่ตรงแบบ อนุกรม ทฤษฎีบทเทย์เลอร์สำหรับฟังก์ชันพื้นฐาน การหาปริพันธ์เชิงตัวเลข",
                                "หมายเหตุ": "ไม่นับหน่วยกิตให้ผู้ที่กำลังศึกษาหรือสอบได้ ค.211 หรือ ค.216 หรือ ค.218 หรือ คป.101",
                                "คำอธิบายภาษาอังกฤษ": "Mathematical induction, number systems and elementary functions, calculus of one variable functions, limit, continuity, the derivative and its applications, antiderivatives, techniques of integrations and its applications, improper integrals, series, Taylor's Theorem for basic functions, numerical integration.",
                                "หมายเหตุภาษาอังกฤษ": "No credits for students who are currently taking or have earned credits of MA211 or MA216 or MA218 or AM101."
                            },
                            {
                                "รหัสวิชา": "ค.112",
                                "ชื่อวิชา": "เรขาคณิตวิเคราะห์และแคลคูลัสประยุกต์",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อภาษาอังกฤษ": "MA112 Analytic Geometry and Applied Calculus",
                                "วิชาบังคับก่อน": "สอบได้ ค.111",
                                "คำอธิบายรายวิชา": "เรขาคณิตวิเคราะห์ พิกัดเชิงขั้ว พีชคณิตของเวกเตอร์ในปริภูมิสามมิติ เส้น ระนาบและผิวในปริภูมิสามมิติ ลิมิต ความต่อเนื่อง อนุพันธ์และปริพันธ์ของฟังก์ชันค่าเวกเตอร์ แคลคูลัสของฟังก์ชันค่าจริงหลายตัวแปรและการประยุกต์ ปริพันธ์ตามเส้นเบื้องต้น ปริพันธ์ตามผิว ทฤษฎีบทของเกาส์ ทฤษฎีบทของกรีนและสโตกส์",
                                "คำอธิบายภาษาอังกฤษ": "Analytic geometry, polar coordinates, vector algebra in three dimensional spaces, lines, planes and surfaces in three dimensional spaces, limit, continuity, derivatives and integrals of vector valued functions, calculus of real-valued functions of several variables and their applications, introduction to line integrals, surface integrals, Gauss's Theorem, Green's Theorem and Stokes' Theorem.",
                                "วิชาบังคับก่อนภาษาอังกฤษ": "Prerequisite: Have earned credits of MA111"
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 34,
        "details": [
            {
                "category": "กลุ่มวิชาพื้นฐานทางวิศวกรรม",
                "subcategories": {
                    "วก.100 กราฟิกวิศวกรรม": {
                        "รหัสวิชา": "วก.100",
                        "ชื่อวิชา": "กราฟิกวิศวกรรม",
                        "หน่วยกิต": "3 (2-3-4)",
                        "คำอธิบายรายวิชา": "ความสำคัญของการเขียนแบบ มาตรฐานการเขียนแบบ เครื่องมือและวิธีใช้ การเขียนเส้นและตัวอักษร การเขียนแบบรูปร่างเรขาคณิต การระบุขนาดและพิกัดความเผื่อ การเขียนแบบภาพฉาย การเขียนแบบสามมิติ การเขียนภาพด้วยมือเปล่าและทักษะการมองภาพ การเขียนภาพตัดและภาพช่วย การเขียนแบบรายละเอียดและการเขียนแบบงาน การอ่านแบบทางวิศวกรรม การใช้คอมพิวเตอร์สำหรับช่วยงานเขียนแบบ",
                        "คำอธิบายภาษาอังกฤษ": "The significance of drawing. Instruments and their uses. Lining and lettering. Work preparation. Applied geometry. Dimensioning and tolerancing. Orthographic drawing. Pictorial drawing. Freehand sketching. Sections and auxiliary views. Basic Writing and Reading drawing. Computer aided drawing."
                    },
                    "วศว.100 จริยธรรมสำหรับวิศวกร": {
                        "รหัสวิชา": "วศว.100",
                        "ชื่อวิชา": "จริยธรรมสำหรับวิศวกร",
                        "หน่วยกิต": "0 (0-0-0)",
                        "คำอธิบายรายวิชา": "จรรยาบรรณวิศวกรรม ผลกระทบของเทคโนโลยีต่อสังคม ปัญหาและประเด็นทางด้านจริยธรรมและคุณธรรม แนวทางแก้ไขตลอดจนการป้องกัน เพื่อไม่ให้เกิดกรณีดังกล่าวกับลักษณะงานทางวิศวกรรมด้านต่าง ๆ การเข้าร่วมโครงการอบรมจริยธรรม เพื่อพัฒนาคุณธรรมและจริยธรรม วัดผลเป็นระดับ S หรือ U (เข้าร่วมกิจกรรมกับที่ทางคณะวิศวกรรมศาสตร์จัดขึ้น)",
                        "คำอธิบายภาษาอังกฤษ": "Ethical issues relevant to the engineering profession. Potential impact of technoloty transfers and implementation with respect to society and its members. Potential problems that may arise are studied along with possible ways to prevent them from occurring and ways to deal with them once they occur. Grading is in S or U."
                    },
                    "วศว.101 เทคโนโลยีสารสนเทศสมัยใหม่เบื้องต้น": {
                        "รหัสวิชา": "วศว.101",
                        "ชื่อวิชา": "เทคโนโลยีสารสนเทศสมัยใหม่เบื้องต้น",
                        "หน่วยกิต": "1 (1-0-2)",
                        "คำอธิบายรายวิชา": "แนะนำเทคโนโลยีทางด้านวิทยาการข้อมูล วิศวกรรมข้อมูล ปัญญาประดิษฐ์ รวมถึงเทคโนโลยีทางคอมพิวเตอร์ล้ำสมัย เช่น เงินตราเข้ารหัสลับ (Crypto currency), บล็อกเชน (Blockchain), การคำนวณควอนตัม (Quantum computing), ฝาแฝดดิจิทัล (Digital twin), ความเป็นจริงเสริม(Augmented reality) เพื่อให้นักศึกษามีความเข้าใจถึงโครงสร้างนวัตกรรมทางวิศวกรรมอัจฉริยะพร้อมสำหรับยุคเมตาเวิร์ส (Metaverse)"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 37,
        "details": [
            {
                "category": "วคม.205 สมดุลมวลสารและพลังงาน",
                "subcategories": {
                    "รหัสวิชา": "CHE205",
                    "ชื่อวิชาภาษาอังกฤษ": "Material and Energy Balances",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหาวิชา": {
                        "ความรู้เบื้องต้น": [
                            "หน่วยปฏิบัติการที่สำคัญ",
                            "แผนภูมิและผังกระบวนการเบื้องต้น",
                            "การหาและการคำนวณข้อมูลพื้นฐานสำหรับสมดุลมวลสารและพลังงาน"
                        ],
                        "การคำนวณสมดุลมวลสาร": [
                            "กระบวนการที่มีปฏิกิริยาเคมี",
                            "กระบวนการที่ไม่มีปฏิกิริยาเคมี"
                        ],
                        "การบูรณาการ": "หลักการสมดุลมวลสารและพลังงานในกระบวนการทางวิศวกรรมเคมี"
                    }
                }
            },
            {
                "category": "วคม.213 เธอร์โมไดนามิกส์สาหรับวิศวกรรมเคมี 1",
                "subcategories": {
                    "รหัสวิชา": "CHE213",
                    "ชื่อวิชาภาษาอังกฤษ": "Chemical Engineering Thermodynamics I",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหาวิชา": {
                        "กฎข้อที่หนึ่งทางเธอร์โมไดนามิกส์": [
                            "ระบบปิด",
                            "ลักษณะของแก๊สในอุดมคติ",
                            "พฤติกรรมและคุณสมบัติของสารบริสุทธิ์",
                            "สมการสภาวะสำหรับแก๊สอุดมคติและแก๊สจริง",
                            "การประยุกต์ใช้ในระบบเปิด (หัวฉีด, ดิฟฟิวเซอร์, คอมเพรสเซอร์, เทอร์ไบน์, เครื่องแลกเปลี่ยนความร้อน)"
                        ],
                        "กฎข้อที่สองทางเธอร์โมไดนามิกส์": [
                            "เอนโทรปี",
                            "วัฏจักรคาร์โนต์",
                            "ระบบทำความร้อน",
                            "ระบบทำความเย็น"
                        ]
                    }
                }
            },
            {
                "category": "วคม.233 กลศาสตร์ของไหลสำหรับวิศวกรเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE233",
                    "ชื่อวิชาภาษาอังกฤษ": "Fluid Mechanics for Chemical Engineers",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ ค.111",
                    "เนื้อหาวิชา": {
                        "พื้นฐาน": [
                            "สมบัติของของไหล",
                            "สมการอนุพันธ์สำหรับกลศาสตร์ของไหล",
                            "การไหลของของไหลในพิกัดรูปแบบต่าง ๆ"
                        ],
                        "สมดุล": [
                            "สมดุลมวล",
                            "สมดุลพลังงาน",
                            "สมดุลโมเมนตัม"
                        ],
                        "การไหลในท่อ": [
                            "สมการเบอร์นูลลี",
                            "ลักษณะการไหลและการสูญเสียพลังงานในลักษณะต่าง ๆ",
                            "ท่อที่มีหน้าตัดในรูปแบบต่าง ๆ"
                        ],
                        "หัวข้ออื่น ๆ": [
                            "สถิตยศาสตร์ของไหล",
                            "เครื่องมือวัดอัตราการไหล",
                            "ปั๊มและเครื่องอัดอากาศ",
                            "การไหลผ่านวัตถุจม",
                            "การไหลผ่านตัวกลางที่มีรูพรุน",
                            "การกวน",
                            "การปั่นแยก",
                            "การตกตะกอน",
                            "ฟลูอิไดเซชัน",
                            "การกรอง"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 46,
        "details": [
            {
                "category": "การออกแบบกระบวนการทางเคมี",
                "subcategories": {
                    "การหาข้อมูลและการประมาณค่า": "การหาข้อมูลและการประมาณค่าคุณสมบัติต่าง ๆ ที่ใช้ในการออกแบบกระบวนการทางเคมี",
                    "การเขียนผังกระบวนการ": "การเขียนผังกระบวนการทางเคมีแบบต่าง ๆ",
                    "การคำนวณสมดุล": "การคำนวณสมดุลมวลสารและพลังงานในกระบวนการทางเคมี",
                    "การออกแบบและเลือกใช้อุปกรณ์": "การออกแบบและการเลือกใช้อุปกรณ์ต่าง ๆ ในกระบวนการทางเคมี",
                    "การจำลองกระบวนการ": "การจำลองกระบวนการทางเคมี",
                    "การออกแบบโรงงาน": "การออกแบบโรงงานอุตสาหกรรมทางเคมีโดยคำนึงถึงความปลอดภัยและสิ่งแวดล้อม",
                    "การประเมินมูลค่า": "การประเมินมูลค่าและความคุ้มทุนของกระบวนการและโรงงานอุตสาหกรรมทางเคมี"
                }
            },
            {
                "category": "วคม.480 สัมมนาทางวิศวกรรมเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE480",
                    "ชื่อภาษาอังกฤษ": "Chemical Engineering Seminar",
                    "หน่วยกิต": "1 (0-3-3)",
                    "วิชาบังคับก่อน": "เคยเรียนวิชาบังคับเฉพาะสาขาวิชาวิศวกรรมเคมีตามโครงสร้างหลักสูตรที่กำหนดไว้ ไม่น้อยกว่า 43 หน่วยกิต",
                    "คำอธิบายรายวิชา": "การค้นคว้าเรื่องที่น่าสนใจทางวิศวกรรมเคมี พร้อมทั้งการนำเสนอรายงานต่อที่ประชุม โดยเน้นการใช้ภาษาไทยและภาษาอังกฤษที่ถูกต้อง และการเขียนรายงาน ตลอดจนการใช้ข้อมูลทางวิศวกรรมเคมีที่ได้ศึกษามาแล้วในระดับชั้นปี 1-3"
                }
            },
            {
                "category": "วคม.482 ปฏิบัติการทางวิศวกรรมเคมี 2",
                "subcategories": {
                    "รหัสวิชา": "CHE482",
                    "ชื่อภาษาอังกฤษ": "Chemical Engineering Laboratory II",
                    "หน่วยกิต": "1 (0-3-3)",
                    "วิชาบังคับก่อน": "สอบได้ วคม.335"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 23,
        "details": [
            {
                "category": "เลือกเรียนรูปแบบที่ 2 สหกิจศึกษา",
                "subcategories": {
                    "ปีการศึกษาที่ 4": {
                        "ภาคเรียนที่ 1": {
                            "รายวิชา": [
                                {
                                    "รหัสวิชา": "มธ.102",
                                    "ชื่อวิชา": "ชีวิตกับสุนทรียภาพ",
                                    "หน่วยกิต": 3
                                },
                                {
                                    "รหัสวิชา": "มธ.106",
                                    "ชื่อวิชา": "ความคิดสร้างสรรค์และการสื่อสาร",
                                    "หน่วยกิต": 3
                                },
                                {
                                    "รหัสวิชา": "วคม.461",
                                    "ชื่อวิชา": "พลศาสตร์ของกระบวนการและการควบคุม",
                                    "หน่วยกิต": 3
                                },
                                {
                                    "รหัสวิชา": "วคม.474",
                                    "ชื่อวิชา": "การออกแบบกระบวนการผลิตและการออกแบบโรงงาน",
                                    "หน่วยกิต": 3
                                },
                                {
                                    "รหัสวิชา": "วคม.480",
                                    "ชื่อวิชา": "สัมมนาทางวิศวกรรมเคมี",
                                    "หน่วยกิต": 1
                                },
                                {
                                    "รหัสวิชา": "วคม.482",
                                    "ชื่อวิชา": "ปฏิบัติการทางวิศวกรรมเคมี 2",
                                    "หน่วยกิต": 1
                                },
                                {
                                    "รหัสวิชา": "วคม.596",
                                    "ชื่อวิชา": "การเตรียมฝึกงานในวิชาชีพวิศวกรรมเคมีระยะยาว",
                                    "หน่วยกิต": 3
                                },
                                {
                                    "รหัสวิชา": "วคม.xxx",
                                    "ชื่อวิชา": "วิชาเลือก",
                                    "หน่วยกิต": 3
                                }
                            ],
                            "รวมหน่วยกิต": 17
                        },
                        "ภาคเรียนที่ 2": {
                            "รายวิชา": [
                                {
                                    "รหัสวิชา": "วคม.597",
                                    "ชื่อวิชา": "การฝึกงานในวิชาชีพวิศวกรรมเคมีระยะยาว",
                                    "หน่วยกิต": 6
                                }
                            ],
                            "รวมหน่วยกิต": 6
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 60,
        "details": [
            {
                "category": "วคม.456 การใช้งานแอสเปนพลัสเพื่อการจำลองกระบวนการ",
                "subcategories": {
                    "ชื่อวิชาภาษาอังกฤษ": "CHE456 Applications of Aspen Plus in process simulation",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "การใช้ปรแกรม แอสเปนพลัส ในการวิเคราะห์อุปกรณ์และกระบวนการทางวิศวกรรมเคมี",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Using Aspen plus simulation software to analyze equipment and processes in chemical engineering."
                }
            },
            {
                "category": "วคม.476 การประยุกต์วิศวกรรมเคมีในกระบวนการแปรรูปอาหาร",
                "subcategories": {
                    "ชื่อวิชาภาษาอังกฤษ": "CHE476 Chemical Engineering Applications in Food Processing",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "กระบวนการทางวิศวกรรมเคมีที่ใช้ในการถนอมอาหาร หลักการถนอมอาหารด้วยวิธีต่าง ๆ การหมักและการใช้เอนไซม์ การถนอมอาหารแบบไม่ใช้ความร้อน หลักการพาสเจอร์ไรเซชั่น สเตอร์รีไรเซชั่น ultra high pressure การใช้ไฟฟ้าแบบ pulse ระบบการทำความเย็น การแช่แข็งอาหาร การบรรจุอาหาร รวมไปถึงการพัฒนากระบวนการถนอมอาหาร",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Applying fundamental Chemical Engineering knowledges to understand and develop food preservation process. Fluid flow, mass balance, energy balance, thermo-dynamics, heat transfer, instrumental design and control system in food processing. Introduction of food preservation processes including thermal process, non-thermal process, refrigeration system, freezing process, drying or dehydration system, packaging concept, and innovative technologies."
                }
            },
            {
                "category": "วคม.477 การออกแบบกระบวนการเคมีในอุตสาหกรรมปิโตรเคมี 2",
                "subcategories": {
                    "ชื่อวิชาภาษาอังกฤษ": "CHE477 Chemical Process Design in Petrochemical Industry II",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วคม.377",
                    "คำอธิบายรายวิชาภาษาไทย": "การเรียนแบบ Problem-based ในอุตสาหกรรมปิโตรเคมีขั้นกลาง ซึ่งจะมีระบบเครื่องปฏิกรณ์และเครื่องแลกเปลี่ยนความร้อนและการแยกบริสุทธิ์ โดยปฏิบัติตามข้อกำหนดทางกฎหมายโรงงาน สิ่งแวดล้อม และความปลอดภัย การเรียนจะควบคู่ไปกับการจำลองกระบวนการและการกำหนดผังโรงงาน",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Prerequisite: Have earned credits of CHE377"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 6,
        "details": [
            {
                "category": "สถานการณ์หรือการพัฒนาทางสังคมและวัฒนธรรม",
                "subcategories": {
                    "ประเทศไทยเข้าสู่สังคมสูงวัย": "คาดว่าจะเข้าสู่การเป็นสังคมสูงวัยระดับสุดยอดในปี พ.ศ. 2574",
                    "โอกาสใหม่": "การตอบสนองความต้องการของกลุ่มผู้บริโภคสูงอายุที่จะมีสัดส่วนเพิ่มขึ้นอย่างต่อเนื่อง",
                    "การเปลี่ยนแปลงของครอบครัวไทย": "ครอบครัวไทยจะมีขนาดเล็กลงและมีรูปแบบที่หลากหลายมากขึ้น",
                    "ความหลากหลายของช่วงอายุ": "ประชากรในประเทศไทยจะมีช่วงอายุที่แตกต่างกันและจะมีกลุ่มคนช่วงอายุใหม่ ๆ เพิ่มขึ้น",
                    "ผลกระทบ": "ส่งผลต่อทัศนคติและพฤติกรรมที่แตกต่างกัน",
                    "ความท้าทาย": "การเตรียมความพร้อมของวิศวกรเคมีแห่งอนาคตให้มีคุณภาพและเข้าใจบริบททางสังคมและวัฒนธรรมที่เปลี่ยนไป"
                }
            },
            {
                "category": "การพัฒนาหลักสูตร",
                "subcategories": {
                    "หลักสูตรที่พัฒนา": "วิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี (หลักสูตรปรับปรุง พ.ศ. 2566)",
                    "แนวทางการพัฒนา": [
                        "ปรับโครงสร้างหลักสูตร",
                        "ปรับปรุงเนื้อหารายวิชาหลักเดิม",
                        "พัฒนารายวิชาหลักและวิชาเลือกใหม่",
                        "เพิ่มเติมรายวิชาที่พัฒนาทักษะในการใช้ชีวิตในศตวรรษที่ 21"
                    ],
                    "เป้าหมาย": "ให้บัณฑิตที่จบการศึกษามีความรู้พื้นฐานที่ครบถ้วนและมีทักษะเสริมที่จำเป็นต่อการประกอบวิชาชีพในอนาคต",
                    "ตัวอย่างวิชา": [
                        "วิชาการประยุกต์วิศวกรรมเคมีในกระบวนการนำส่งยา",
                        "วิชาการพัฒนาเครื่องสำอางและกระบวนการผลิต",
                        "วิชาเทคโนโลยีเชื้อเพลิงสะอาด",
                        "วิชาวิศวกรรมกระบวนการทางชีวภาพ"
                    ]
                }
            },
            {
                "category": "ความเกี่ยวข้องกับพันธกิจของสถาบัน",
                "subcategories": {
                    "พันธกิจของมหาวิทยาลัยธรรมศาสตร์": "ตาม พ.ร.บ. มหาวิทยาลัยธรรมศาสตร์ในกำกับของรัฐ พ.ศ. 2558 มาตรา 7",
                    "วัตถุประสงค์": [
                        "ให้การศึกษา",
                        "ส่งเสริมวิชาการและวิชาชีพชั้นสูง",
                        "ทำการสอน",
                        "ทำการวิจัย",
                        "ให้บริการทางวิชาการแก่สังคม",
                        "ส่งเสริมและพัฒนาประชาธิปไทย ศีลธรรม ศิลปะและวัฒนธรรม ภูมิปัญญาไทย วิทยาศาสตร์ เทคโนโลยี และสิ่งแวดล้อม"
                    ],
                    "ค่านิยมองค์กร": "เป็นเลิศ เป็นธรรม ร่วมนำสังคม",
                    "ยุทธศาสตร์": {
                        "สร้าง": [
                            "บัณฑิตที่มีคุณลักษณะ GREATS ทักษะผู้ประกอบการ และ 3 ภาษา",
                            "สรรค์งานวิจัยและนวัตกรรมเชิงพัฒนาต่อสังคมและโลก",
                            "เครือข่ายความร่วมมือในและต่างประเทศ"
                        ],
                        "มุ่ง": [
                            "เน้นคุณภาพการให้บริการทางวิชาการ และบริการสุขภาพแก่ชุมชนและสังคม",
                            "สู่ความมั่นคงและยั่งยืนด้วยการจัดการที่ทันสมัย"
                        ]
                    },
                    "เป้าหมายการปรับปรุงหลักสูตร": "สร้างบัณฑิตที่มีคุณลักษณะผู้นำในศตวรรษที่ 21 GREATS: Global mindset, Responsibility, Eloquence, Aesthetic appreciation, Team playing"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 32,
        "details": [
            {
                "category": "ค.214 สมการเชิงอนุพันธ์",
                "subcategories": {
                    "รหัสวิชา": "ค.214",
                    "ชื่อวิชาภาษาไทย": "สมการเชิงอนุพันธ์",
                    "ชื่อวิชาภาษาอังกฤษ": "MA214 Differential Equations",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ ค.112 หรือ ค.219",
                    "เนื้อหา": {
                        "สมการเชิงอนุพันธ์อันดับหนึ่ง": "รายละเอียดไม่ได้ระบุ",
                        "สมการเชิงอนุพันธ์อันดับสอง": "รายละเอียดไม่ได้ระบุ",
                        "สมการเชิงอนุพันธ์เชิงเส้นเอกพันธ์": "รายละเอียดไม่ได้ระบุ",
                        "สมการเชิงอนุพันธ์เชิงเส้นไม่เอกพันธ์": "รายละเอียดไม่ได้ระบุ",
                        "สมการเชิงอนุพันธ์อันดับสูง": "รายละเอียดไม่ได้ระบุ",
                        "ผลเฉลยในรูปอนุกรมของสมการเชิงอนุพันธ์เชิงเส้น": "รายละเอียดไม่ได้ระบุ",
                        "ฟังก์ชันพิเศษ": "รายละเอียดไม่ได้ระบุ",
                        "สมการเชิงอนุพันธ์ย่อย": "รายละเอียดไม่ได้ระบุ",
                        "การแปลงลาปลาซ": "รายละเอียดไม่ได้ระบุ",
                        "สมการเชิงอนุพันธ์สามัญไม่เชิงเส้นเบื้องต้น": "รายละเอียดไม่ได้ระบุ",
                        "การประยุกต์ในการแก้ปัญหาทางวิศวกรรม": "รายละเอียดไม่ได้ระบุ"
                    }
                }
            },
            {
                "category": "วท.133 ฟิสิกส์สำหรับวิศวกร 1",
                "subcategories": {
                    "รหัสวิชา": "วท.133",
                    "ชื่อวิชาภาษาไทย": "ฟิสิกส์สำหรับวิศวกร 1",
                    "ชื่อวิชาภาษาอังกฤษ": "SC133 Physics for Engineers I",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "การเคลื่อนที่": "รายละเอียดไม่ได้ระบุ",
                        "แรง": "รายละเอียดไม่ได้ระบุ",
                        "ความโน้มถ่วง": "รายละเอียดไม่ได้ระบุ",
                        "งานและพลังงาน": "รายละเอียดไม่ได้ระบุ",
                        "การชน": "รายละเอียดไม่ได้ระบุ",
                        "การเคลื่อนที่แบบหมุน": "รายละเอียดไม่ได้ระบุ",
                        "วัตถุในสภาพสมดุล": "รายละเอียดไม่ได้ระบุ",
                        "ความยืดหยุ่นและการแตกร้าว": "รายละเอียดไม่ได้ระบุ",
                        "ของไหล": "รายละเอียดไม่ได้ระบุ",
                        "การสั่นและคลื่น": "รายละเอียดไม่ได้ระบุ",
                        "เสียงและการประยุกต์": "รายละเอียดไม่ได้ระบุ",
                        "ความร้อนและทฤษฎีจลน์ของก๊าซ": "รายละเอียดไม่ได้ระบุ",
                        "กฎข้อ 1 และ 2 ของอุณหพลศาสตร์": "รายละเอียดไม่ได้ระบุ"
                    }
                }
            },
            {
                "category": "วท.134 ฟิสิกส์สำหรับวิศวกร 2",
                "subcategories": {
                    "รหัสวิชา": "วท.134",
                    "ชื่อวิชาภาษาไทย": "ฟิสิกส์สำหรับวิศวกร 2",
                    "ชื่อวิชาภาษาอังกฤษ": "SC134 Physics for Engineers II",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วท.133",
                    "เนื้อหา": {
                        "ประจุไฟฟ้าและสนามไฟฟ้า": "รายละเอียดไม่ได้ระบุ",
                        "กฎของเกาส์": "รายละเอียดไม่ได้ระบุ",
                        "ศักย์ไฟฟ้า": "รายละเอียดไม่ได้ระบุ",
                        "ความจุไฟฟ้า": "รายละเอียดไม่ได้ระบุ",
                        "ไดอิเล็กตริก": "รายละเอียดไม่ได้ระบุ",
                        "กระแสไฟฟ้า": "รายละเอียดไม่ได้ระบุ",
                        "วงจรไฟฟ้ากระแสตรงและอุปกรณ์": "รายละเอียดไม่ได้ระบุ",
                        "แม่เหล็กและแม่เหล็กไฟฟ้า": "รายละเอียดไม่ได้ระบุ",
                        "การเหนียวนำแม่เหล็กและกฎของฟาราเดย์": "รายละเอียดไม่ได้ระบุ",
                        "ตัวเหนี่ยวนำ": "รายละเอียดไม่ได้ระบุ",
                        "วงจรไฟฟ้ากระแสสลับ": "รายละเอียดไม่ได้ระบุ",
                        "ทฤษฎีคลื่นแม่เหล็กไฟฟ้าและการประยุกต์": "รายละเอียดไม่ได้ระบุ",
                        "แสง": "รายละเอียดไม่ได้ระบุ",
                        "เลนส์และทัศนอุปกรณ์": "รายละเอียดไม่ได้ระบุ",
                        "การสะท้อน": "รายละเอียดไม่ได้ระบุ",
                        "การหักเห": "รายละเอียดไม่ได้ระบุ",
                        "การเลี้ยวเบน": "รายละเอียดไม่ได้ระบุ",
                        "การแทรกสอดและโพลาไรเซชัน": "รายละเอียดไม่ได้ระบุ",
                        "ฟิสิกส์แผนใหม่": "รายละเอียดไม่ได้ระบุ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 13,
        "details": [
            {
                "category": "วิชาพื้นฐานทางคณิตศาสตร์และวิทยาศาสตร์",
                "subcategories": {
                    "วท.133": "ฟิสิกส์สำหรับวิศวกร 1",
                    "SC133": "Physics for Engineers I",
                    "วท.134": "ฟิสิกส์สำหรับวิศวกร 2",
                    "SC134": "Physics for Engineers II",
                    "วท.173": "ปฏิบัติการเคมีพื้นฐาน",
                    "SC173": "Fundamental Chemistry Laboratory",
                    "วท.183": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 1",
                    "SC183": "Physics for Engineers Laboratory I",
                    "วท.184": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 2",
                    "SC184": "Physics for Engineers Laboratory II"
                }
            },
            {
                "category": "กลุ่มวิชาพื้นฐานทางวิศวกรรม",
                "subcategories": {
                    "วก.100": "กราฟิกวิศวกรรม",
                    "ME100": "Engineering Graphics",
                    "วศว.100": "จริยธรรมสำหรับวิศวกร",
                    "TSE100": "Ethics for Engineers",
                    "วศว.101": "เทคโนโลยีสารสนเทศสมัยใหม่เบื้องต้น",
                    "TSE101": "Introduction to Modern Information Technologies",
                    "วอ.121": "วัสดุวิศวกรรม",
                    "IE121": "Engineering Materials"
                }
            },
            {
                "category": "วิชาเฉพาะด้าน",
                "subcategories": {
                    "กลุ่มวิชาบังคับทางวิศวกรรม": "74 หน่วยกิต",
                    "วิชาบังคับในสาขา": "68 หน่วยกิต"
                }
            },
            {
                "category": "วิชาบังคับในสาขา",
                "subcategories": {
                    "วคม.100": "เคมีวิเคราะห์และเคมีเชิงฟิสิกส์พื้นฐาน",
                    "CHE100": "Basic Analytical and Physical Chemistry",
                    "วคม.200": "เคมีอินทรีย์และชีวเคมี",
                    "CHE200": "Organic and Biochemistry",
                    "วคม.201": "เคมีประยุกต์สำหรับวิศวกรเคมี",
                    "CHE201": "Applied Chemistry for Chemical Engineers",
                    "วคม.202": "วิศวกรรมไฟฟ้าเบื้องต้นสำหรับวิศวกรเคมี",
                    "CHE202": "Introduction to Electrical Engineering for Chemical Engineers",
                    "วคม.205": "สมดุลมวลสารและพลังงาน",
                    "CHE205": "Material and Energy Balances"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 8,
        "details": [
            {
                "category": "ด้านลักษณะบุคคล (Character)",
                "subcategories": {
                    "C_1": "ผู้เรียนมีความสามารถในการเรียนรู้ตลอดชีวิต",
                    "C_2": "ผู้เรียนมีความสามารถในการทำงานเป็นทีม"
                }
            },
            {
                "category": "ผลลัพธ์การเรียนรู้ที่คาดหวังเมื่อสิ้นปีการศึกษา (YLOs)",
                "subcategories": {
                    "ปีที่_1": "เรียนรู้วิชาพื้นฐานทางวิทยาศาสตร์ และพัฒนาทักษะ GREATS",
                    "ปีที่_2": "เรียนรู้วิชาพื้นฐานทางวิศวกรรม และวิชาเฉพาะเพื่อให้เข้าใจบริบทของวิชาชีพวิศวกรเคมี และการทำงานร่วมกับวิศวกรสาขาต่าง ๆ เรียนรู้วิธีประยุกต์ใช้ความรู้พื้นฐานทางวิทยาศาสตร์เพื่อแก้ปัญหาทางด้านวิศวกรรมได้",
                    "ปีที่_3": "เรียนรู้วิชาเฉพาะที่ซับซ้อนขึ้น และวิชาเลือกทางวิศวกรรมเคมีที่มีความเฉพาะเจาะจง สามารถประยุกต์ใช้ความรู้ที่มีเพื่อวางแผน ออกแบบ และแก้ปัญหาแต่ละหน่วยปฏิบัติการทางวิศวกรรมเคมีได้ สามารถใช้ความรู้และทักษะที่มีไปปฏิบัติงานในสถานประกอบการได้",
                    "ปีที่_4": "สามารถมองเห็นภาพรวมของการนำเอาหน่วยปฏิบัติการมาใช้ร่วมกันในกระบวนการผลิตของอุตสาหกรรมประเภทต่าง ๆ และมีทักษะการแก้ปัญหาที่เกี่ยวข้องกับวิชาชีพวิศวกรรมเคมีผ่านกระบวนการศึกษาวิจัยอย่างเป็นระบบ หรือ การประยุกต์ใช้ความรู้/ทักษะข้ามศาสตร์"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 65,
        "details": [
            {
                "category": "เคมีวิเคราะห์",
                "subcategories": {
                    "หลักการคำนวณพื้นฐาน": "การคำนวณในเคมีวิเคราะห์",
                    "การวิเคราะห์เชิงน้ำหนัก": "Gravimetric analysis",
                    "การวิเคราะห์เชิงปริมาตร": "Volumetric analysis, การไตเตรตแบบต่าง ๆ",
                    "เคมีไฟฟ้า": "Electrochemistry",
                    "เครื่องมือวิเคราะห์": {
                        "โครมาโตกราฟีแบบแก๊ส": "Gas chromatography",
                        "โครมาโตกราฟีแบบของเหลวสมรรถนะสูง": "High performance liquid chromatography",
                        "สเปกโตรสโคปีแบบยูวีวิสิเบิล": "UV-visible spectroscopy",
                        "สเปกโตรสโคปีแบบฟูเรียร์ทรานส์ฟอร์มอินฟาเรด": "Fourier-transform infrared spectroscopy",
                        "สเปกโตรสโคปีแบบเรโซแนนซ์แม่เหล็กนิวเคลียร์": "Nuclear magnetic resonance spectroscopy"
                    }
                }
            },
            {
                "category": "เคมีเชิงฟิสิกส์",
                "subcategories": {
                    "พื้นฐานทางเธอร์โมไดนามิกส์": "Fundamental of thermodynamics",
                    "ฟังก์ชันทางเธอร์โมไดนามิกส์": "Thermodynamic functions",
                    "สมดุลเคมี": "Chemical equilibrium",
                    "จลนพลศาสตร์ของปฏิกิริยา": "Chemical kinetics",
                    "สมดุลเฟส": "Phase equilibria",
                    "การแยกสาร": {
                        "การกลั่น": "Distillation",
                        "การสกัด": "Extraction"
                    },
                    "เคมีพื้นผิว": "Surface chemistry"
                }
            },
            {
                "category": "เธอร์โมไดนามิกส์ (วคม.211)",
                "subcategories": {
                    "สัญลักษณ์ในวิชาเธอร์โมไดนามิกส์": "แนะนำสัญลักษณ์ต่าง ๆ ที่ใช้ในวิชาเธอร์โมไดนามิกส์",
                    "คุณสมบัติของสารบริสุทธิ์": "Properties of pure substances",
                    "สมการสภาวะของแก๊ส": {
                        "แก๊สอุดมคติ": "Equation of state of ideal gases",
                        "แก๊สจริง": "Equation of state of real gases"
                    },
                    "ความสามารถการอัดตัว": "Compressibility",
                    "แผนภูมิและตารางทางเธอร์โมไดนามิกส์": "Thermodynamic diagrams and tables",
                    "กฎข้อที่หนึ่งทางเธอร์โมไดนามิกส์": "First law of thermodynamics for closed system and for control volume",
                    "กฎข้อที่สองทางเธอร์โมไดนามิกส์": "Second law of thermodynamics",
                    "เอนโทรปี": "Entropy",
                    "การประยุกต์": "Applications of first law, second law and entropy on thermodynamics",
                    "การคำนวณทางเธอร์โมไดนามิกส์": "Calculations for real processes"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 55,
        "details": [
            {
                "category": "วคม.428 การเก็บกลับคืนทรัพยากรและการจัดการกากอุตสาหกรรม",
                "subcategories": {
                    "รหัสวิชา": "CHE428",
                    "ชื่อภาษาอังกฤษ": "Industrial waste recovery management",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหา": {
                        "การพิจารณาแหล่งทรัพยากร": "การใช้ประโยชน์อย่างยั่งยืน",
                        "หลักการ": [
                            "การเก็บกลับคืนทรัพยากร",
                            "การนำกลับมาใช้ใหม่"
                        ],
                        "การจัดการของเสีย": [
                            "การคัดแยก",
                            "การบำบัดทางกายภาพ",
                            "การบำบัดทางเคมี",
                            "การบำบัดทางชีวภาพ"
                        ],
                        "การวางแผน": [
                            "เศรษฐศาสตร์",
                            "การวางแผนโครงการในการเก็บกลับคืน"
                        ],
                        "กากอุตสาหกรรม": [
                            "ผลกระทบ",
                            "การแลกเปลี่ยนวัสดุที่ไม่ใช้แล้วระหว่างโรงงาน"
                        ]
                    },
                    "คำอธิบายภาษาอังกฤษ": "Resource determination and sustainable utilization. Principles of recovery and recycling. Separation and waste treatment by physical, chemical and biological processes. Economic and planning of recovery. Industrial solid waste and environmental impact. Waste exchange."
                }
            },
            {
                "category": "กลุ่มวัสดุศาสตร์",
                "subcategories": {
                    "วคม.306": {
                        "ชื่อวิชา": "เคมีอนินทรีย์",
                        "รหัสวิชา": "CHE306",
                        "หน่วยกิต": "3 (3-0-6)",
                        "เนื้อหา": {
                            "การศึกษา": [
                                "ลักษณะและคุณสมบัติของธาตุกลุ่มหลัก",
                                "ลักษณะและคุณสมบัติของธาตุแทรนซิชัน",
                                "การแบ่งตามลำดับในตารางธาตุ",
                                "สารประกอบของธาตุกลุ่มต่างๆ"
                            ],
                            "ความรู้เชิงทฤษฎี": [
                                "การทำความเข้าใจตารางธาตุ",
                                "สารประกอบอนินทรีย์ที่สำคัญ"
                            ],
                            "สารประกอบที่ศึกษา": [
                                "สารประกอบคอร์ดิเนชัน",
                                "สารประกอบโลหะอินทรีย์",
                                "สารประกอบคลัสเตอร์",
                                "สารประกอบโซลิดสเตท"
                            ]
                        },
                        "คำอธิบายภาษาอังกฤษ": "A study of the properties of main group elements and transition elements in the periodic table and their compounds. Group theory and inorganic compounds such as the coordination compounds, the organometallic compounds, the cluster compound and the solid-state compounds."
                    },
                    "วคม.307": {
                        "ชื่อวิชา": "วิทยาศาสตร์สารลดแรงตึงผิว",
                        "รหัสวิชา": "CHE307",
                        "หน่วยกิต": "3 (3-0-6)",
                        "เนื้อหา": [
                            "คุณลักษณะของสารลดแรงตึงผิว",
                            "การก่อตัวของไมเซลล์",
                            "การละลาย",
                            "เฟสและเฟสไดอะแกรม",
                            "การดูดซับของสารลดแรงตึงผิวที่พื้นผิวระหว่างของแข็งและของเหลว",
                            "โฟม",
                            "การตกตะกอน",
                            "การประยุกต์ใช้สารลดแรงตึงผิว"
                        ],
                        "คำอธิบายภาษาอังกฤษ": "Characteristics of surfactant. Micelle formation. Solubilization. Phase and phase diagram. Surfactant adsorption at solid-liquid interface. Foams. Precipitation. Applications of surfactants."
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 28,
        "details": [
            {
                "category": "วคม.106 ความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน",
                "subcategories": {
                    "รหัสวิชา": "CHE106",
                    "ชื่อภาษาอังกฤษ": "Sustainability of Natural Resources and Energy",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหารายวิชา": {
                        "นิเวศวิทยาและการอนุรักษ์": "พื้นฐานเกี่ยวกับนิเวศวิทยาเพื่อประโยชน์สำหรับการอนุรักษ์ทรัพยากรธรรมชาติและสิ่งแวดล้อม",
                        "การประเมินผลกระทบ": [
                            "การประเมินวัฏจักรชีวิต",
                            "ลักษณะของมลพิษสิ่งแวดล้อมและผลกระทบต่อสังคม"
                        ],
                        "แนวคิดความยั่งยืน": [
                            "แนวคิดต่าง ๆ เกี่ยวกับความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน",
                            "จริยธรรมสิ่งแวดล้อม",
                            "การออกแบบที่ยั่งยืน"
                        ],
                        "การใช้พลังงานในประเทศไทย": [
                            "การใช้พลังงานของประเทศไทย",
                            "การใช้พลังงานในภาคขนส่ง",
                            "การใช้พลังงานในภาคอุตสาหกรรมและอาคารธุรกิจ"
                        ],
                        "การพัฒนาพลังงานยั่งยืน": [
                            "แนวทางการพัฒนาพลังงานที่ยั่งยืนสำหรับประเทศไทย",
                            "การผลิตไฟฟ้าสำหรับประเทศไทย",
                            "การประหยัดพลังงาน"
                        ],
                        "พลังงานทางเลือก": [
                            "พลังงานแสงอาทิตย์",
                            "พลังงานลม",
                            "พลังงานชีวมวล",
                            "การผลิตเอทานอล",
                            "การผลิตไบโอดีเซล",
                            "เทคโนโลยีถ่านหินสะอาด",
                            "พลังงานนิวเคลียร์"
                        ]
                    }
                }
            },
            {
                "category": "วคม.107 เทคโนโลยีอัจฉริยะเพื่อชีวิตยุคใหม่",
                "subcategories": {
                    "รหัสวิชา": "CHE107",
                    "ชื่อภาษาอังกฤษ": "Smart Technology for Modern Life",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหารายวิชา": {
                        "พัฒนาการทางเทคโนโลยี": [
                            "การพัฒนาเทคโนโลยีในอดีต",
                            "การปฏิวัติอุตสาหกรรมครั้งที่สี่"
                        ],
                        "เทคโนโลยีและสังคม": [
                            "เทคโนโลยีสังคมผู้สูงอายุ",
                            "การเปลี่ยนแปลงสภาวะแวดล้อมของโลกและผลกระทบ",
                            "เทคโนโลยีเพื่อการพัฒนาอย่างยั่งยืน"
                        ],
                        "เทคโนโลยีพลังงานและการขนส่ง": [
                            "ฟิวชันเทคโนโลยี",
                            "พลังงานสะอาด",
                            "ยานยนต์ไฟฟ้า",
                            "ระบบกักเก็บพลังงาน"
                        ],
                        "เทคโนโลยีชีวภาพและวัสดุ": [
                            "เทคโนโลยีชีวภาพ",
                            "เซลล์ต้นกำเนิด",
                            "วัสดุแห่งอนาคต",
                            "นาโนเทคโนโลยี",
                            "การพิมพ์ 3 มิติ"
                        ],
                        "เทคโนโลยีสารสนเทศและการสื่อสาร": [
                            "บิ๊กเดต้า",
                            "5จี",
                            "อินเตอร์เน็ตของสรรพสิ่ง",
                            "ปัญญาประดิษฐ์"
                        ],
                        "เทคโนโลยีเพื่อความมั่นคง": "เทคโนโลยีเพื่อความมั่นคง"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 64,
        "details": [
            {
                "category": "พื้นฐานนิเวศวิทยาและการอนุรักษ์",
                "subcategories": {
                    "นิเวศวิทยาพื้นฐาน": "พื้นฐานเกี่ยวกับนิเวศวิทยาเพื่อประโยชน์สำหรับการอนุรักษ์ทรัพยากรธรรมชาติและสิ่งแวดล้อม",
                    "การประเมินวัฏจักรชีวิต": "การประเมินวัฏจักรชีวิต",
                    "มลพิษสิ่งแวดล้อม": "ลักษณะของมลพิษสิ่งแวดล้อมและผลกระทบต่อสังคม",
                    "ความยั่งยืน": "แนวคิดต่าง ๆ เกี่ยวกับความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน",
                    "จริยธรรมสิ่งแวดล้อม": "จริยธรรมสิ่งแวดล้อม",
                    "การออกแบบที่ยั่งยืน": "การออกแบบที่ยั่งยืน"
                }
            },
            {
                "category": "การใช้พลังงานในประเทศไทย",
                "subcategories": {
                    "ภาพรวม": "การใช้พลังงานของประเทศไทย",
                    "ภาคขนส่ง": "การใช้พลังงานในภาคขนส่ง",
                    "ภาคอุตสาหกรรมและธุรกิจ": "การใช้พลังงานในภาคอุตสาหกรรมและอาคารธุรกิจ",
                    "การพัฒนาพลังงานยั่งยืน": "แนวทางการพัฒนาพลังงานที่ยั่งยืนสำหรับประเทศไทย",
                    "การผลิตไฟฟ้า": "การผลิตไฟฟ้าสำหรับประเทศไทย",
                    "การประหยัดพลังงาน": "การประหยัดพลังงาน"
                }
            },
            {
                "category": "พลังงานทางเลือก",
                "subcategories": {
                    "พลังงานแสงอาทิตย์": "พลังงานแสงอาทิตย์",
                    "พลังงานลม": "พลังงานลม",
                    "พลังงานชีวมวล": "พลังงานชีวมวล",
                    "เอทานอล": "การผลิตเอทานอล",
                    "ไบโอดีเซล": "การผลิตไบโอดีเซล",
                    "ถ่านหินสะอาด": "เทคโนโลยีถ่านหินสะอาด",
                    "พลังงานนิวเคลียร์": "พลังงานนิวเคลียร์"
                }
            },
            {
                "category": "เทคโนโลยีอัจฉริยะเพื่อชีวิตยุคใหม่",
                "subcategories": {
                    "การพัฒนาเทคโนโลยี": "การพัฒนาเทคโนโลยีในอดีต",
                    "การปฏิวัติอุตสาหกรรม": "การปฏิวัติอุตสาหกรรมครั้งที่สี่",
                    "เทคโนโลยีสังคมผู้สูงอายุ": "เทคโนโลยีสังคมผู้สูงอายุ",
                    "การเปลี่ยนแปลงสภาพภูมิอากาศ": "การเปลี่ยนแปลงสภาวะแวดล้อมของโลกและผลกระทบ",
                    "เทคโนโลยีเพื่อการพัฒนาอย่างยั่งยืน": "เทคโนโลยีเพื่อการพัฒนาอย่างยั่งยืน"
                }
            },
            {
                "category": "เทคโนโลยีสมัยใหม่",
                "subcategories": {
                    "ฟิวชันเทคโนโลยี": "ฟิวชันเทคโนโลยี",
                    "พลังงานสะอาด": "พลังงานสะอาด",
                    "ยานยนต์ไฟฟ้า": "ยานยนต์ไฟฟ้า",
                    "ระบบกักเก็บพลังงาน": "ระบบกักเก็บพลังงาน",
                    "เทคโนโลยีชีวภาพ": "เทคโนโลยีชีวภาพ",
                    "เซลล์ต้นกำเนิด": "เซลล์ต้นกำเนิด",
                    "วัสดุแห่งอนาคต": "วัสดุแห่งอนาคต",
                    "นาโนเทคโนโลยี": "นาโนเทคโนโลยี",
                    "การพิมพ์ 3 มิติ": "การพิมพ์ 3 มิติ",
                    "บิ๊กเดต้า": "บิ๊กเดต้า",
                    "5จี": "5จี",
                    "อินเตอร์เน็ตของสรรพสิ่ง": "อินเตอร์เน็ตของสรรพสิ่ง",
                    "ปัญญาประดิษฐ์": "ปัญญาประดิษฐ์",
                    "เทคโนโลยีเพื่อความมั่นคง": "เทคโนโลยีเพื่อความมั่นคง"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 52,
        "details": [
            {
                "category": "เชื้อเพลิงสะอาด",
                "subcategories": {
                    "ประวัติศาสตร์": "ประวัติศาสตร์ของเชื้อเพลิงสะอาด",
                    "สถานการณ์ปัจจุบัน": "สถานการณ์ปัจจุบันของเชื้อเพลิงสะอาด",
                    "ความจำเป็น": "ความจำเป็นของเชื้อเพลิงสะอาด",
                    "ผลกระทบต่อสภาวะภูมิอากาศ": "เชื้อเพลิงกับการเปลี่ยนแปลงสภาวะทางภูมิอากาศ",
                    "ลักษณะของเชื้อเพลิงสะอาด": {
                        "ชนิด": "ชนิดของเชื้อเพลิงสะอาด",
                        "องค์ประกอบ": "องค์ประกอบของเชื้อเพลิงสะอาด",
                        "คุณสมบัติ": "คุณสมบัติของเชื้อเพลิงสะอาด",
                        "มาตรฐานที่เกี่ยวข้อง": "มาตรฐานที่เกี่ยวข้องของเชื้อเพลิงสะอาด"
                    },
                    "การผลิตเชื้อเพลิงสะอาด": {
                        "การแปรรูปชีวมวล": {
                            "การให้ความร้อนที่อุณหภูมิต่ำ": "การแปรรูปชีวมวลด้วยการให้ความร้อนที่อุณหภูมิต่ำ",
                            "การคาร์บอนไนเซชั่น": "การคาร์บอนไนเซชั่น",
                            "การแตกสลายด้วยความร้อน": "การแตกสลายด้วยความร้อน",
                            "การทำให้เป็นเชื้อเพลิงที่เป็นของเหลว": "การทำให้เป็นเชื้อเพลิงที่เป็นของเหลว",
                            "การทำให้เป็นเชื้อเพลิงที่เป็นก๊าซ": "การทำให้เป็นเชื้อเพลิงที่เป็นก๊าซ"
                        },
                        "การผลิตแอลกอฮอล์": "การผลิตแอลกอฮอล์",
                        "การผลิตน้ำมันดีเซลชีวภาพ": "การผลิตน้ำมันดีเซลชีวภาพ",
                        "การผลิตไฮโดรเจน": "การผลิตไฮโดรเจน",
                        "การย่อยสลายในสภาพไร้อากาศ": "การย่อยสลายในสภาพไร้อากาศเพื่อให้เป็นก๊าซชีวภาพ",
                        "การแปรสภาพถ่านหิน": "การแปรสภาพถ่านหินด้วยเทคโนโลยีถ่านหินสะอาด"
                    }
                }
            },
            {
                "category": "การจัดการและการอนุรักษ์พลังงาน",
                "subcategories": {
                    "กฎหมายและข้อกำหนด": {
                        "ภาคอุตสาหกรรม": "กฎหมายและข้อกำหนดเกี่ยวกับการจัดการและการอนุรักษ์พลังงานสำหรับภาคอุตสาหกรรม",
                        "ภาคธุรกิจ": "กฎหมายและข้อกำหนดเกี่ยวกับการจัดการและการอนุรักษ์พลังงานสำหรับภาคธุรกิจ",
                        "ภาคขนส่ง": "กฎหมายและข้อกำหนดเกี่ยวกับการจัดการและการอนุรักษ์พลังงานสำหรับภาคขนส่ง"
                    },
                    "การประยุกต์ใช้หลักการทางความร้อนและพลังงาน": {
                        "หม้อไอน้ำ": "การอนุรักษ์พลังงานในหม้อไอน้ำ",
                        "ระบบปรับอากาศ": "การอนุรักษ์พลังงานในระบบปรับอากาศ",
                        "ระบบแสงสว่าง": "การอนุรักษ์พลังงานในระบบแสงสว่าง",
                        "รถยนต์ไฟฟ้า": "การอนุรักษ์พลังงานในรถยนต์ไฟฟ้า"
                    }
                }
            },
            {
                "category": "การป้องกันมลพิษ",
                "subcategories": {
                    "การปรับปรุงกระบวนการทำงานในโรงงานอุตสาหกรรม": "การปรับปรุงกระบวนการทำงานในโรงงานอุตสาหกรรมอย่างต่อเนื่อง",
                    "การรักษาสิ่งแวดล้อมเชิงป้องกัน": "การผสมผสานระหว่างการรักษาสิ่งแวดล้อมในเชิงป้องกันและกลยุทธ์ทางธุรกิจ",
                    "การอนุรักษ์ทรัพยากร": {
                        "วัสดุ": "การอนุรักษ์ทรัพยากรที่เป็นวัสดุ",
                        "น้ำ": "การอนุรักษ์ทรัพยากรน้ำ",
                        "พลังงาน": "การอนุรักษ์พลังงาน"
                    },
                    "การลดการใช้สารพิษและสารอันตราย": "ลดการใช้สารพิษและสารอันตราย",
                    "การลดการเกิดของเสีย": "ลดการเกิดของเสียที่ต้นกำเนิด",
                    "การประเมินวงจรชีวิตผลิตภัณฑ์": "การประเมินวงจรชีวิตผลิตภัณฑ์และการผลิต",
                    "เทคโนโลยีสะอาด": "เทคโนโลยีสะอาด"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 17,
        "details": [
            {
                "category": "กลุ่มสิ่งแวดล้อม",
                "subcategories": {
                    "วคม.426": {
                        "ชื่อวิชาภาษาไทย": "การออกแบบผลิตภัณฑ์เชิงนิเวศเศรษฐกิจ",
                        "ชื่อวิชาภาษาอังกฤษ": "Ecodesign",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วคม.427": {
                        "ชื่อวิชาภาษาไทย": "มลพิษทางอากาศ",
                        "ชื่อวิชาภาษาอังกฤษ": "Air Pollution",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วคม.428": {
                        "ชื่อวิชาภาษาไทย": "การเก็บกลับคืนทรัพยากรและการจัดการกากอุตสาหกรรม",
                        "ชื่อวิชาภาษาอังกฤษ": "Industrial waste recovery management",
                        "หน่วยกิต": "3 (3-0-6)"
                    }
                }
            },
            {
                "category": "กลุ่มวัสดุศาสตร์",
                "subcategories": {
                    "วคม.306": {
                        "ชื่อวิชาภาษาไทย": "เคมีอนินทรีย์",
                        "ชื่อวิชาภาษาอังกฤษ": "Inorganic Chemistry",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วคม.307": {
                        "ชื่อวิชาภาษาไทย": "วิทยาศาสตร์สารลดแรงตึงผิว",
                        "ชื่อวิชาภาษาอังกฤษ": "Surfactant Science",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วคม.344": {
                        "ชื่อวิชาภาษาไทย": "การประยุกต์วิศวกรรมเคมีในกระบวนการนำส่งยา",
                        "ชื่อวิชาภาษาอังกฤษ": "Chemical Engineering Applications in Drug Delivery",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วคม.345": {
                        "ชื่อวิชาภาษาไทย": "การพัฒนาเครื่องสำอาง และกระบวนการผลิต",
                        "ชื่อวิชาภาษาอังกฤษ": "Cosmetic formulation and processing",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วคม.346": {
                        "ชื่อวิชาภาษาไทย": "หัวข้อพิเศษเกี่ยวกับวัสดุสำหรับอุตสาหกรรม",
                        "ชื่อวิชาภาษาอังกฤษ": "Special Topic in Materials for Industries",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วคม.347": {
                        "ชื่อวิชาภาษาไทย": "เคมีวัสดุ",
                        "ชื่อวิชาภาษาอังกฤษ": "Material Chemistry",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วคม.348": {
                        "ชื่อวิชาภาษาไทย": "การกัดกร่อนและการป้องกันการกัดกร่อน",
                        "ชื่อวิชาภาษาอังกฤษ": "Corrosion and Corrosion Control",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วคม.349": {
                        "ชื่อวิชาภาษาไทย": "นาโนเทคโนโลยีเบื้องต้น",
                        "ชื่อวิชาภาษาอังกฤษ": "Introductory Nanotechnology",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วคม.447": {
                        "ชื่อวิชาภาษาไทย": "เทคโนโลยีพอลิเมอร์และไบโอพลาสติก",
                        "ชื่อวิชาภาษาอังกฤษ": "Polymer and Bioplastic Technology",
                        "หน่วยกิต": "3 (3-0-6)"
                    }
                }
            },
            {
                "category": "กลุ่มคณิตศาสตร์ การจำลอง การออกแบบ และการจัดการ",
                "subcategories": {
                    "วคม.356": {
                        "ชื่อวิชาภาษาไทย": "เธอร์โมไดนามิกส์ระดับโมเลกุลและการจำลองระบบโดยคอมพิวเตอร์",
                        "ชื่อวิชาภาษาอังกฤษ": "Molecular Thermodynamics and Computer Simulation",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วคม.357": {
                        "ชื่อวิชาภาษาไทย": "MATLAB สำหรับวิศวกรเคมี",
                        "ชื่อวิชาภาษาอังกฤษ": "MATLAB for Chemical Engineers",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วคม.358": {
                        "ชื่อวิชาภาษาไทย": "การแก้ไขปัญหาการควบคุมของโรงงาน",
                        "ชื่อวิชาภาษาอังกฤษ": "",
                        "หน่วยกิต": "3 (3-0-6)"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 24,
        "details": [
            {
                "category": "เลือกเรียนรูปแบบที่ 3 เลือกเรียนวิชาโท",
                "subcategories": {
                    "ปีการศึกษาที่ 4": {
                        "ภาคเรียนที่ 1": [
                            {
                                "วิชา": "มธ.102 ชีวิตกับสุนทรียภาพ/ มธ.106 ความคิดสร้างสรรค์และการสื่อสาร",
                                "หน่วยกิต": 3
                            },
                            {
                                "วิชา": "วคม.461 พลศาสตร์ของกระบวนการและการควบคุม",
                                "หน่วยกิต": 3
                            },
                            {
                                "วิชา": "วคม.474 การออกแบบกระบวนการผลิตและการออกแบบโรงงาน",
                                "หน่วยกิต": 3
                            },
                            {
                                "วิชา": "วคม.480 สัมมนาทางวิศวกรรมเคมี",
                                "หน่วยกิต": 1
                            },
                            {
                                "วิชา": "วคม.482 ปฏิบัติการทางวิศวกรรมเคมี 2",
                                "หน่วยกิต": 1
                            },
                            {
                                "วิชา": "วคม.xxx วิชาเลือกสาขาวิชาโท",
                                "หน่วยกิต": 3
                            },
                            {
                                "วิชา": "วคม.xxx วิชาเลือกสาขาวิชาโท",
                                "หน่วยกิต": 3
                            }
                        ],
                        "รวมหน่วยกิตภาคเรียนที่ 1": 17,
                        "ภาคเรียนที่ 2": [
                            {
                                "วิชา": "วคม.xxx วิชาเลือกสาขาวิชาโท",
                                "หน่วยกิต": 3
                            },
                            {
                                "วิชา": "วคม.xxx วิชาเลือกสาขาวิชาโท",
                                "หน่วยกิต": 3
                            }
                        ],
                        "รวมหน่วยกิตภาคเรียนที่ 2": 6
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 12,
        "details": [
            {
                "category": "1.3) หมวดคณิตศาสตร์ วิทยาศาสตร์ และเทคโนโลยี",
                "subcategories": {
                    "บังคับ": "3 วิชา 9 หน่วยกิต",
                    "1. บังคับ 2 วิชา 6 หน่วยกิต": {
                        "วท.123 เคมีพื้นฐาน": "3 (3-0-6)",
                        "SC123 Fundamental Chemistry": "",
                        "วพ.101 การเขียนโปรแกรมคอมพิวเตอร์เบื้องต้น": "3 (3-0-6)",
                        "CN101 Introduction to Computer Programming": ""
                    },
                    "2. บังคับเลือก 1 วิชา 3 หน่วยกิต จาก": {
                        "วคม.106 ความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน": "3 (3-0-6)",
                        "CHE106 Sustainability of Natural Resources and Energy": "",
                        "วคม.107 เทคโนโลยีอัจฉริยะเพื่อชีวิตยุคใหม่": "3 (3-0-6)",
                        "CHE107 Smart Technology for Modern Life": "",
                        "มธ.103 ชีวิตกับความยั่งยืน": "3 (3-0-6)",
                        "TU103 Life and Sustainability": "",
                        "มธ.107 ทักษะดิจิทัลกับการแก้ปัญหา": "3 (3-0-6)",
                        "TU107 Digital Skill and Problem Solving": ""
                    }
                }
            },
            {
                "category": "1.4) หมวดสุขภาวะและทักษะแห่งอนาคต",
                "subcategories": {
                    "บังคับ": "1 วิชา 3 หน่วยกิต",
                    "มธ.108 การพัฒนาและจัดการตนเอง": "3 (3-0-6)",
                    "TU108 Self Development and Management": ""
                }
            },
            {
                "category": "1.5) หมวดการบริการสังคมและการเรียนรู้จากการปฏิบัติ",
                "subcategories": {
                    "บังคับ": "1 วิชา 3 หน่วยกิต",
                    "มธ.100 พลเมืองกับการลงมือแก้ปัญหา": "3 (3-0-6)",
                    "TU100 Civic Engagement": ""
                }
            },
            {
                "category": "2) วิชาเฉพาะ",
                "subcategories": {
                    "หน่วยกิตรวม": "114 หน่วยกิต",
                    "2.1) วิชาเฉพาะพื้นฐาน": "25 หน่วยกิต",
                    "2.1.1) กลุ่มวิชาพื้นฐานทางคณิตศาสตร์และวิทยาศาสตร์": {
                        "หน่วยกิตรวม": "18 หน่วยกิต",
                        "ค.111 แคลคูลัสพื้นฐาน": "3 (3-0-6)",
                        "MA111 Fundamentals of Calculus": "",
                        "ค.112 เรขาคณิตวิเคราะห์และแคลคูลัสประยุกต์": "3 (3-0-6)",
                        "MA112 Analytic Geometry and Applied Calculus": "",
                        "ค.214 สมการเชิงอนุพันธ์": "3 (3-0-6)",
                        "MA214 Differential Equations": "",
                        "วท.133 ฟิสิกส์สำหรับวิศวกร 1": "3 (3-0-6)"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 30,
        "details": [
            {
                "category": "หมวดสุขภาวะและทักษะแห่งอนาคต",
                "subcategories": {
                    "รายวิชา": "มธ.108 การพัฒนาและจัดการตนเอง",
                    "รหัสวิชา": "TU108",
                    "ชื่อวิชาภาษาอังกฤษ": "Self Development and Management",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "การจัดการและการปรับเข้ากับชีวิตในรั้วมหาวิทยาลัย ท่ามกลางความหลากหลายและเสรีภาพ การพัฒนาทักษะทางสังคมและความฉลาดทางอารมณ์ การเข้าใจตนเองและการวางแผนอนาคต การพัฒนาบุคลิกภาพและมารยาททางสังคม การเรียนรู้ตลอดชีวิต การอยู่ร่วมกับผู้อื่นอย่างสงบสุขและเคารพซึ่งกันและกัน และการดูแลสุขภาพแบบองค์รวม",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Coping with and adaptation to university life. Development of social skill and emotional intelligence. Self-understanding and planning for the future. Personality and social etiquette. Lifelong learning. Learning to live harmoniously and respectfully with others and the society. Holistic healthcare."
                }
            },
            {
                "category": "หมวดการบริการสังคมและการเรียนรู้จากการปฏิบัติ",
                "subcategories": {
                    "รายวิชา": "มธ.100 พลเมืองกับการลงมือแก้ปัญหา",
                    "รหัสวิชา": "TU100",
                    "ชื่อวิชาภาษาอังกฤษ": "Civic Engagement",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "ปลูกฝังจิตสำนึก บทบาท และหน้าที่ความรับผิดชอบของการเป็นสมาชิกที่ดีของสังคมในฐานะพลเมืองโลกผ่านกระบวนการหลากหลายวิธี เช่น การบรรยาย การอภิปรายกรณีศึกษาต่าง ๆ ดูงาน เป็นต้น โดยนักศึกษาจะต้องจัดทำโครงการรณรงค์ เพื่อให้เกิดการรับรู้ หรือเกิดการเปลี่ยนแปลง ในประเด็นที่สนใจ",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Instillation of social conscience and awareness of one's role and duties as a good global citizen. This is done through a variety of methods such as lectures, discussion of various case studies and field study outings. Students are required to organise a campaign to raise awareness or bring about change in an area of their interest."
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 3,
        "details": [
            {
                "category": "1.5 กลุ่มเป้าหมาย",
                "subcategories": {
                    "1.5.1": "วิศวกร/ผู้ปฏิบัติงาน ที่ทำงานเกี่ยวกับสายงานกระบวนการผลิตในอุตสาหกรรม เช่น การจัดหาทรัพยากร การวางแผนและควบคุมการผลิต การบำรุงรักษา การควบคุมคุณภาพและความปลอดภัย และการอนุรักษ์พลังงานและสิ่งแวดล้อม",
                    "1.5.2": "วิศวกร/ผู้ปฏิบัติงาน ที่ทำหน้าที่เกี่ยวกับสายงานการออกแบบ การก่อสร้าง การเริ่มดำเนินการผลิต การบริหารโครงการ ตลอดจนการพัฒนากระบวนการผลิต สำหรับโรงงานอุตสาหกรรม",
                    "1.5.3": "วิศวกร/ผู้ปฏิบัติงาน ที่ทำหน้าที่เกี่ยวกับงานการตลาด งานขาย งานบริการทางเทคนิค และงานพัฒนาผลิตภัณฑ์",
                    "1.5.4": "อาจารย์ นักวิชาการ นักวิจัย นักประดิษฐ์",
                    "1.5.5": "เจ้าของกิจการ ผู้ประกอบอาชีพอิสระ"
                }
            },
            {
                "category": "1.6 สถานที่จัดการเรียนการสอน",
                "subcategories": {
                    "สถานที่_1": "ศูนย์รังสิต",
                    "สถานที่_2": "ท่าพระจันทร์",
                    "สถานที่_3": "ศูนย์พัทยา",
                    "สถานที่_4": "ศูนย์ลำปาง"
                }
            },
            {
                "category": "1.7 ค่าใช้จ่ายตลอดหลักสูตร",
                "subcategories": {
                    "ประเภทโครงการ": {
                        "ตัวเลือก_1": "โครงการปกติ",
                        "ตัวเลือก_2": "โครงการพิเศษ",
                        "ตัวเลือก_3": "โครงการปกติและโครงการพิเศษ"
                    },
                    "ค่าใช้จ่ายตลอดหลักสูตร": {
                        "นักศึกษาไทย": "147,440 บาท",
                        "นักศึกษาต่างชาติ": "ไม่ระบุ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 11,
        "details": [
            {
                "category": "เลขหลักร้อย",
                "subcategories": {
                    "เลข_1": "หมายถึง รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 1",
                    "เลข_2": "หมายถึง รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 2",
                    "เลข_3": "หมายถึง รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 3",
                    "เลข_4_-_5": "หมายถึง รายวิชาที่จัดสอนในหลักสูตรชั้นปีที่ 4"
                }
            },
            {
                "category": "รายวิชาและข้อกำหนดของหลักสูตร",
                "subcategories": {
                    "วิชาศึกษาทั่วไป": "30 หน่วยกิต",
                    "หมวดความเท่าทันโลกและสังคม": {
                        "บังคับ": "2 วิชา 6 หน่วยกิต",
                        "บังคับ_1_วิชา": {
                            "รหัสวิชา": "มธ.124",
                            "ชื่อวิชา": "สังคมกับเศรษฐกิจ",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        "บังคับเลือก_1_วิชา": {
                            "วิชาที่_1": {
                                "รหัสวิชา": "มธ.101",
                                "ชื่อวิชา": "โลก อาเซียน และไทย",
                                "หน่วยกิต": "3 (3-0-6)"
                            },
                            "วิชาที่_2": {
                                "รหัสวิชา": "มธ.109",
                                "ชื่อวิชา": "นวัตกรรมกับกระบวนคิดผู้ประกอบการ",
                                "หน่วยกิต": "3 (3-0-6)"
                            }
                        }
                    },
                    "หมวดสุนทรียะและทักษะการสื่อสาร": {
                        "บังคับ": "3 วิชา 9 หน่วยกิต",
                        "บังคับ_2_วิชา": {
                            "วิชาที่_1": {
                                "รหัสวิชา": "ศศ.101",
                                "ชื่อวิชา": "การคิด อ่าน และเขียนอย่างมีวิจารณญาณ",
                                "หน่วยกิต": "3 (3-0-6)"
                            },
                            "วิชาที่_2": {
                                "รหัสวิชา": "สษ.105",
                                "ชื่อวิชา": "ทักษะการสื่อสารทางภาษาอังกฤษ",
                                "หน่วยกิต": "3 (3-0-6)"
                            }
                        },
                        "บังคับเลือก_1_วิชา": {
                            "วิชาที่_1": {
                                "รหัสวิชา": "มธ.102",
                                "ชื่อวิชา": "ชีวิตกับสุนทรียภาพ",
                                "หน่วยกิต": "3 (3-0-6)"
                            },
                            "วิชาที่_2": {
                                "รหัสวิชา": "มธ.106",
                                "ชื่อวิชา": "ความคิดสร้างสรรค์และการสื่อสาร",
                                "หน่วยกิต": "3 (3-0-6)"
                            }
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 50,
        "details": [
            {
                "category": "CHE597 Long-term internship in Chemical Engineering",
                "subcategories": {
                    "Course_Code": "วคม.597",
                    "Credits": "6 (ไม่น้อยกว่า 16 สัปดาห์ต่อภาคการศึกษา)",
                    "Prerequisite": "สอบได้ วคม.596",
                    "Duration": "ไม่น้อยกว่า 600 ชั่วโมง (ใน 16 สัปดาห์)",
                    "Requirements": {
                        "Pre_Internship": "The student must pass the requirement before beginning the long-term internship",
                        "Topic_Selection": "Selected topics should be suitable for chemical engineers and workplace and up to date",
                        "Minimum_Hours": "The student is allowed to work in a chemical industry at least 160 hours",
                        "Supervision": "Under the supervision of industrial supervisor and the faculty staff",
                        "Learning_Objectives": "The student will learn about various industrial production processes and raise the problems to be solved during his/her practice",
                        "Proposal_Submission": "The student must submit the proposal and activity plan for CHE597",
                        "Proposal_Content": "The proposal contains the expected outcomes and benefits, the possibility and research plan"
                    },
                    "Internship_Process": {
                        "Continuation": "ให้นักศึกษาปฏิบัติงานกับสถานประกอบการตามเงื่อนไขที่ตกลง ต่อเนื่องจากภาคการศึกษาที่ผ่านมา",
                        "Evaluation": "ระหว่างการปฏิบัติงานจะมีการติดตามผลและประเมินร่วมกันระหว่างนักศึกษา อาจารย์ที่ปรึกษาและอาจารย์ผู้ควบคุมงาน หรือผู้ประกอบการ"
                    },
                    "Post_Internship": {
                        "Output_Format": "นักศึกษาต้องเรียบเรียงผลการปฏิบัติงานในรูปแบบที่เหมาะสม ได้แก่ สารนิพนธ์ หรือรายงานผลการปฏิบัติการในโครงการ หรือในรูปแบบอื่นที่เหมาะสม เช่น การนำเสนอผลงานทางวิชาการในที่สัมมนา",
                        "Final_Presentation": "ก่อนจบการศึกษานักศึกษาต้องมีการนำเสนอผลการศึกษาต่ออาจารย์ที่ปรึกษาและคณะกรรมการ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 49,
        "details": [
            {
                "category": "วคม.497 โครงงานทางวิศวกรรมเคมี 2",
                "subcategories": {
                    "คำอธิบายรายวิชา": "นักศึกษาทำงานวิจัยต่อเนื่องตามแผนงานหรือข้อเสนอโครงงานวิจัยที่เสนอไว้ในวิชา วคม.496 เพื่อสร้างองค์ความรู้ใหม่หรือพัฒนาความรู้เพื่อนำไปประยุกต์ใช้ในอุตสาหกรรม",
                    "ข้อกำหนด": "ก่อนจบวิชานี้ นักศึกษาต้องเรียบเรียงผลงานวิจัยในรูปแบบปริญญานิพนธ์",
                    "การวัดผล": {
                        "อาจารย์ที่ปรึกษา": "พิจารณาจากคุณภาพของผลงานวิจัย",
                        "คณะกรรมการสอบ": "พิจารณาจากผลการดำเนินงานวิจัย ความเข้าใจในงานวิจัยที่ทำ และการนำเสนอผลงานวิจัย"
                    },
                    "วิชาบังคับก่อน": "Have earned credits of CHE496"
                }
            },
            {
                "category": "CHE497 Chemical Engineering Project II",
                "subcategories": {
                    "Course Description": "The students have to continue their research of same topics they presented in CHE496 in order to acquire a new understanding or develop ideas for industrial applications.",
                    "Requirement": "Based on the work that they have done, students have to write up an undergraduate theses.",
                    "Evaluation": {
                        "Advisor": "Considers the quality of the research work",
                        "Committee": "Considers how well the presentation is and how well the students express their understanding"
                    },
                    "Prerequisite": "Have earned credits of CHE496"
                }
            },
            {
                "category": "รูปแบบที่ 2 การฝึกงานในวิชาชีพวิศวกรรมเคมีระยะยาว",
                "subcategories": {
                    "วคม.596 การเตรียมฝึกงานในวิชาชีพวิศวกรรมเคมีระยะยาว": {
                        "หน่วยกิต": "3 (0-9-6)",
                        "วิชาบังคับก่อน": "เคยเรียนวิชาบังคับเฉพาะสาขาวิชาวิศวกรรมเคมีตามโครงสร้างหลักสูตรที่กำหนดไว้ ไม่น้อยกว่า 43 หน่วยกิต",
                        "การเตรียมความพร้อม": "ก่อนปฏิบัติงานนักศึกษาต้องผ่านการเตรียมความพร้อมตามหลักสูตรคณะวิศวกรรมศาสตร์",
                        "หัวข้อการศึกษา": "ให้ปรับเลือกตามความเหมาะสมกับสาขาวิชาวิศวกรรมเคมีและกับสถานประกอบการหรือหน่วยงานที่เกี่ยวข้อง ตลอดจนสถานการณ์ปัจจุบันของสังคม",
                        "การปฏิบัติงาน": "ให้นักศึกษาปฏิบัติงานศึกษากับสถานประกอบการตามเงื่อนไขที่ตกลง เช่น ปฏิบัติงานในโครงการใหญ่ ซึ่งอาจมีหลายสถาบันการศึกษาร่วมด้วยหรือปฏิบัติงานในโครงการเฉพาะกลุ่ม หรือเฉพาะบุคคลหรือปฏิบัติงานเชี่ยวชาญเฉพาะด้าน",
                        "เป้าหมายเบื้องต้น": "ต้องการให้นักศึกษาทราบถึงกระบวนการผลิตต่าง ๆ ในโรงงาน และสามารถสรุปปัญหาที่เกิดขึ้นในโรงงาน",
                        "การติดตามและประเมินผล": "ระหว่างการปฏิบัติงานจะมีการติดตามผล และประเมินร่วมกันระหว่างนักศึกษา อาจารย์ที่ปรึกษาและอาจารย์ผู้ควบคุมงาน หรือผู้ประกอบการ",
                        "ข้อกำหนดการจบวิชา": "ก่อนจบวิชานี้ นักศึกษาจะต้องส่งข้อเสนอโครงงาน อธิบายแผนงานที่จะทำต่อไปใน วคม.597 โดยแสดงถึงประโยชน์ที่คาดว่าจะได้รับความเป็นไปได้ วิธีปฏิบัติ และความพร้อมของแผนงานที่วางไว้"
                    }
                }
            },
            {
                "category": "CHE596 Preparation for Long-term internship in Chemical Engineering",
                "subcategories": {
                    "Prerequisite": "Have Taken the Major Courses Required by the Curriculum at least 43 Credits."
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 57,
        "details": [
            {
                "category": "Materials Science",
                "subcategories": {
                    "Functional_Materials": "Inorganic and organic materials with special functions.",
                    "Nanomaterials": "Nanomaterials of superconductors.",
                    "Biomaterials": "Biocompatible polymers for synthetic organs and drug delivery systems.",
                    "Sustainable_Materials": "Materials for sustainable environments and energy.",
                    "Application_Specific_Materials": "Materials for display, electrical and magnetic applications.",
                    "Structure_Property_Relationship": "Relation between chemical structures and properties of materials.",
                    "Analytical_Methods": "Basic analytical methods in determining structures and properties of materials."
                }
            },
            {
                "category": "Corrosion and Corrosion Control",
                "subcategories": {
                    "Course_Code": "CHE348",
                    "Credits": "3 (3-0-6)",
                    "Definition": "Definition of corrosion and corrosion phenomena",
                    "Mechanisms": "Mechanisms of corrosion",
                    "Thermodynamics": "Thermodynamics of corrosion",
                    "Kinetics": "Kinetics of corrosion",
                    "Protection_Methods": {
                        "Cathodic_Protection": "Cathodic protection",
                        "Anodic_Protection": "Anodic protection"
                    },
                    "Corrosion_Types": "Various corrosion mechanisms",
                    "Prevention": "Corrosion prevention",
                    "Material_Selection": "Material selection for various processes"
                }
            },
            {
                "category": "Introductory Nanotechnology",
                "subcategories": {
                    "Course_Code": "CHE349",
                    "Credits": "3 (3-0-6)",
                    "Importance_and_Evolution": "Importance and evolution of nanotechnology",
                    "Biomimicry": "Biomimic nanotechnology",
                    "Fundamental_Concepts": {
                        "Atoms_and_Molecules": "Atoms and molecules",
                        "Nanomaterial_Properties": "Properties of nanomaterials"
                    },
                    "Nanofabrication": {
                        "Laboratory_Scale": "Nanofabrication in laboratory",
                        "Industrial_Scale": "Nanofabrication in industries"
                    },
                    "Applications": {
                        "Nanoparticles": "Nanoparticles and their applications",
                        "Nanofibers": "Nanofibers and their applications",
                        "Nanoelectronics": "Nanoelectronics",
                        "Nanobiotechnology": "Nanobiotechnology"
                    },
                    "Nanomaterials": {
                        "Nanomaterials": "Nanomaterials",
                        "Nanocomposites": "Nanocomposites"
                    }
                }
            },
            {
                "category": "Polymer and Bioplastic Technology",
                "subcategories": {
                    "Course_Code": "CHE447",
                    "Credits": "3 (3-0-6)"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 9,
        "details": [
            {
                "category": "หมวดที่ 4 โครงสร้างหลักสูตร รายวิชา และหน่วยกิต",
                "subcategories": {
                    "4.1 ระบบการจัดการศึกษาและระยะเวลาการศึกษา": {
                        "4.1.1 ระบบ": "เป็นหลักสูตรแบบเต็มเวลา ใช้ระบบการศึกษาแบบทวิภาค โดย 1 ปีการศึกษาแบ่งออกเป็น 2 ภาคการศึกษาปกติ 1 ภาคการศึกษาปกติ มีระยะเวลาศึกษาไม่น้อยกว่า 15 สัปดาห์ และมีการจัดการศึกษาภาคฤดูร้อน ในปีการศึกษาที่ 3",
                        "4.1.2 ระยะเวลาการศึกษาสูงสุด": [
                            "ไม่กำหนด",
                            "ไม่เกิน 16 ภาคการศึกษาปกติ"
                        ]
                    },
                    "4.2 การดำเนินการหลักสูตร": {
                        "4.2.1 วัน-เวลาในการดำเนินการเรียนการสอน": [
                            "วัน – เวลาราชการปกติ",
                            "นอกวัน – เวลาราชการ"
                        ],
                        "4.2.2 ระบบการศึกษา": [
                            "แบบชั้นเรียน (Onsite)",
                            "แบบทางไกล (Online)",
                            "แบบประสมประสาน (Hybrid)",
                            "อื่น ๆ (ระบุ)"
                        ]
                    },
                    "4.3 โครงสร้างหลักสูตร รายวิชา และหน่วยกิต": {
                        "4.3.1 หลักสูตร": {
                            "4.3.1.1 จำนวนหน่วยกิตรวม": "จำนวนหน่วยกิตรวมตลอดหลักสูตร 150 หน่วยกิต",
                            "4.3.1.2 โครงสร้างหลักสูตร": {
                                "รายละเอียด": "นักศึกษาจะต้องจดทะเบียนศึกษารายวิชา รวมไม่น้อยกว่า 150 หน่วยกิต โดยศึกษารายวิชาต่าง ๆ ครบตามโครงสร้างองค์ประกอบ และข้อกำหนดของหลักสูตรดังนี้",
                                "โครงสร้าง": [
                                    {
                                        "หมวด": "วิชาศึกษาทั่วไป",
                                        "หน่วยกิต": 30
                                    },
                                    {
                                        "หมวด": "วิชาเฉพาะ",
                                        "หน่วยกิต": 114,
                                        "รายละเอียด": [
                                            {
                                                "หมวด": "วิชาเฉพาะพื้นฐาน",
                                                "หน่วยกิต": 25,
                                                "รายละเอียด": [
                                                    {
                                                        "กลุ่มวิชา": "กลุ่มวิชาพื้นฐานทางคณิตศาสตร์และวิทยาศาสตร์",
                                                        "หน่วยกิต": 18
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 21,
        "details": [
            {
                "category": "ปีการศึกษาที่ 3",
                "subcategories": {
                    "ภาคเรียนที่ 1": {
                        "หน่วยกิตรวม": 19,
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "วคม.311",
                                "ชื่อวิชา": "การถ่ายเทความร้อนสำหรับวิศวกรรมเคมี",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.314",
                                "ชื่อวิชา": "เธอร์โมไดนามิกส์สำหรับวิศวกรรมเคมี 2",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.315",
                                "ชื่อวิชา": "วิศวกรรมปฏิกิริยา",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.371",
                                "ชื่อวิชา": "กระบวนการทางวิศวกรรมเคมีและการเยี่ยมชมโรงงาน",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.373",
                                "ชื่อวิชา": "เศรษฐศาสตร์วิศวกรรมเคมี",
                                "หน่วยกิต": 2
                            },
                            {
                                "รหัสวิชา": "วคม.374",
                                "ชื่อวิชา": "การจัดการทางวิศวกรรมเคมี",
                                "หน่วยกิต": 2
                            },
                            {
                                "รหัสวิชา": "XX xxx",
                                "ชื่อวิชา": "วิชาเลือกเสรี",
                                "หน่วยกิต": 3
                            }
                        ]
                    },
                    "ภาคเรียนที่ 2": {
                        "หน่วยกิตรวม": 22,
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "วคม.106/วคม.107/มธ.103/มธ.107",
                                "ชื่อวิชา": "ความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน/ เทคโนโลยีอัจฉริยะเพื่อชีวิตยุคใหม่/ ชีวิตกับความยั่งยืน/ ทักษะดิจิทัลกับการแก้ปัญหา",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.320",
                                "ชื่อวิชา": "การบำบัดของเสียจากอุตสาหกรรม",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.323",
                                "ชื่อวิชา": "ความปลอดภัยทางวิศวกรรมเคมี",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.334",
                                "ชื่อวิชา": "การถ่ายโอนมวลสำหรับวิศวกรเคมี",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.335",
                                "ชื่อวิชา": "กระบวนการแยกสำหรับวิศวกรเคมี",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.372",
                                "ชื่อวิชา": "พื้นฐานอุปกรณ์และเครื่องมือวัดในกระบวนการผลิตของอุตสาหกรรมเคมี",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.381",
                                "ชื่อวิชา": "ปฏิบัติการทางวิศวกรรมเคมี 1",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วคม.xxx/XX xxx",
                                "ชื่อวิชา": "วิชาเลือก (หรือวิชาในสาขาวิชาโท)",
                                "หน่วยกิต": 3
                            }
                        ]
                    },
                    "ภาคฤดูร้อน": {
                        "หน่วยกิตรวม": 1,
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "วคม.382",
                                "ชื่อวิชา": "การฝึกงาน",
                                "หน่วยกิต": 1
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 40,
        "details": [
            {
                "category": "วคม.311 การถ่ายเทความร้อนสำหรับวิศวกรเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE311",
                    "ชื่อภาษาอังกฤษ": "Heat Transfer for Chemical Engineers",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ ค.111",
                    "เนื้อหารายวิชา": {
                        "ทฤษฎีและการประยุกต์": "ปรากฏการณ์การถ่ายเทความร้อนโดยเปรียบเทียบกับสมการการถ่ายเทของโมเมนตัม",
                        "กฎของฟูเรียร์": "การนำความร้อนในสภาวะคงตัวและไม่คงตัว",
                        "หลักการเครือข่ายความต้านทาน": "การถ่ายเทความร้อน",
                        "การถ่ายเทความร้อน": "จากพื้นผิวต่อขยาย",
                        "ฉนวนความร้อน": "",
                        "สัมประสิทธิ์การพาความร้อน": "",
                        "การเดือดและการควบแน่น": "",
                        "การแผ่รังสีความร้อน": "",
                        "การออกแบบ": "อุปกรณ์แลกเปลี่ยนความร้อน",
                        "หลักการและทฤษฎี": "ของเครื่องต้มระเหย"
                    }
                }
            },
            {
                "category": "วคม.314 เธอร์โมไดนามิกส์สำหรับวิศวกรรมเคมี 2",
                "subcategories": {
                    "รหัสวิชา": "CHE314",
                    "ชื่อภาษาอังกฤษ": "Chemical Engineering Thermodynamics II",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วคม.213",
                    "เนื้อหารายวิชา": {
                        "สมบัติทางเธอร์โมไดนามิกส์": "สำหรับแก๊สจริงและแก๊สอุดมคติ",
                        "สมการพื้นฐานทางเธอร์โมไดนามิกส์": "และความสัมพันธ์ระหว่างสมบัติทางเธอร์โมไดนามิกส์ต่าง ๆ",
                        "การคำนวณสมบัติเรซิดวล": "โดยใช้สมการสภาวะและสมการสหสัมพันธ์ทั่วไป",
                        "การหาสมบัติทางเธอร์โมไดนามิกส์": "ด้วยสมการอนุพันธ์",
                        "เธอร์โมไดนามิกส์สำหรับสารละลาย": "และสมบัติพาร์เชียล",
                        "ฟิวกาซิตีและสัมประสิทธิ์ฟิวกาซิตี": "",
                        "สารละลายอุดมคติและสารละลายจริง": "",
                        "สมบัติเอ็กเซสและสัมประสิทธิ์แอคติวิตี": "",
                        "สมดุลระหว่างสถานะ": "ของเหลว ของแข็งและไอ โดยเน้นที่สมดุลของเหลวและไอ",
                        "สมดุลของปฏิกิริยาเคมี": ""
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 54,
        "details": [
            {
                "category": "CHE336 Water Purification Technologies",
                "subcategories": {
                    "หลักการเบื้องต้น": "การผลิตน้ำสำหรับอุปโภคบริโภค",
                    "คุณสมบัติของน้ำ": "น้ำในธรรมชาติ; น้ำจืดและน้ำเค็ม น้ำบริสุทธิ์สำหรับอุตสาหกรรม",
                    "เทคโนโลยีพื้นฐาน": "การตกตะกอน การกรอง และการฆ่าเชื้อโรค",
                    "เทคโนโลยีใหม่": "RO การใช้ความร้อน การแลกเปลี่ยนประจุ การแยกด้วยไฟฟ้า",
                    "กรณีศึกษา": "ตัวอย่างกระบวนการทำน้ำบริสุทธิ์ที่ประสบความสำเร็จในประเทศต่าง ๆ"
                }
            },
            {
                "category": "CHE426 Ecodesign",
                "subcategories": {
                    "นิยาม": "การออกแบบผลิตภัณฑ์เชิงนิเวศเศรษฐกิจ",
                    "หลักการออกแบบ": "โครงสร้างหน้าที่ของผลิตภัณฑ์และหลักการออกแบบเบื้องต้น",
                    "แนวคิด": "การประเมินวัฏจักรชีวิตของผลิตภัณฑ์ EQFD และ EBM",
                    "การประเมินและกลยุทธ์": "การออกแบบผลิตภัณฑ์และปรับปรุงพัฒนาผลิตภัณฑ์",
                    "การสื่อสาร": "ฉลากสิ่งแวดล้อม"
                }
            },
            {
                "category": "CHE427 Air Pollution",
                "subcategories": {
                    "นิยาม": "ความหมายและปรากฏการณ์ทางด้านมลพิษทางอากาศ",
                    "มาตรฐาน": "มาตรฐานคุณภาพอากาศในบรรยากาศและมาตรฐานอากาศเสียที่ปล่อยจากแหล่งกำเนิดมลพิษในประเทศไทย",
                    "การจัดการ": "หลักการจัดการมลพิษทางอากาศ",
                    "การตรวจวัด": "เทคนิคการตรวจวัดมลพิษทางอากาศจากอุตสาหกรรม",
                    "การวิเคราะห์": "อุตุนิยมวิทยาและแบบจำลองมลพิษทางอากาศ",
                    "การควบคุม": "การประมาณปริมาณมลพิษและการออกแบบอุปกรณ์ควบคุมมลพิษทางอากาศ"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 43,
        "details": [
            {
                "category": "วคม.371 กระบวนการทางวิศวกรรมเคมีและการเยี่ยมชมโรงงาน",
                "subcategories": {
                    "รหัสวิชา": "CHE371",
                    "ชื่อวิชาภาษาอังกฤษ": "Chemical Process Engineering and Industrial Trips",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหารายวิชา": {
                        "โครงสร้างกระบวนการทางเคมี": "โครงสร้างของกระบวนการทางเคมี แผนภาพกระบวนการทางเคมีในรูปแบบต่าง ๆ",
                        "วัสดุก่อสร้าง": "วัสดุก่อสร้างสำหรับอุปกรณ์ในกระบวนการทางเคมี",
                        "แนวคิดหน่วยกระบวนการ": "แนวคิดเกี่ยวกับหน่วยกระบวนการและหน่วยปฏิบัติการ",
                        "หลักการถ่ายโอน": "หลักการพื้นฐานและการประยุกต์ใช้หน่วยกระบวนการที่เกี่ยวกับการถ่านโอนโมเมนตัม พลังงาน และมวล",
                        "เครื่องปฏิกรณ์": "หลักการพื้นฐานและการประยุกต์ใช้หน่วยกระบวนการหรือเครื่องปฏิกรณ์",
                        "ระบบสนับสนุน": "ระบบสนับสนุนและการบำรุงรักษาของกระบวนการทางเคมี",
                        "ปัจจัยด้านความปลอดภัยและสิ่งแวดล้อม": "ปัจจัยทางด้านความปลอดภัยและสิ่งแวดล้อมของกระบวนการทางเคมี",
                        "กรณีศึกษา": "ตัวอย่างกระบวนการทางเคมี",
                        "การเยี่ยมชมโรงงาน": "การเยี่ยมชมโรงงานอุตสาหกรรม"
                    }
                }
            },
            {
                "category": "วคม.372 พื้นฐานอุปกรณ์และเครื่องมือวัดในกระบวนการผลิตของอุตสาหกรรมเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE372",
                    "ชื่อวิชาภาษาอังกฤษ": "Basic Industrial Process Equipment and Instrument in Chemical Industries",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหารายวิชา": {
                        "ภาพรวมการออกแบบและเริ่มการผลิต": "ภาพรวมของกระบวนการออกแบบและการเริ่มการผลิตของโรงงานในอุตสาหกรรมเคมีและปิโตรเคมี",
                        "การวิเคราะห์และออกแบบ PFD และ P&ID": "การวิเคราะห์และออกแบบ PFD และ P&ID",
                        "หลักการวัดและเลือกใช้อุปกรณ์": "หลักการวัดและการเลือกใช้อุปกรณ์การวัดและอุปกรณ์ควบคุมกระบวนการ",
                        "เทคนิคการเชื่อมต่ออุปกรณ์": "เทคนิคการเชื่อมต่ออุปกรณ์วัดและควบคุมต่าง ๆ",
                        "อุปกรณ์การวัดและควบคุม": "อุปกรณ์การวัดและควบคุมอุณหภูมิ ความดัน ระดับ อัตราการไหล pH และองค์ประกอบของสารในเชิงอุตสาหกรรม",
                        "การออกแบบพื้นฐานของระบบ": "การออกแบบพื้นฐานของระบบท่อ ปั๊ม วาล์ว แอกชูเอเตอร์ ถังและถังความดัน",
                        "ปฏิบัติการ": "ปฏิบัติการด้านอุปกรณ์การวัด เทคนิคการวัดและการควบคุมกระบวนการ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 27,
        "details": [
            {
                "category": "วิชาศึกษาทั่วไป",
                "subcategories": {
                    "มธ.102_ชีวิตกับสุนทรียภาพ": {
                        "รหัสวิชา": "มธ.102",
                        "ชื่อภาษาอังกฤษ": "TU102 Life & Aesthetics",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "สุนทรียภาพและองค์ประกอบพื้นฐานของงานศิลปะและสภาพแวดล้อมสรรค์สร้าง ความซาบซึ้งในคุณค่าและความหมาย การวิเคราะห์วิพากษ์ และการเชื่อมโยงเข้ากับชีวิตตนเองและบริบททางสังคม",
                        "คำอธิบายภาษาอังกฤษ": "The course investigates aesthetic and fundamental elements of art and built environment. These include appreciation in value and meaning, analyses and criticisms, and connections to lives and social contexts."
                    },
                    "มธ.106_ความคิดสร้างสรรค์และการสื่อสาร": {
                        "รหัสวิชา": "มธ.106",
                        "ชื่อภาษาอังกฤษ": "TU106 Creativity and Communication",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "กระบวนการคิดอย่างสร้างสรรค์ โดยมีการคิดเชิงวิพากษ์เป็นองค์ประกอบสำคัญ และการสื่อสารความคิดดังกล่าวให้เกิดผลสัมฤทธิ์อย่างเหมาะสมตามบริบทสังคม วัฒนธรรม สภาพแวดล้อม ทั้งในระดับบุคคล องค์กร และสังคม",
                        "คำอธิบายภาษาอังกฤษ": "Creative thought processes, with critical thinking as an important part, as well as communication of these thoughts that lead to suitable results in social, cultural and environmental contexts, at personal, organisational and social levels."
                    }
                }
            },
            {
                "category": "หมวดคณิตศาสตร์ วิทยาศาสตร์ และเทคโนโลยี",
                "subcategories": {
                    "วท.123_เคมีพื้นฐาน": {
                        "รหัสวิชา": "วท.123",
                        "ชื่อภาษาอังกฤษ": "SC123 Fundamental Chemistry",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "โครงสร้างอะตอม ปริมาณสารสัมพันธ์ พันธะเคมี สมบัติธาตุเรพิเซนเททีฟและแทรนซิชัน แก๊ส ของเหลวและสารละลาย ของแข็ง อุณหเคมี จลนพลศาสตร์ สมดุลเคมีกรด-เบส เคมีไฟฟ้า",
                        "คำอธิบายภาษาอังกฤษ": "Atomic structure, Stoichiometry, Chemical bonds, Properties of Representative and Transition Elements, Gases, Liquids and Solutions, Solids, themochemistry, Chemical Kinetics, Chemical Equilibrium and Acid and Base and Electrochemistry."
                    },
                    "วพ.101_การเขียนโปรแกรมคอมพิวเตอร์เบื้องต้น": {
                        "รหัสวิชา": "วพ.101",
                        "ชื่อภาษาอังกฤษ": "CN101 Introduction to Computer Programming",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "หลักการพื้นฐานคอมพิวเตอร์ องค์ประกอบคอมพิวเตอร์การทำงานร่วมกับฮาร์ดแวร์และซอฟต์แวร์ การเขียนโปรแกรมภาษาคอมพิวเตอร์ การฝึกฝนการเขียนโปรแกรมคอมพิวเตอร์"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 10,
        "details": [
            {
                "category": "โครงสร้างหลักสูตร",
                "subcategories": {
                    "กลุ่มวิชาพื้นฐานทางวิศวกรรม": "7 หน่วยกิต",
                    "วิชาเฉพาะด้าน": "89 หน่วยกิต",
                    "กลุ่มวิชาบังคับทางวิศวกรรมเคมี": "74 หน่วยกิต",
                    "กลุ่มวิชาเลือกทางวิศวกรรมเคมี": "15 หน่วยกิต",
                    "วิชาเลือกเสรี": "6 หน่วยกิต",
                    "รวม": "150 หน่วยกิต"
                }
            },
            {
                "category": "รายวิชาในหลักสูตร",
                "subcategories": {
                    "รหัสวิชา": {
                        "อักษรย่อ": "วคม./ CHE หมายถึง อักษรย่อของสาขาวิชาวิศวกรรมเคมี",
                        "เลขหลักหน่วย": {
                            "เลข 0-5": "วิชาบังคับ",
                            "เลข 6-9": "วิชาเลือก"
                        },
                        "เลขหลักสิบ": {
                            "เลข 0": "วิชาในหมวดวิชาเคมี วิศวกรรมเคมีพื้นฐานหัวข้อพิเศษ",
                            "เลข 1": "วิชาในหมวดวิชาเธอร์โมไดนามิกส์ พลังงาน การถ่ายเทความร้อน ปฏิกิริยาเคมี",
                            "เลข 2": "วิชาในหมวดวิชาสิ่งแวดล้อม ความปลอดภัย",
                            "เลข 3": "วิชาในหมวดวิชากลศาสตร์ของไหล การถ่ายโอนมวล กระบวนการแยกสาร",
                            "เลข 4": "วิชาในหมวดวิชาวัสดุศาสตร์",
                            "เลข 5": "วิชาในหมวดวิชาคณิตศาสตร์และการจำลอง",
                            "เลข 6": "วิชาในหมวดวิชาชีววิทยา วิทยาศาสตร์สุขภาพ",
                            "เลข 7": "วิชาในหมวดวิชาการออกแบบ การจัดการ",
                            "เลข 8": "วิชาในหมวดวิชาปฏิบัติการ ฝึกงาน สัมมนา",
                            "เลข 9": "วิชาในหมวดวิชาวิจัย สหกิจศึกษา"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 14,
        "details": [
            {
                "category": "วิชาพื้นฐานทางวิศวกรรมเคมี",
                "subcategories": {
                    "วคม.213": "เธอร์โมไดนามิกส์สาหรับวิศวกรรมเคมี 1, 3 (3-0-6), CHE213 Chemical Engineering Thermodynamics I",
                    "วคม.233": "กลศาสตร์ของไหลสำหรับวิศวกรเคมี, 3 (3-0-6), CHE233 Fluid Mechanics for Chemical Engineers",
                    "วคม.250": "การแก้ปัญหากระบวนการทางวิศวกรรมเคมี, 3 (3-0-6), CHE250 Problem solving in chemical engineering processes",
                    "วคม.280": "การเขียนเชิงเทคนิคสำหรับวิศวกรเคมี, 1 (0-3-3), CHE280 Technical Writing for Chemical Engineers",
                    "วคม.284": "ปฏิบัติการเคมีสำหรับวิศวกรเคมี 1, 1 (0-3-3), CHE284 Chemistry Laboratory for Chemical Engineers I",
                    "วคม.285": "ปฏิบัติการเคมีสำหรับวิศวกรเคมี 2, 1 (0-3-3), CHE285 Chemistry Laboratory for Chemical Engineers II"
                }
            },
            {
                "category": "วิชาเฉพาะทางวิศวกรรมเคมี",
                "subcategories": {
                    "วคม.311": "การถ่ายเทความร้อนสาหรับวิศวกรเคมี, 3 (3-0-6), CHE311 Heat Transfer for Chemical Engineers",
                    "วคม.314": "เธอร์โมไดนามิกส์สาหรับวิศวกรรมเคมี 2, 3 (3-0-6), CHE314 Chemical Engineering Thermodynamics II",
                    "วคม.315": "วิศวกรรมปฏิกิริยา, 3 (3-0-6), CHE315 Reaction Engineering",
                    "วคม.334": "การถ่ายโอนมวลสำหรับวิศวกรเคมี, 3 (3-0-6), CHE334 Mass Transfer for Chemical Engineers",
                    "วคม.335": "กระบวนการแยกสำหรับวิศวกรเคมี, 3 (3-0-6), CHE335 Separation Processes for Chemical Engineers"
                }
            },
            {
                "category": "วิชาเฉพาะด้านอุตสาหกรรมและความปลอดภัย",
                "subcategories": {
                    "วคม.320": "การบำบัดของเสียจากอุตสาหกรรม, 3 (3-0-6), CHE320 Industrial Waste Treatment",
                    "วคม.323": "ความปลอดภัยทางวิศวกรรมเคมี, 3 (3-0-6), CHE323 Chemical Engineering Safety"
                }
            },
            {
                "category": "วิชาด้านกระบวนการและอุปกรณ์",
                "subcategories": {
                    "วคม.371": "กระบวนการทางวิศวกรรมเคมีและการเยี่ยมชมโรงงาน, 3 (3-0-6), CHE371 Chemical Process Engineering and Industrial Trips",
                    "วคม.372": "พื้นฐานอุปกรณ์และเครื่องมือวัดในกระบวนการผลิตของอุตสาหกรรมเคมี, 3 (3-0-6), CHE372 Basic Industrial Process Equipment and Instrument in Chemical Industries"
                }
            },
            {
                "category": "วิชาด้านเศรษฐศาสตร์",
                "subcategories": {
                    "วคม.373": "เศรษฐศาสตร์วิศวกรรมเคมี, 2 (2-0-4), CHE373 Chemical Engineering Economics"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 5,
        "details": [
            {
                "category": "หมวดที่ 3 ปรัชญา วัตถุประสงค์ และผลลัพธ์การเรียนรู้ของหลักสูตร",
                "subcategories": {
                    "3.1_ความสอดคล้องของหลักสูตรกับทิศทางนโยบายและยุทธศาสตร์การพัฒนากำลังคน_และยุทธศาสตร์มหาวิทยาลัย": {
                        "วิสัยทัศน์ประเทศไทย": "ประเทศไทยมีความมั่นคง มั่งคั่ง ยั่งยืน เป็นประเทศพัฒนาแล้ว ด้วยการพัฒนาตามหลักปรัชญาของเศรษฐกิจพอเพียง",
                        "คติพจน์ประจำชาติ": "มั่นคง มั่งคั่ง ยั่งยืน",
                        "แผนยุทธศาสตร์ชาติ_6_ด้าน": [
                            "ยุทธศาสตร์ด้านความมั่นคง",
                            "ยุทธศาสตร์ด้านการสร้างความสามารถในการแข่งขัน",
                            "ยุทธศาสตร์ชาติด้านการพัฒนาและเสริมสร้างศักยภาพทรัพยากรมนุษย์",
                            "ยุทธศาสตร์ชาติด้านการสร้างโอกาสและความเสมอภาคทางสังคม",
                            "ยุทธศาสตร์ชาติด้านการสร้างการเติบโตบนคุณภาพชีวิตที่เป็นมิตรกับสิ่งแวดล้อม",
                            "ยุทธศาสตร์ชาติด้านการปรับสมดุลและพัฒนาระบบการบริหารจัดการภาครัฐ"
                        ],
                        "สถานการณ์เศรษฐกิจ": {
                            "อัตราการขยายตัวทางเศรษฐกิจ_10_ปีที่ผ่านมา": "ร้อยละ 3 ต่อปี",
                            "ความจำเป็นในการพัฒนา": "ปรับเปลี่ยนรูปแบบการพัฒนาเศรษฐกิจและสังคม"
                        },
                        "แนวทางการพัฒนาประเทศ": {
                            "ฐานความเข้มแข็ง": [
                                "ความหลากหลายทางชีวภาพ",
                                "ความหลากหลายทางวัฒนธรรม"
                            ],
                            "เป้าหมาย": [
                                "เป็นเจ้าของสินค้าและบริการมูลค่าสูง",
                                "ยกระดับมูลค่าในห่วงโซ่การผลิตสินค้าและบริการ",
                                "นำเทคโนโลยีนวัตกรรมดิจิทัลสมัยใหม่มาใช้",
                                "สร้างการเติบโตทางเศรษฐกิจอย่างยั่งยืน",
                                "กระจายรายได้ โอกาส และความมั่งคั่งแบบทั่วถึง (Inclusive Growth)"
                            ]
                        },
                        "โมเดลเศรษฐกิจใหม่": {
                            "ชื่อ": "BCG Model",
                            "องค์ประกอบ": [
                                "เศรษฐกิจชีวภาพ (Bioeconomy)",
                                "เศรษฐกิจหมุนเวียน (Circular Economy)",
                                "เศรษฐกิจสีเขียว (Green Economy)"
                            ],
                            "ความสอดคล้อง": [
                                "เป้าหมายการพัฒนาที่ยั่งยืน (SDGs)",
                                "หลักการของปรัชญาเศรษฐกิจพอเพียง (SEP)"
                            ]
                        },
                        "การปรับปรุงหลักสูตร": "ภาควิชาวิศวกรรมเคมี มหาวิทยาลัยธรรมศาสตร์ สอดแทรกและเน้นองค์ความรู้ที่จำเป็นสำหรับโมเดลเศรษฐกิจใหม่ของประเทศ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 33,
        "details": [
            {
                "category": "วท.133 ฟิสิกส์สำหรับวิศวกร 2",
                "subcategories": {
                    "วิชาบังคับก่อน": "เคยศึกษา วท.133",
                    "เนื้อหา": {
                        "ไฟฟ้า": [
                            "ประจุไฟฟ้าและสนามไฟฟ้า",
                            "กฎของเกาส์",
                            "ศักย์ไฟฟ้า",
                            "ความจุไฟฟ้า",
                            "ไดอิเล็กทริก",
                            "กระแสไฟฟ้า",
                            "วงจรไฟฟ้ากระแสตรงและอุปกรณ์"
                        ],
                        "แม่เหล็ก": [
                            "แม่เหล็กและแม่เหล็กไฟฟ้า",
                            "การเหนี่ยวนำแม่เหล็กและกฎของฟาราเดย์",
                            "ตัวเหนี่ยวนำ"
                        ],
                        "วงจรไฟฟ้ากระแสสลับ": "วงจรไฟฟ้ากระแสสลับ",
                        "ทฤษฎีแม่เหล็กไฟฟ้าและการประยุกต์": "ทฤษฎีแม่เหล็กไฟฟ้าและการประยุกต์",
                        "แสง": [
                            "แสง",
                            "เลนส์และเครื่องมือทางแสง",
                            "การสะท้อน",
                            "การหักเห",
                            "การเลี้ยวเบน",
                            "การแทรกสอดและการโพลาไรซ์"
                        ],
                        "ฟิสิกส์สมัยใหม่": "ฟิสิกส์สมัยใหม่"
                    }
                }
            },
            {
                "category": "วท.173 ปฏิบัติการเคมีพื้นฐาน",
                "subcategories": {
                    "หน่วยกิต": "1 (0-3-0)",
                    "วิชาบังคับก่อน": "เคยศึกษา หรือศึกษาพร้อมกับ วท.123",
                    "คำอธิบายรายวิชา": "ปฏิบัติการเสริมความรู้ทางทฤษฎีรายวิชา วท.123",
                    "Prerequisite": "Have taken SC123 or taking SC123 in the same semester",
                    "Course Description": "Experiments related to the contents in SC123"
                }
            },
            {
                "category": "วท.183 ปฏิบัติการฟิสิกส์สำหรับวิศวกร 1",
                "subcategories": {
                    "หน่วยกิต": "1 (0-3-0)",
                    "เนื้อหาปฏิบัติการ": [
                        "การวัดและความคลาดเคลื่อน",
                        "แรงและการเคลื่อนที่",
                        "พลังงาน",
                        "โมเมนตัม",
                        "คลื่น",
                        "ความร้อน"
                    ],
                    "Laboratory practices": [
                        "measurement and errors",
                        "force and motion",
                        "energy",
                        "momentum",
                        "waves",
                        "heat"
                    ]
                }
            },
            {
                "category": "วท.184 ปฏิบัติการฟิสิกส์สำหรับวิศวกร 2",
                "subcategories": {
                    "หน่วยกิต": "1 (0-3-0)",
                    "เนื้อหาปฏิบัติการ": [
                        "สนามแม่เหล็กไฟฟ้า",
                        "วงจรและเครื่องมือวัดทางไฟฟ้า",
                        "ทัศนศาสตร์",
                        "ฟิสิกส์ยุคใหม่"
                    ],
                    "Laboratory practices": [
                        "electro-magnetic fields",
                        "electric circuits and instruments",
                        "optics",
                        "modern physics"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 48,
        "details": [
            {
                "category": "กลุ่มวิชาเลือกทางวิศวกรรมเคมี",
                "subcategories": {
                    "รูปแบบที่_1": "เน้นการวิจัย",
                    "วิชา": [
                        {
                            "รหัสวิชา": "วคม.496",
                            "ชื่อวิชาภาษาไทย": "การวิจัยระดับปริญญาตรี 1",
                            "ชื่อวิชาภาษาอังกฤษ": "Research for Undergraduates I",
                            "หน่วยกิต": "3 (0-9-6)",
                            "วิชาบังคับก่อน": "เคยเรียนวิชาบังคับเฉพาะสาขาวิชาวิศวกรรมเคมีตามโครงสร้างหลักสูตรที่กำหนดไว้ ไม่น้อยกว่า 43 หน่วยกิต",
                            "คำอธิบายรายวิชาภาษาไทย": "นักศึกษาทำงานวิจัยในหัวข้อวิจัยเพื่อสร้างองค์ความรู้ใหม่หรือพัฒนาความรู้เพื่อนำไปประยุกต์ใช้ในอุตสาหกรรม โดยเริ่มต้นจากการทบทวนงานวิจัยที่ผ่านมา การศึกษาระเบียบวิธีวิจัย และการเตรียมข้อเสนอโครงงานวิจัยในรูปแบบที่กำหนด การวัดผลทำโดยอาจารย์ที่ปรึกษาซึ่งจะพิจารณาจากคุณภาพของข้อเสนอโครงงาน และคณะกรรมการสอบซึ่งจะพิจารณาจากความเข้าใจของนักศึกษาในงานวิจัยที่จะทำและการนำเสนอผลงานวิจัยเบื้องต้นหรือนาเสนอความเป็นไปได้ของโครงงานวิจัย",
                            "คำอธิบายรายวิชาภาษาอังกฤษ": "The students are trained to do research in the fields of chemical engineering to bring up a new understanding or develop existing ideas and apply those for industrial purposes. The process begins with a revision of past related research, followed by learning about research methodology and proposal preparation for a research project. The evaluation is up to both the advisor who considers the academic quality of the proposal and the committee who consider how well the students present their ideas and how well they understand the research problems."
                        },
                        {
                            "รหัสวิชา": "วคม.497",
                            "ชื่อวิชาภาษาไทย": "การวิจัยระดับปริญญาตรี 2",
                            "ชื่อวิชาภาษาอังกฤษ": "Research for Undergraduates II",
                            "หน่วยกิต": "3 (0-9-6)",
                            "วิชาบังคับก่อน": "สอบได้ วคม.496"
                        }
                    ]
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 1,
        "details": [
            {
                "category": "รายละเอียดของหลักสูตร",
                "subcategories": {
                    "ชื่อสถาบันอุดมศึกษา": "มหาวิทยาลัยธรรมศาสตร์",
                    "คณะ/วิทยาลัย/สถาบัน": "คณะวิศวกรรมศาสตร์"
                }
            },
            {
                "category": "หมวดที่ 1 ข้อมูลทั่วไป",
                "subcategories": {
                    "1.1 รหัสและชื่อหลักสูตร": {
                        "รหัสหลักสูตร": "25400051100123",
                        "ชื่อหลักสูตร": {
                            "ภาษาไทย": "หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี",
                            "ภาษาอังกฤษ": "Bachelor of Engineering Program in Chemical Engineering"
                        }
                    },
                    "1.2 ชื่อปริญญาและสาขาวิชา": {
                        "ภาษาไทย": {
                            "ชื่อเต็ม": "วิศวกรรมศาสตรบัณฑิต (วิศวกรรมเคมี)",
                            "ชื่อย่อ": "วศ.บ. (วิศวกรรมเคมี)"
                        },
                        "ภาษาอังกฤษ": {
                            "ชื่อเต็ม": "Bachelor of Engineering (Chemical Engineering)",
                            "ชื่อย่อ": "B.Eng. (Chemical Engineering)"
                        }
                    },
                    "1.3 วิชาเอก (ถ้ามี)": "ไม่มี",
                    "1.4 รูปแบบของหลักสูตร": {
                        "1.4.1 รูปแบบ": "หลักสูตรระดับปริญญาตรี 4 ปี",
                        "1.4.2 ประเภทของหลักสูตร": "หลักสูตรปริญญาตรีทางวิชาการ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 47,
        "details": [
            {
                "category": "การทดลองและปฏิบัติการ",
                "subcategories": {
                    "หัวข้อการทดลอง": "การแยกสารโดยใช้อุปกรณ์ทางวิศวกรรมเคมี",
                    "พื้นฐานทฤษฎี": [
                        "กลศาสตร์ของไหล",
                        "การถ่ายเทความร้อน",
                        "การถ่ายโอนมวล"
                    ],
                    "ความปลอดภัย": "การใช้อุปกรณ์ความปลอดภัยในการทำปฏิบัติการ",
                    "การออกแบบการทดลอง": "นักศึกษาออกแบบเองเพื่อให้ได้ตามวัตถุประสงค์ของแต่ละหัวข้อปฏิบัติการ",
                    "ตัวอย่างหัวข้อปฏิบัติการ": [
                        "หอดูดซึม",
                        "หอดูดซับ",
                        "หอกลั่น",
                        "การกรอง"
                    ],
                    "วิชาบังคับก่อน": "CHE335"
                }
            },
            {
                "category": "วิชาบังคับนอกสาขา",
                "subcategories": {
                    "วย.202 กลศาสตร์วิศวกรรม - สถิตยศาสตร์": {
                        "รหัสวิชา": "CE202",
                        "ชื่อภาษาอังกฤษ": "Engineering Mechanics – Statics",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "วท.133",
                        "เนื้อหาวิชา": [
                            "ระบบของแรง",
                            "กฏของนิวตัน",
                            "แรงลัพธ์",
                            "สมดุลของแรง และโมเมนต์",
                            "จุดศูนย์กลางของวัตถุ",
                            "จุดศูนย์กลางมวล",
                            "จุดศูนย์ถ่วง",
                            "ทฤษฏีของแปปปัส",
                            "โมเมนต์ความเฉื่อยของพื้นที่",
                            "การประยุกต์สมการสมดุลกับโครงสร้างและเครื่องจักร",
                            "คาน",
                            "ความรู้เบื้องต้นในการวิเคราะห์หาโมเมนต์ดัด และแรงเฉือน",
                            "ความฝืด",
                            "การวิเคราะห์โดยใช้หลักของงานเสมือน",
                            "ความรู้เบื้องต้นเกี่ยวกับพลศาสตร์"
                        ]
                    },
                    "วอ.261 สถิติวิศวกรรม": {
                        "รหัสวิชา": "IE261",
                        "ชื่อภาษาอังกฤษ": "Engineering Statistics",
                        "หน่วยกิต": "3 (3-0-6)",
                        "เนื้อหาวิชา": [
                            "การนำเสนอและการวิเคราะห์ข้อมูล",
                            "ทฤษฎีความน่าจะเป็น",
                            "การแจกแจงทางสถิติ",
                            "ทฤษฎีการสุ่มตัวอย่าง",
                            "การประมาณค่า",
                            "การอนุมานทางสถิติ",
                            "การทดสอบสมมติฐาน",
                            "การวิเคราะห์ความแปรปรวน",
                            "การวิเคราะห์การถดถอยและสหสัมพันธ์",
                            "การใช้วิธีการทางสถิติในการแก้ไขปัญหา",
                            "การประยุกต์สถิติในเชิงวิศวกรรม"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 62,
        "details": [
            {
                "category": "วคม.366 วิศวกรรมชีวเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE366",
                    "ชื่อวิชาภาษาอังกฤษ": "Biochemical Engineering",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เคยศึกษา วคม.315",
                    "คำอธิบายรายวิชา": {
                        "ภาษาไทย": "การประยุกต์หลักการพื้นฐานทางวิศวกรรมเคมีในอุตสาหกรรมที่เกี่ยวข้องกับกระบวนการทางชีวเคมีและทางชีวภาพ แนวคิดพื้นฐานของจุลชีววิทยา ชีวเคมีและพันธุศาสตร์ระดับโมเลกุล สำหรับวิศวกรเคมี จลนพลศาสตร์ของเอนไซม์ที่ละลายได้และเอมไซม์ที่ยึดตรึง จลนพลศาสตร์ของการเติบโตเซลล์ เพาะปลูกจุลินทรีย์ ออกแบบและวิเคราะห์เครื่องปฏิกรณ์ทางชีวภาพ วิชาการเครื่องมือและการควบคุม การคืนสภาพและการแยกของผลิตภัณฑ์ทางชีวภาพ",
                        "ภาษาอังกฤษ": "Application of basic chemical engineering principles to biochemical and biological process industries. Relevant basic concepts of microbiology, biochemistry, and molecular genetics. Soluble and immobilized enzyme kinetics, cell growth kinetics, microbial cultures. Bioreactor design and analysis. Instrumentation and control. Biological product recovery and separation."
                    }
                }
            },
            {
                "category": "วคม.368 เทคโนโลยีชีวภาพสำหรับวิศวกรรมเคมี",
                "subcategories": {
                    "รหัสวิชา": "CHE368",
                    "ชื่อวิชาภาษาอังกฤษ": "Biotechnology for Chemical Engineering",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา": {
                        "ภาษาไทย": "เทคนิคเทคโนโลยีชีวภาพสมัยใหม่และประโยชน์ต่องานวิจัยและอุตสาหกรรมในปัจจุบัน เทคโนโลยีเกี่ยวกับสารพันธุกรรม การโคลนนิ่ง วิศวกรรมเมตาบอลิซึ่ม วิศวกรรมโปรตีน การทำให้โปรตีนบริสุทธิ์ หลักการทางวิศวกรรมเคมีที่เกี่ยวข้องในกระบวนการผลิตปลายน้ำของเทคโนโลยีชีวภาพในระบบอุตสาหกรรม",
                        "ภาษาอังกฤษ": "Modern biotechnology techniques and their impact in current research and industries. DNA technology. Cloning. Metabolic engineering. Protein engineering. Protein purification. Chemical engineering principles involved in downstream processing in industrial biotechnology."
                    }
                }
            },
            {
                "category": "กลุ่มอื่น ๆ",
                "subcategories": {
                    "วคม.406": {
                        "ชื่อวิชา": "หัวข้อพิเศษทางวิศวกรรมเคมี 1",
                        "รหัสวิชา": "CHE406",
                        "ชื่อวิชาภาษาอังกฤษ": "Special Topics in Chemical Engineering I",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": {
                            "ภาษาไทย": "หัวข้อที่น่าสนใจและทันสมัยทางวิศวกรรมเคมี",
                            "ภาษาอังกฤษ": "Current interesting topics and modern developments in various fields of chemical engineering."
                        }
                    },
                    "วคม.407": {
                        "ชื่อวิชา": "หัวข้อพิเศษทางวิศวกรรมเคมี 2",
                        "รหัสวิชา": "CHE407",
                        "ชื่อวิชาภาษาอังกฤษ": "Special Topics in Chemical Engineering II",
                        "หน่วยกิต": "3 (3-0-6)"
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 22,
        "details": [
            {
                "category": "เลือกเรียนรูปแบบที่ 1 เน้นการวิจัย",
                "subcategories": {
                    "ปีการศึกษาที่ 4": {
                        "ภาคเรียนที่ 1": [
                            {
                                "รายวิชา": "มธ.102 ชีวิตกับสุนทรียภาพ/ มธ.106 ความคิดสร้างสรรค์และการสื่อสาร",
                                "หน่วยกิต": 3
                            },
                            {
                                "รายวิชา": "วคม.461 พลศาสตร์ของกระบวนการและการควบคุม",
                                "หน่วยกิต": 3
                            },
                            {
                                "รายวิชา": "วคม.474 การออกแบบกระบวนการผลิตและการออกแบบโรงงาน",
                                "หน่วยกิต": 3
                            },
                            {
                                "รายวิชา": "วคม.480 สัมมนาทางวิศวกรรมเคมี",
                                "หน่วยกิต": 1
                            },
                            {
                                "รายวิชา": "วคม.482 ปฏิบัติการทางวิศวกรรมเคมี 2",
                                "หน่วยกิต": 1
                            },
                            {
                                "รายวิชา": "วคม.496 การวิจัยระดับปริญญาตรี 1",
                                "หน่วยกิต": 3
                            },
                            {
                                "รายวิชา": "วคม.xxx วิชาเลือก",
                                "หน่วยกิต": 3
                            },
                            {
                                "รวมหน่วยกิต": 17
                            }
                        ],
                        "ภาคเรียนที่ 2": [
                            {
                                "รายวิชา": "วคม.497 การวิจัยระดับปริญญาตรี 2",
                                "หน่วยกิต": 3
                            },
                            {
                                "รายวิชา": "วคม.xxx วิชาเลือก",
                                "หน่วยกิต": 3
                            },
                            {
                                "รวมหน่วยกิต": 6
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 20,
        "details": [
            {
                "category": "ปีการศึกษาที่ 2",
                "subcategories": {
                    "ภาคเรียนที่ 1": {
                        "หน่วยกิตรวม": 20,
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "มธ.101",
                                "ชื่อวิชา": "โลก อาเซียน และไทย",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "มธ.109",
                                "ชื่อวิชา": "นวัตกรรมกับกระบวนการคิดผู้ประกอบการ",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "มธ.108",
                                "ชื่อวิชา": "การพัฒนาและจัดการตนเอง",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "ค.214",
                                "ชื่อวิชา": "สมการเชิงอนุพันธ์",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.200",
                                "ชื่อวิชา": "เคมีอินทรีย์และชีวเคมี",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.205",
                                "ชื่อวิชา": "สมดุลมวลสารและพลังงาน",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.280",
                                "ชื่อวิชา": "การเขียนเชิงเทคนิคสำหรับวิศวกรรมเคมี",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วคม.284",
                                "ชื่อวิชา": "ปฏิบัติการเคมีสำหรับวิศวกรรมเคมี 1",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "XX xxx",
                                "ชื่อวิชา": "วิชาเลือกเสรี",
                                "หน่วยกิต": 3
                            }
                        ]
                    },
                    "ภาคเรียนที่ 2": {
                        "หน่วยกิตรวม": 22,
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "วคม.201",
                                "ชื่อวิชา": "เคมีประยุกต์สำหรับวิศวกรเคมี",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.202",
                                "ชื่อวิชา": "วิศวกรรมไฟฟ้าเบื้องต้นสำหรับวิศวกรเคมี",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.213",
                                "ชื่อวิชา": "เธอร์โมไดนามิกส์สำหรับวิศวกรรมเคมี 1",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.233",
                                "ชื่อวิชา": "กลศาสตร์ของไหลสำหรับวิศวกรเคมี",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.250",
                                "ชื่อวิชา": "การแก้ปัญหากระบวนการทางวิศวกรรมเคมี",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วคม.285",
                                "ชื่อวิชา": "ปฏิบัติการเคมีสำหรับวิศวกรรมเคมี 2",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วย.202",
                                "ชื่อวิชา": "กลศาสตร์วิศวกรรม - สถิตยศาสตร์",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วอ.261",
                                "ชื่อวิชา": "สถิติวิศวกรรม",
                                "หน่วยกิต": 3
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 16,
        "details": [
            {
                "category": "รูปแบบการศึกษา",
                "subcategories": {
                    "รูปแบบที่_3": "เลือกเรียนวิชาโท",
                    "รายละเอียด": "นักศึกษาต้องศึกษาวิชาจากรายวิชาที่กำหนดให้เป็นวิชาโทของสาขาวิชาใดวิชาหนึ่ง (นอกเหนือไปจากสาขาวิศวกรรมเคมี) ที่เปิดสอนในมหาวิทยาลัยธรรมศาสตร์ จำนวนไม่น้อยกว่า 15 หน่วยกิต",
                    "เงื่อนไข": "นักศึกษาจะมีสิทธิได้รับวิชาโทในสาขานั้นก็ต่อเมื่อนักศึกษาได้ศึกษารายวิชาต่าง ๆ เพิ่มเติมตามข้อกำหนดและเงื่อนไขของหลักสูตรวิชาโทของสาขานั้น"
                }
            },
            {
                "category": "วิชาเลือกในสาขาวิศวกรรมเคมี",
                "subcategories": {
                    "กลุ่มพลังงาน": {
                        "วคม.316": {
                            "ชื่อวิชา": "ปิโตรเลียมและเชื้อเพลิงทดแทน",
                            "รหัสวิชาภาษาอังกฤษ": "CHE316",
                            "ชื่อวิชาภาษาอังกฤษ": "Petroleum and Alternative fuel",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        "วคม.317": {
                            "ชื่อวิชา": "อุตสาหกรรมปิโตรเคมี",
                            "รหัสวิชาภาษาอังกฤษ": "CHE317",
                            "ชื่อวิชาภาษาอังกฤษ": "Petrochemical Industry",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        "วคม.318": {
                            "ชื่อวิชา": "วิศวกรรมเร่งปฏิกิริยา",
                            "รหัสวิชาภาษาอังกฤษ": "CHE318",
                            "ชื่อวิชาภาษาอังกฤษ": "Catalytic Engineering",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        "วคม.319": {
                            "ชื่อวิชา": "เทคโนโลยีเชื้อเพลิงสะอาด",
                            "รหัสวิชาภาษาอังกฤษ": "CHE319",
                            "ชื่อวิชาภาษาอังกฤษ": "Clean Fuel Technology",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        "วคม.376": {
                            "ชื่อวิชา": "การจัดการและการอนุรักษ์พลังงาน",
                            "รหัสวิชาภาษาอังกฤษ": "CHE376",
                            "ชื่อวิชาภาษาอังกฤษ": "Energy Management and Energy Conservation",
                            "หน่วยกิต": "3 (3-0-6)"
                        }
                    },
                    "กลุ่มสิ่งแวดล้อม": {
                        "วคม.326": {
                            "ชื่อวิชา": "การป้องกันมลพิษ",
                            "รหัสวิชาภาษาอังกฤษ": "CHE326",
                            "ชื่อวิชาภาษาอังกฤษ": "Pollution Prevention",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        "วคม.327": {
                            "ชื่อวิชา": "การประเมินวัฏจักรชีวิตของผลิตภัณฑ์",
                            "รหัสวิชาภาษาอังกฤษ": "CHE327",
                            "ชื่อวิชาภาษาอังกฤษ": "Life Cycle Assessment of Products",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        "วคม.328": {
                            "ชื่อวิชา": "การวิเคราะห์ปัจจัยการผลิตและผลผลิตสำหรับการจัดการสิ่งแวดล้อม",
                            "รหัสวิชาภาษาอังกฤษ": "CHE328",
                            "ชื่อวิชาภาษาอังกฤษ": "Environmental input-output analysis",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        "วคม.329": {
                            "ชื่อวิชา": "การจัดการคาร์บอนสำหรับภาคธุรกิจและอุตสาหกรรม",
                            "รหัสวิชาภาษาอังกฤษ": "CHE329",
                            "ชื่อวิชาภาษาอังกฤษ": "Carbon management for business and industry",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        "วคม.336": {
                            "ชื่อวิชา": "เทคโนโลยีการทำน้ำบริสุทธิ์",
                            "รหัสวิชาภาษาอังกฤษ": "CHE336",
                            "ชื่อวิชาภาษาอังกฤษ": "Water Purification Technologies",
                            "หน่วยกิต": "3 (3-0-6)"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 18,
        "details": [
            {
                "category": "กลุ่มวิชาบังคับ",
                "subcategories": {
                    "CHE358": "Troubleshooting Process Plant Control",
                    "CHE359": "Chemical Engineering Process Simulation",
                    "CHE377": "Chemical Process Design in Petrochemical Industry I",
                    "CHE378": "Design of Experiments for Chemical Engineers"
                }
            },
            {
                "category": "กลุ่มวิชาเลือก",
                "subcategories": {
                    "CHE456": "Applications of Aspen Plus in process simulation",
                    "CHE476": "Chemical Engineering Applications in Food Processing",
                    "CHE477": "Chemical Process Design in Petrochemical Industry II",
                    "CHE478": "Transport Phenomena in Chemical Product Design"
                }
            },
            {
                "category": "กลุ่มเทคโนโลยีชีวภาพและวิทยาศาสตร์ชีวภาพ",
                "subcategories": {
                    "CHE366": "Biology for Chemical Engineering",
                    "CHE367": "Bioprocess Engineering",
                    "CHE368": "Biotechnology for Chemical Engineering"
                }
            },
            {
                "category": "กลุ่มอื่น ๆ",
                "subcategories": {
                    "CHE406": "Special Topics in Chemical Engineering I",
                    "CHE407": "Special Topics in Chemical Engineering II",
                    "CHE408": "Special Topics in Chemical Engineering III",
                    "CHE409": "Special Topics in Chemical Engineering IV"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 2,
        "details": [
            {
                "category": "1.4 ลักษณะของหลักสูตร",
                "subcategories": {
                    "1.4.3 ภาษาที่ใช้": {
                        "options": [
                            "จัดการศึกษาเป็นภาษาไทย",
                            "จัดการศึกษาเป็นภาษาอังกฤษ",
                            "จัดการศึกษาทั้งภาษาไทยและภาษาอังกฤษ",
                            "จัดการศึกษาเป็นภาษาต่างประเทศ ระบุ...................."
                        ]
                    },
                    "1.4.4 ความร่วมมือกับสถาบันอื่น": {
                        "options": [
                            "เป็นหลักสูตรของสถาบันโดยเฉพาะ",
                            "เป็นหลักสูตรที่ได้รับความร่วมมือสนับสนุนจากสถาบันอื่น หรือ เป็นหลักสูตรร่วมกับสถาบันอื่น"
                        ],
                        "note": "ระบุ.... (โดยต้องระบุชื่อสถาบันการศึกษา/หน่วยงานที่ทำความร่วมมือ พร้อมทั้งแนบ MOU)"
                    },
                    "1.4.5 การให้ปริญญาแก่ผู้สำเร็จการศึกษา": {
                        "options": [
                            "ให้ปริญญาเพียงสาขาวิชาเดียว",
                            "ให้ปริญญามากกว่า 1 สาขาวิชา (เช่น ทวิปริญญา) หรือเป็นปริญญาร่วมระหว่างสถาบันอุดมศึกษา)"
                        ]
                    },
                    "1.4.6 สถานภาพของหลักสูตรและการพิจารณาอนุมัติ/เห็นชอบหลักสูตร": {
                        "หลักสูตร": "หลักสูตรปรับปรุง พ.ศ. 2566 ปรับปรุงจากหลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี พ.ศ. 2561",
                        "กำหนดเปิดสอน": "ภาคการศึกษาที่ 1 ปีการศึกษา 2566",
                        "การพิจารณากลั่นกรอง": {
                            "โดย": "คณะกรรมการนโยบายวิชาการ",
                            "ครั้งที่": "1/2566",
                            "วันที่": "1 มีนาคม 2566"
                        },
                        "การอนุมัติ/เห็นชอบ": {
                            "โดย": "สภามหาวิทยาลัย",
                            "ครั้งที่": "…………………….",
                            "วันที่": "…….. เดือน ........................ พ.ศ. ………………"
                        }
                    }
                }
            },
            {
                "category": "1.5 อาชีพที่สามารถประกอบได้หลังสำเร็จการศึกษา",
                "subcategories": {
                    "ลักษณะงาน": [
                        "วิศวกรในอุตสาหกรรมที่มีกระบวนการเปลี่ยนแปลงทางด้านกายภาพ (เช่น โรงกลั่นน้ำมัน)",
                        "วิศวกรในอุตสาหกรรมที่มีกระบวนการเปลี่ยนแปลงทางด้านเคมี (เช่น โรงงานผลิตพอลีเมอร์)",
                        "การออกแบบหรือการสร้างอุปกรณ์",
                        "การออกแบบหรือการสร้างโรงงาน",
                        "การจัดซื้อ",
                        "การขาย",
                        "การควบคุมการผลิต",
                        "การบริการ"
                    ],
                    "หมายเหตุ": "อาชีพที่วิศวกรเคมีสามารถประกอบได้มีความหลากหลายและสามารถแบ่งได้ละเอียดมากขึ้น"
                }
            }
        ]
    },
    {
        "link": "https://engr.tu.ac.th/acrd/file-detail/file-.-2566",
        "document": "4.che66",
        "page": 58,
        "details": [
            {
                "category": "พอลิเมอร์สังเคราะห์และไบโอพลาสติก",
                "subcategories": {
                    "ชนิดและแหล่งที่มา": "Origin of synthetic polymers and bioplastics",
                    "การเรียกชื่อ": "Polymer nomenclature",
                    "ปฏิกิริยาการสังเคราะห์": "Polymer reaction and biopolymer reactions",
                    "เทคนิคการพอลิเมอไรเซชัน": "Polymerization techniques",
                    "การวิเคราะห์คุณสมบัติ": {
                        "น้ำหนักโมเลกุล": "Molecular weight determination",
                        "การละลาย": "solubility",
                        "สมบัติเชิงความร้อน": "thermal properties",
                        "สมบัติการไหล": "rheological properties",
                        "สมบัติเชิงกล": "mechanical properties"
                    },
                    "กระบวนการขึ้นรูป": "Overview of different polymer processing techniques"
                }
            },
            {
                "category": "เธอร์โมไดนามิกส์ระดับโมเลกุลและการจำลองระบบโดยคอมพิวเตอร์",
                "subcategories": {
                    "ทบทวนเธอร์โมไดนามิกส์": "Review of chemical engineering thermodynamics",
                    "พลังงานภายในและแบบจำลองพลังงานศักย์": "Internal energy and potential models",
                    "แรงกระทำระหว่างโมเลกุลและความดัน": "Interaction among molecules and pressure",
                    "พลังงานอิสระกิบบส์และการจำลองระบบสมดุลเฟส": "Gibbs free energy and phase equilibrium modeling",
                    "การทำนายโครงสร้างและสมบัติของสาร": "Prediction of structure and properties of materials",
                    "การจำลองระบบโมเลกุลด้วยคอมพิวเตอร์": {
                        "การจำลองแบบมอนทีคาร์โล": "Monte Carlo simulations",
                        "การจำลองแบบพลศาสตร์ระดับโมเลกุล": "Molecular dynamics simulations"
                    }
                }
            },
            {
                "category": "MATLAB สำหรับวิศวกรเคมี",
                "subcategories": {
                    "การประยุกต์ใช้": "The application of MATLAB to the solution in chemical engineering",
                    "วิธีการเชิงตัวเลข": {
                        "เมตริกซ์และดีเทอร์มิเนนท์": "The solutions of matrices and determinants",
                        "การถดถอยเชิงเส้นและไม่เป็นเชิงเส้น": "linear and nonlinear regressions",
                        "สมการอนุพันธ์และการอินทิเกรต": "differential and integration"
                    },
                    "การจำลองกระบวนการทางเคมี": "Simulate a chemical process"
                }
            },
            {
                "category": "การแก้ไขปัญหาการควบคุมของโรงงาน",
                "subcategories": {
                    "รายละเอียด": "Troubleshooting Process Plant Control"
                }
            }
        ]
    }
]