[
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 41,
        "details": [
            {
                "category": "ข้อมูลเอกสาร",
                "subcategories": {
                    "เลขที่เอกสาร": "255910014",
                    "ประเภทเอกสาร": "ปริญญานิพนธ์",
                    "ภาคเรียนที่": "1/2559",
                    "วันที่ลงทะเบียน": "17-06-2559 16:10:53",
                    "วันที่พิมพ์เอกสาร": "03-10-2559 14:26:16"
                }
            },
            {
                "category": "ผู้แต่ง",
                "subcategories": {
                    "ผู้แต่ง_1": {
                        "เลขทะเบียน": "5510610941",
                        "ชื่อ": "นายวรรณสรณ์ จินตนานุรัตน์",
                        "E-mail": "Nvm.entu2012@gmail.com",
                        "Tel": "0917079861"
                    },
                    "ผู้แต่ง_2": {
                        "เลขทะเบียน": "5510610644",
                        "ชื่อ": "นางสาวณัฏฐา ตระการอุดมสุข",
                        "E-mail": "nut_trakarn@hotmail.com",
                        "Tel": "0890309601"
                    }
                }
            },
            {
                "category": "ชื่อเรื่อง",
                "subcategories": {
                    "ภาษาไทย": "กลยุทธ์ทางการตลาดของผลิตภัณฑ์อุปกรณ์ช่วยเดินสําหรับผู้ป่วยโรคหลอดเลือดสมอง",
                    "ภาษาอังกฤษ": "THE MARKERTING STRATEGY OF THE GAIT TRAINING DEVICE FOR THE STROKE PATIENT"
                }
            },
            {
                "category": "คําสําคัญในการค้นหา",
                "subcategories": {
                    "คำสำคัญ_1": "กลยุทธ์การตลาด",
                    "คำสำคัญ_2": "ผลิตภัณฑ์",
                    "คำสำคัญ_3": "อุปกรณ์ช่วยเดิน",
                    "คำสำคัญ_4": "ผู้ป่วย",
                    "คำสำคัญ_5": "หลอดเลือดสมอง"
                }
            },
            {
                "category": "สถาบัน",
                "subcategories": {
                    "มหาวิทยาลัย": "มหาวิทยาลัยธรรมศาสตร์",
                    "คณะ": "คณะวิศวกรรมศาสตร์",
                    "ภาควิชา": "ภาควิชาวิศวกรรมอุตสาหการ"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 19,
        "details": [
            {
                "category": "การจัดตําแหน่งข้อความในหน้ากระดาษ",
                "subcategories": {
                    "ตําแหน่งข้อความ": "จัดตําแหน่งข้อความเป็นแบบชิดขอบทั้งระยะขอบซ้ายและขอบขวา",
                    "การพิมพ์": "ใช้โปรแกรมตัดคําขึ้นบรรทัดใหม่อัตโนมัติ ไม่ต้อง Enter ปิดท้ายบรรทัด",
                    "การตัดคํา": "ห้ามตัดส่วนท้ายของคําไปพิมพ์ในบรรทัดใหม่"
                }
            },
            {
                "category": "การขึ้นหน้าใหม่",
                "subcategories": {
                    "กรณีข้อความเหลือหนึ่งบรรทัด": "ให้พิมพ์ต่อในหน้าเดิมจนจบย่อหน้านั้น แล้วจึงขึ้นย่อหน้าใหม่ในหน้าถัดไป",
                    "กรณีเหลือพื้นที่หนึ่งบรรทัด": "ให้ยกย่อหน้านั้นไปตั้งต้นพิมพ์ในหน้าถัดไป"
                }
            },
            {
                "category": "ตัวเลข",
                "subcategories": {
                    "ประเภทตัวเลข": "ใช้ตัวเลขอารบิกอย่างเดียวตลอดทั้งเล่ม"
                }
            },
            {
                "category": "การลําดับหน้า",
                "subcategories": {
                    "ส่วนนําเรื่อง": {
                        "เริ่มใส่เลขหน้า": "ตั้งแต่บทคัดย่อ กิตติกรรมประกาศ สารบัญ สารบัญตาราง สารบัญภาพ",
                        "รูปแบบ": "ตัวเลขอารบิกขนาด 16 พอยต์ ตัวพิมพ์ธรรมดา ของ TH Sarabun New อยู่ในเครื่องหมายวงเล็บ",
                        "ตําแหน่ง": "มุมบนด้านขวาของหน้ากระดาษ ห่างจากขอบบน 1 นิ้ว และห่างจากขอบขวา 1 นิ้ว"
                    },
                    "ส่วนเนื้อเรื่อง": {
                        "รูปแบบ": "ตัวเลขอารบิกขนาด 16 พอยต์ ตัวพิมพ์ธรรมดา ของ TH Sarabun New โดยไม่ต้องมีวงเล็บ",
                        "ตําแหน่ง": "มุมบนด้านขวาของหน้ากระดาษ ห่างจากขอบบน 1 นิ้ว และห่างจากขอบขวา 1 นิ้ว"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 29,
        "details": [
            {
                "category": "การประเมินผลการสอบ",
                "subcategories": {
                    "คะแนนเต็ม": "500 คะแนน (100%)",
                    "การแบ่งคะแนน": {
                        "อาจารย์ที่ปรึกษา": "50% (หากมีอาจารย์ที่ปรึกษาร่วม แบ่งเป็น 25% และ 25%)",
                        "กรรมการสอบ": "2 ท่าน ๆ ละ 25%"
                    },
                    "บทบาทอาจารย์ผู้ประสานงาน": "ตรวจสอบการดำเนินงานตามกำหนดการและลบประจุผลสอบสำหรับนักศึกษาที่ไม่ปฏิบัติตาม",
                    "ระดับผลการศึกษา": "A, B+, B, C+, C, D+, D และ F"
                }
            },
            {
                "category": "เกณฑ์การประเมิน",
                "subcategories": {
                    "กรรมการสอบ (50%)": [
                        "การศึกษาค้นหาข้อมูล",
                        "ความถูกต้องและสมบูรณ์ของเนื้อหา (รูปเล่มรายงาน)",
                        "ความเข้าใจและวิธีการดำเนินการ",
                        "ปริมาณงานตามแผนที่วางไว้",
                        "การนำเสนอชัดเจน"
                    ],
                    "อาจารย์ที่ปรึกษา (50%)": [
                        "ความถี่ในการเข้าพบ",
                        "การศึกษาค้นหาข้อมูล",
                        "ความเข้าใจและวิธีการดำเนินการ",
                        "ปริมาณงานตามแผนที่วางไว้",
                        "การนำเสนอชัดเจน",
                        "รูปเล่มรายงาน"
                    ]
                }
            },
            {
                "category": "การสอบประมวลผลโครงงาน",
                "subcategories": {
                    "วัตถุประสงค์": "สรุปผลการศึกษาที่ได้ดำเนินการมาตลอด 1 ปีการศึกษา",
                    "เนื้อหาการสอบ": [
                        "สภาพปัญหา",
                        "วัตถุประสงค์",
                        "วิธีดำเนินการวิจัยโดยย่อ",
                        "ผลของการวิจัย",
                        "ข้อเสนอแนะโดยละเอียด"
                    ],
                    "การให้คะแนน": {
                        "คะแนนเต็ม": "500 คะแนน (100%)",
                        "แบ่งเป็น": {
                            "อาจารย์ที่ปรึกษา": "40% (หากมีอาจารย์ที่ปรึกษาร่วม แบ่งเป็น 20% และ 20%)",
                            "กรรมการสอบ": "2 ท่าน ๆ ละ 25%",
                            "อาจารย์ผู้ประสานงาน": "10% (คะแนนจากการนำเสนอโครงงานในงานสัปดาห์วิชาการคณะวิศวกรรมศาสตร์)"
                        }
                    },
                    "บทบาทอาจารย์ผู้ประสานงาน": "ตรวจสอบการดำเนินงานตามกำหนดการและลบประจุผลสอบสำหรับนักศึกษาที่ไม่ปฏิบัติตาม",
                    "ระดับผลการศึกษา": "A, B+, B, C+, C, D+, D และ F"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 44,
        "details": [
            {
                "category": "การเบิกงบประมาณ",
                "subcategories": {
                    "การจัดสรรงบประมาณ": "คณะวิศวกรรมศาสตร์จัดสรรงบประมาณให้กับนักศึกษาทุกปีการศึกษา โดยภาควิชาจะพิจารณาจัดสรรให้กับนักศึกษาทุกกลุ่ม กลุ่มละ 1,000 บาท สำหรับค่าสำเนาเอกสาร ค่าพิมพ์เอกสาร และค่าเข้าเล่มเอกสาร",
                    "การขออนุมัติงบประมาณเพิ่มเติม": "งบประมาณที่เหลือจะพิจารณาจากแบบของบประมาณที่นักศึกษาได้ยื่นขออนุมัติมายังภาควิชา",
                    "การควบคุมการเบิก-จ่าย": "เจ้าหน้าที่ที่ดูแลการเบิก-จ่ายงบประมาณโครงงานของภาควิชา จะจัดทำรายการงบประมาณและควบคุมการเบิก-จ่ายให้เป็นไปตามงบประมาณที่แต่ละกลุ่มได้รับ และเป็นไปตามระเบียบงานคลังและพัสดุ และระเบียบการเงิน"
                }
            },
            {
                "category": "ตารางควบคุมการเบิก-จ่ายงบประมาณ",
                "subcategories": {
                    "วัตถุประสงค์": "ใช้สำหรับการควบคุมงบประมาณโครงงานของนักศึกษาในแต่ละกลุ่ม เพื่อให้การใช้จ่ายงบประมาณเป็นไปอย่างมีประสิทธิภาพ",
                    "รายละเอียดตาราง": "ประกอบด้วยหัวข้อ: กลุ่มที่, งบที่ได้รับ, ค่าใช้จ่าย, รวมใช้ไป, คงเหลือ",
                    "ตัวอย่างข้อมูล": "มีข้อมูลของกลุ่ม IE 01 ถึง IE 11, รวมถึงค่าใช้จ่ายสำหรับโปสเตอร์และการเข้าเล่ม",
                    "งบประมาณรวม": "งบประมาณรวมทั้งหมด 61,250.00 บาท, ใช้ไป 46,893.35 บาท, คงเหลือ 14,356.65 บาท"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 39,
        "details": [
            {
                "category": "ขั้นตอนการส่งปริญญานิพนธ์หรือโครงงาน",
                "subcategories": {
                    "ขั้นตอนที่_3": "เมื่อ Log in เข้าระบบแล้ว ตรวจสอบและแก้ไขข้อมูลส่วนบุคคล",
                    "ขั้นตอนที่_4": "เลือกปีการศึกษาและภาคเรียน",
                    "ขั้นตอนที่_5": "กรอกข้อมูลตามแบบฟอร์มของระบบ",
                    "ข้อมูลที่ต้องกรอก": {
                        "ชื่ออาจารย์ที่ปรึกษา": "กรอกชื่ออาจารย์ที่ปรึกษา",
                        "เลขทะเบียนผู้แต่งร่วม": "กรอกเลขทะเบียนผู้แต่งร่วม",
                        "ประเภทเอกสาร": "ปริญญานิพนธ์ (โครงงาน)",
                        "คำสำคัญ": "กรอกให้ครบทั้ง 5 ลำดับ (ไทย/อังกฤษ)",
                        "บทคัดย่อ": "copy ข้อความมาวางในช่อง และ แนบไฟล์",
                        "Abstract": "copy ข้อความมาวางในช่อง และ แนบไฟล์",
                        "เอกสารฉบับเต็ม": "แนบไฟล์"
                    },
                    "ขั้นตอนสุดท้าย": "กดบันทึกข้อมูล"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 45,
        "details": [
            {
                "category": "การจําแนกประเภทวัสดุ ครุภัณฑ์",
                "subcategories": {
                    "หลักเกณฑ์การจําแนก": "นักศึกษา อาจารย์ที่ปรึกษา และเจ้าหน้าที่ผู้ปฏิบัติงาน จะต้องทราบถึงหลักเกณฑ์การจําแนกประเภทวัสดุ ครุภัณฑ์ เพื่อลดความผิดพลาดที่อาจเกิดขึ้นและเป็นไปตามระเบียบสํานักงบประมาณ",
                    "ประเภทวัสดุ": {
                        "วัสดุคงทน": "สิ่งของที่โดยสภาพมีลักษณะคงทนแต่ตามปกติมีอายุการใช้งานไม่ยืนนาน หรือเมื่อนําไปใช้งานแล้วเกิดความชํารุดเสียหาย ไม่สามารถซ่อมแซมให้ใช้งานได้ดังเดิม หรือซ่อมแซมแล้วไม่คุ้มค่า",
                        "วัสดุสิ้นเปลือง": "สิ่งของที่โดยสภาพมีลักษณะเมื่อใช้แล้วย่อมสิ้นเปลือง หมดไป แปรสภาพ หรือเปลี่ยนสภาพไปในระยะเวลาอันสั้นหรือไม่คงสภาพเดิม",
                        "วัสดุอุปกรณ์ประกอบและอะไหล่": "สิ่งของที่ใช้เป็นอุปกรณ์ประกอบหรืออะไหล่สําหรับการซ่อมแซมบํารุงรักษาทรัพย์สินให้กลับคืนสภาพเดิมที่มีลักษณะเป็นการซ่อมบํารุงปกติหรือค่าซ่อมกลาง"
                    }
                }
            },
            {
                "category": "การเบิก-จ่ายงบประมาณ",
                "subcategories": {
                    "ระยะเวลาการเบิกจ่าย": "สามารถเบิกจ่ายได้ตั้งแต่เดือนตุลาคม ถึง เดือนกรกฎาคม ของปีถัดไป (ปีงบประมาณ ตุลาคม-กันยายน)",
                    "หลักฐานการเบิกเงิน": {
                        "ใบเสร็จรับเงิน": "ใช้ในกรณีที่ผู้ขายสินค้ามีการจดทะเบียนการค้า มีเลขประจําตัวผู้เสียภาษีชัดเจน เช่น บริษัท ห้างหุ้นส่วนจํากัด",
                        "รูปแบบใบเสร็จรับเงิน": [
                            "ใบเสร็จรับเงินแบบเบ็ดเสร็จในใบเดียว",
                            "ใบเสร็จรับเงินที่ไม่ได้ระบุรายการสินค้าแต่จะอ้างอิงใบส่งสินค้า"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 35,
        "details": [
            {
                "category": "แบบฟอร์มและเอกสารทางการเงิน",
                "subcategories": {
                    "แบบขออนุมัติดําเนินการจัดซื้อวัสดุ": "เป็นแบบฟอร์มที่ใช้ขออนุมัติดําเนินการจัดซื้อวัสดุ เป็นเอกสารนําส่งใบเสร็จรับเงินในรายการประเภทซื้อวัสดุ",
                    "แบบขออนุมัติดําเนินการจัดจ้างเหมาบริการ": "เป็นแบบฟอร์มที่ใช้ขออนุมัติดําเนินการจัดจ้างเหมาบริการ เป็นเอกสารนําส่งใบเสร็จรับเงินในรายการประเภทจ้างเหมาบริการ",
                    "ใบสําคัญจ่าย": "เป็นเอกสารนําส่งให้กับงานการเงินเพื่อทําสรุปเรื่องการเบิก-จ่ายงบประมาณโครงงาน"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 38,
        "details": [
            {
                "category": "การบันทึกลงฐานข้อมูล",
                "subcategories": {
                    "การบันทึกข้อมูลโครงงาน": "การบันทึกข้อมูลโครงงานลงในระบบอ้างอิงข้อมูล (Reference Document System) ของคณะวิศวกรรมศาสตร์ เพื่อเป็นฐานข้อมูลสําหรับการสืบค้นและค้นคว้า ปริญญานิพนธ์ สารนิพนธ์ และวิทยานิพนธ์",
                    "ขั้นตอนการนําเข้าข้อมูลโครงงาน": {
                        "ขั้นตอนที่_1": "เปิดเข้าเว็บไซต์ student.engr.tu.ac.th จะพบหน้าแรก เลือกระบบลงทะเบียนฯ",
                        "ขั้นตอนที่_2": "คลิกเข้า ระบบลงทะเบียนโครงงาน/สารนิพนธ์/วิทยานิพนธ์ จะพบหน้า Log in เข้าระบบ"
                    }
                }
            },
            {
                "category": "เอกสารที่ต้องเตรียม",
                "subcategories": {
                    "เอกสารที่_3": "แบบบันทึกข้อมูลโครงงานลงในระบบอ้างอิงข้อมูล",
                    "เอกสารที่_4": "ไฟล์ข้อมูลโครงงาน ในรูปแบบ Word และ PDF"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 26,
        "details": [
            {
                "category": "วิชา วอ.497 โครงงานทางวิศวกรรมอุตสาหการ 2",
                "subcategories": {
                    "ภาคการศึกษา": "ภาคการศึกษาที่ 2",
                    "หน่วยกิต": "2 หน่วยกิต"
                }
            },
            {
                "category": "กำหนดการโครงงาน",
                "subcategories": {
                    "นักศึกษานำเสนอร่างโครงงานให้คณะกรรมการสอบประเมิน": "สัปดาห์ที่ 2-3 ของเดือนกันยายน",
                    "นักศึกษาที่ไม่ผ่านการนำเสนอร่างโครงงาน ให้คณะกรรมการสอบประเมินอีกครั้ง": "สัปดาห์ที่ 2 ของเดือนตุลาคม",
                    "นักศึกษาส่งรายงานความก้าวหน้า": "วันศุกร์สุดท้ายของภาคการศึกษาที่ 1 ก่อนเวลา 16.00 น.",
                    "นักศึกษาสอบความก้าวหน้าโครงงาน": "วันศุกร์ ก่อนเปิดภาคการศึกษาที่ 2",
                    "ส่งโปสเตอร์นำเสนอโครงงานในสัปดาห์วิชาการคณะวิศวกรรมศาสตร์": "ตามกำหนดการจัดงานสัปดาห์วิชาการคณะวิศวกรรมศาสตร์",
                    "นักศึกษาส่งรายงานประมวลผลโครงงาน": "วันศุกร์สุดท้ายของภาคการศึกษาที่ 2 ก่อนเวลา 16.00 น.",
                    "นักศึกษาสอบประมวลผลโครงงาน": "หลังการสอบปลายภาคการศึกษาที่ 2",
                    "นักศึกษาส่งรายงานโครงงานฉบับสมบูรณ์": "ภายใน 30 วัน หลังการสอบประมวลผลโครงงาน"
                }
            },
            {
                "category": "การส่งใบเบิกวัสดุโครงงาน",
                "subcategories": {
                    "การทำเอกสารเบิกเงิน": "ภาควิชาจะทำเอกสารเบิกเงินในวันที่ 15 ของทุกเดือน",
                    "กำหนดการส่งเอกสารเบิกเงิน": "นักศึกษาที่จะเบิกเงินส่งเอกสารก่อนวันที่ 15 ของทุกเดือน",
                    "กำหนดการรับเงิน": "จะได้รับเงินประมาณวันที่ 15 ของเดือนถัดไป",
                    "ครั้งสุดท้ายของการเบิกเงินวัสดุโครงงาน": "สิ้นเดือนกรกฎาคม"
                }
            },
            {
                "category": "หมายเหตุ",
                "subcategories": {
                    "การเปลี่ยนแปลงกำหนดการ": "กำหนดการที่แจ้งอาจมีการเปลี่ยนแปลงได้ขึ้นอยู่กับปฏิทินการศึกษาของมหาวิทยาลัย",
                    "การส่งเล่มสอบโครงงาน": "ให้ส่งจำนวน 3 เล่ม (หากมีที่ปรึกษาร่วมให้ส่ง 4 เล่ม)",
                    "ขั้นตอนการนัดสอบร่างโครงงาน": "ให้นักศึกษาตรวจสอบวัน-เวลาว่างของอาจารย์ เมื่อได้กำหนดการแล้ว ให้ นศ. นำแบบฟอร์มการนัดวันสอบโครงงาน ให้อาจารย์ที่ปรึกษาและ"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 25,
        "details": [
            {
                "category": "บทที่ 4 กําหนดการ ข้อกําหนด และการประเมินผล",
                "subcategories": {
                    "เนื้อหา": "กล่าวถึงกําหนดการ ข้อกําหนด และการประเมินผลโครงงาน รวมถึงแบบฟอร์มต่างๆ ที่จะต้องใช้ในขั้นตอนการดําเนินงาน"
                }
            },
            {
                "category": "4.1 กําหนดการ",
                "subcategories": {
                    "วัตถุประสงค์": "จัดทําขึ้นให้นักศึกษาใช้เป็นแนวทางในการดําเนินการปฏิบัติงานได้ตามแผนงานที่ภาควิชากําหนดไว้ตลอดปีการศึกษา",
                    "การอ้างอิง": "อ้างอิงระยะเวลากับปฏิทินการศึกษาของมหาวิทยาลัยธรรมศาสตร์",
                    "การอนุมัติ": "ต้องได้รับความเห็นชอบจากคณะกรรมการประสานงานภาควิชา"
                }
            },
            {
                "category": "ตารางที่ 4.1 การกําหนดระยะเวลาการจัดทําโครงงาน",
                "subcategories": {
                    "วิชา": "วอ.496 โครงงานทางวิศวกรรมอุตสาหการ 1",
                    "ภาคการศึกษา": "ภาคการศึกษาที่ 1",
                    "หน่วยกิต": "1 หน่วยกิต",
                    "กําหนดการ_1": "นักศึกษาติดต่อเพื่อพบอาจารย์ที่ปรึกษา ตั้งแต่วันที่ 1 กรกฎาคม เป็นต้นไป",
                    "กําหนดการ_2": "นักศึกษาส่งแบบยื่นหัวข้อโครงงาน และชื่ออาจารย์ที่ปรึกษาโครงงาน ให้ภาควิชาฯ ทราบ วันศุกร์ที่ 2 ของการเปิดภาคการศึกษาที่ 1",
                    "กําหนดการ_3": "ภาควิชาฯ ประกาศรายชื่อคณะกรรมการสอบโครงงาน วันพุธ สัปดาห์ที่ 3 ของการเปิดภาคการศึกษาที่ 1",
                    "กําหนดการ_4": "นักศึกษาส่งร่างโครงงานให้เลขานุการภาควิชาฯ วันพุธ สัปดาห์ที่ 1 ของเดือนกันยายน ก่อนเวลา 16.00 น."
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 42,
        "details": [
            {
                "category": "วัตถุประสงค์การวิจัย",
                "subcategories": {
                    "หัวข้อหลัก": "การศึกษาและวางกลยุทธ์ทางการตลาดของอุปกรณ์ช่วยเดินสำหรับผู้ป่วยโรคหลอดเลือดสมอง",
                    "รายละเอียด": "กำหนดกลยุทธ์ส่วนประสมทางการตลาด ประกอบด้วย ผลิตภัณฑ์ ราคา ช่องทางการจัดจำหน่าย และการส่งเสริมการตลาด"
                }
            },
            {
                "category": "วิธีการวิจัย",
                "subcategories": {
                    "กลุ่มตัวอย่าง": "ผู้ป่วยหรือญาติผู้ป่วยโรคหลอดเลือดสมองที่รับการรักษาที่โรงพยาบาลธรรมศาสตร์เฉลิมพระเกียรติ",
                    "เครื่องมือวิจัย": "แบบสอบถาม",
                    "จำนวนตัวอย่าง": "25 ชุด",
                    "การวิเคราะห์ข้อมูล": "วิเคราะห์ความสนใจซื้อ ปัจจัยในการตัดสินใจซื้อ และราคาสูงสุดที่ยอมจ่าย"
                }
            },
            {
                "category": "ผลการวิจัย",
                "subcategories": {
                    "ปัจจัยทางการตลาดที่มีผล": [
                        "การใช้งานง่าย",
                        "เคลื่อนย้ายง่าย น้ำหนักเบา",
                        "ขนาดเหมาะสมไม่เสียพื้นที่ติดตั้งมาก",
                        "มีการรับประกันสินค้า",
                        "ผลิตภัณฑ์มีความคงทน",
                        "สามารถถอด-ประกอบได้",
                        "ปรับระดับตามสัดส่วนร่างกายได้",
                        "สามารถทำการกายภาพบำบัดได้หลายท่า",
                        "มีอุปกรณ์เรียกกรณีฉุกเฉิน",
                        "เครื่องหยุดอัตโนมัติเมื่อเกิดอุบัติเหตุ",
                        "มีเครื่องสำรองใช้ระหว่างซ่อมแซม",
                        "ความรวดเร็วในการซ่อมสินค้า",
                        "มีศูนย์รับเรื่องร้องเรียนสำหรับลูกค้า",
                        "การผ่อนชำระ",
                        "สามารถสั่งซื้อสินค้าได้ในโรงพยาบาล"
                    ]
                }
            },
            {
                "category": "การพัฒนาผลิตภัณฑ์",
                "subcategories": {
                    "การออกแบบใหม่": "มีปุ่มหยุดฉุกเฉินสำหรับผู้ป่วย",
                    "การปรับราคา": "เปลี่ยนจากการขายในราคา 200,000 บาท มาเป็นการเช่าจ่ายเดือนละ 7,500 บาท",
                    "แหล่งเงินทุน": "นำเงินจากการบริจาคมาช่วยสมทบทุน",
                    "การส่งเสริมการตลาด": "มีการโฆษณาและประชาสัมพันธ์"
                }
            },
            {
                "category": "ผลการประเมิน",
                "subcategories": {
                    "ความพึงพอใจ": "ผู้สัมภาษณ์มีความพึงพอใจมากถึงมากที่สุดต่อปัจจัยทางการตลาดที่ได้ออกแบบและพัฒนา",
                    "ข้อเสนอแนะ": "ปัจจัยต่าง ๆ สามารถพัฒนาและดำเนินการต่อไปได้ในระยะยาว เพื่อให้สอดคล้องและตรงต่อความต้องการของผู้บริโภคได้อย่างมีประสิทธิภาพยิ่งขึ้น"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 36,
        "details": [
            {
                "category": "การส่งรายงานและการบันทึกลงฐานข้อมูล",
                "subcategories": {
                    "การแบ่งการส่งรายงาน": "แบ่งเป็น 4 ครั้ง: 2 ครั้งในภาคการศึกษาที่ 1 และ 2 ครั้งในภาคการศึกษาที่ 2",
                    "การบันทึกข้อมูลโครงงาน": "บันทึกลงในระบบอ้างอิงข้อมูลของคณะวิศวกรรมศาสตร์หลังส่งรายงานฉบับสมบูรณ์"
                }
            },
            {
                "category": "การส่งรายงาน",
                "subcategories": {
                    "การส่งรายงานร่างโครงงาน": {
                        "กำหนดส่ง": "วันพุธ สัปดาห์ที่ 1 ของเดือนกันยายน ก่อนเวลา 16.00 น.",
                        "รายละเอียดที่ต้องส่ง": [
                            "หน้าปกนอก ที่มีตรามหาวิทยาลัย",
                            "เนื้อหาบทที่ 1 หรือบางกลุ่มอาจจะมีบทที่ 2 ตามที่อาจารย์ที่ปรึกษากำหนด"
                        ],
                        "วิธีการส่ง": "เย็บมุมซ้ายบนเท่านั้น ไม่ต้องเข้าเล่ม เขียนชื่อคณะกรรมการสอบ ท่านละ 1 เล่ม ส่งที่ภาควิชาพร้อมลงชื่อผู้ส่งและวันที่ส่งรายงาน"
                    },
                    "การส่งรายงานความก้าวหน้าโครงงาน": {
                        "กำหนดส่ง": "วันศุกร์สุดท้ายของภาคการศึกษาที่ 1 ก่อนเวลา 16.00 น.",
                        "รายละเอียดที่ต้องส่ง": [
                            "หน้าปกนอก ที่มีตรามหาวิทยาลัย",
                            "สารบัญ",
                            "สารบัญตาราง (ถ้ามี)",
                            "สารบัญภาพ (ถ้ามี)",
                            "บทที่ 1-3 หรือ บทอื่น ๆ ตามที่อาจารย์ที่ปรึกษาเห็นควร",
                            "รายการอ้างอิง"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 4,
        "details": [
            {
                "category": "สวนประกอบทายเรื่อง",
                "subcategories": {
                    "รายการอางอิง": "หนา 9",
                    "ภาคผนวก": "หนา 10"
                }
            },
            {
                "category": "การจัดพิมพโครงงาน",
                "subcategories": {
                    "เรื่องทั่วไปเกี่ยวกับการพิมพ": {
                        "กระดาษที่ใชพิมพ": "หนา 11",
                        "ตัวพิมพ": "หนา 11",
                        "การเวนของกระดาษ": "หนา 11",
                        "การเวนระยะระหวางบรรทัด": "หนา 11",
                        "การยอหนา": "หนา 11",
                        "การจัดตําแหนงขอความในหนากระดาษ": "หนา 12",
                        "การขึ้นหนาใหม": "หนา 12",
                        "ตัวเลข": "หนา 12"
                    },
                    "การลําดับหนา": {
                        "การลําดับหนาสวนนําเรื่อง": "หนา 12",
                        "การลําดับหนาสวนเนื้อเรื่อง": "หนา 12",
                        "การลําดับหนาสําคัญ": "หนา 13"
                    },
                    "การพิมพบทและหัวขอในบท": {
                        "บท": "หนา 13",
                        "หัวขอในบท": "หนา 13"
                    },
                    "การพิมพอัญประภาษ": "หนา 14",
                    "การพิมพตาราง": {
                        "เลขกํากับและชื่อตาราง": "หนา 14",
                        "การพิมพตาราง": "หนา 14",
                        "แหลงอางอิงและหมายเหตุของตาราง": "หนา 15"
                    },
                    "การพิมพภาพ": {
                        "เลขกํากับและชื่อภาพ": "หนา 16",
                        "การพิมพภาพ": "หนา 16",
                        "แหลงอางอิงและหมายเหตุของภาพ": "หนา 16"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 15,
        "details": [
            {
                "category": "ส่วนเนื้อเรื่อง",
                "subcategories": {
                    "บทที่_1_บทนำ": "เป็นบทแรกของโครงงาน ชี้ให้เห็นประเด็นสำคัญของเรื่องที่จะศึกษา ทั้งในแง่ของความสำคัญของปัญหาและวัตถุประสงค์ อธิบายคำจำกัดความหรือสัญลักษณ์สำคัญที่ใช้ ตลอดจนข้อจำกัดต่างๆ",
                    "บทที่_2_วรรณกรรมและงานวิจัยที่เกี่ยวข้อง": "สรุปความเป็นมาของปัญหาที่ศึกษา ผลการศึกษาวิจัยในอดีต ทฤษฎีที่เกี่ยวข้อง และระบุว่าการศึกษาวิจัยที่จะทำต่อไปนั้นเพื่อสนับสนุนข้อโต้แย้งใด"
                }
            },
            {
                "category": "ส่วนประกอบตอนต้น",
                "subcategories": {
                    "สารบัญตาราง": "แจ้งหมายเลขหน้าของตารางทั้งหมดที่มีอยู่ในโครงงาน จัดเรียงตามลำดับโดยระบุเลขบทและเลขที่ของตาราง พร้อมทั้งเลขลำดับหน้า",
                    "สารบัญภาพ": "แสดงรายการภาพทั้งหมดในโครงงาน จัดเรียงตามลำดับโดยระบุเลขบทและเลขที่ของภาพ พร้อมทั้งเลขลำดับหน้า"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 7,
        "details": [
            {
                "category": "สารบัญตาราง",
                "subcategories": {
                    "ตารางที่_4.1": "ตารางการกําหนดการจัดทําโครงงาน (หน้า 18)",
                    "ตารางที่_4.2": "การคิดคะแนนวิชาโครงงานทางวิศวกรรมอุตสาหการ 1 และ 2 (หน้า 24)",
                    "ตารางที่_4.3": "ระดับผลการศึกษา (หน้า 24)",
                    "ตารางที่_6.1": "ตัวอย่างตารางควบคุมการเบิก-จ่ายงบประมาณโครงงาน (หน้า 36)"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 31,
        "details": [
            {
                "category": "การคิดคะแนน",
                "subcategories": {
                    "เทอม_1_(วอ.496)": "1 หน่วยกิต",
                    "เทอม_2_(วอ.497)": "2 หน่วยกิต",
                    "กรณีมีอาจารย์ที่ปรึกษาร่วม": {
                        "ประเมินโดยอาจารย์ที่ปรึกษา": {
                            "เทอม_1": "25%",
                            "เทอม_2": "20%"
                        },
                        "ประเมินโดยอาจารย์ที่ปรึกษาร่วม": {
                            "เทอม_1": "25%",
                            "เทอม_2": "20%"
                        },
                        "ประเมินโดยกรรมการสอบ_(2_ท่าน)": {
                            "เทอม_1": "50%",
                            "เทอม_2": "50%"
                        },
                        "ประเมินโดยอาจารย์ผู้ประสานงาน": {
                            "เทอม_2": "10%",
                            "รายละเอียด": "การจัดทําโปสเตอร์และนําเสนอผลงานโครงงานในสัปดาห์วิชาการ"
                        }
                    }
                }
            },
            {
                "category": "การหักคะแนน",
                "subcategories": {
                    "ผู้หักคะแนน": "อาจารย์ผู้ประสานงาน (รองหัวหน้าภาคฯ ฝ่ายวิชาการ)",
                    "เทอม_1": "คะแนนจะเป็นลบ ครั้งละ 1 ประจุ (ครึ่งเกรด)",
                    "เทอม_2": "คะแนนจะเป็นลบ ครั้งละ 1 ประจุ (ครึ่งเกรด)"
                }
            },
            {
                "category": "ระดับผลการศึกษา",
                "subcategories": {
                    "A": "400-500 คะแนน",
                    "B+": "375-399 คะแนน",
                    "B": "350-374 คะแนน",
                    "C+": "325-349 คะแนน",
                    "C": "250-324 คะแนน",
                    "D+": "225-249 คะแนน",
                    "D": "200-224 คะแนน",
                    "F": "< 200 คะแนน"
                }
            },
            {
                "category": "การจัดทําโปสเตอร์",
                "subcategories": {
                    "รายละเอียด": "คณะวิศวกรรมศาสตร์จัดสัปดาห์วิชาการเพื่อให้นักศึกษานําเสนอโครงงาน สารนิพนธ์ วิทยานิพนธ์ เผยแพร่ผลงานทางวิชาการ",
                    "กําหนดการจัดงาน": "เดือนเมษายนของทุกปี",
                    "ผู้เข้าร่วม": "นักศึกษาภาควิชาวิศวกรรมอุตสาหการที่จดทะเบียนรายวิชาโครงานทุกคน",
                    "ข้อกําหนดโปสเตอร์": {
                        "กระดาษ": "กระดาษอาร์ต แบบมันวาวหรือแบบด้าน",
                        "ขนาด": "กว้าง 90 เซนติเมตร ยาว 95 เซนติเมตร",
                        "การพิมพ์": "พิมพ์เป็นแนวตั้ง"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 34,
        "details": [
            {
                "category": "แบบฟอร์มการประเมินและการดำเนินงานโครงงาน",
                "subcategories": {
                    "แบบประเมินผลการสอบร่างโครงงาน": "พิจารณาความเป็นไปได้ในการศึกษาหัวข้อนั้น ๆ ผลการประเมินคือ ผ่าน หรือ ไม่ผ่าน",
                    "แบบประเมินผลการสอบความก้าวหน้า": "พิจารณาเพิ่มเติมข้อมูลในส่วนของวรรณกรรม ทฤษฎี งานวิจัยที่เกี่ยวข้อง วิธีการดำเนินการศึกษา ขั้นตอนการปฏิบัติงาน การออกแบบการทดสอบ/ทดลอง ประเมินผลโดยให้คะแนนเต็ม 500 คะแนน (100%)",
                    "แบบประเมินผลสอบประมวลผล": "พิจารณาการอธิบายผลการดำเนินงาน สรุปผลการศึกษา และข้อเสนอแนะโดยละเอียด ประเมินผลโดยให้คะแนนเต็ม 500 คะแนน (100%)",
                    "แบบการขออนุมัติงบประมาณ": "ใช้สำหรับขออนุมัติงบประมาณสำหรับวัสดุโครงงาน นอกเหนือจากงบประมาณพื้นฐาน 1,000 บาทต่อกลุ่ม",
                    "แบบขออนุมัติเบิกเงินโครงงาน": "ใช้สำหรับการขอเบิกงบประมาณวัสดุโครงงานตามที่ได้รับการอนุมัติ",
                    "แบบฟอร์มการส่งรายงานฉบับสมบูรณ์": "ใช้สรุปการส่งรายงานฉบับสมบูรณ์ เป็นการตรวจสอบขั้นสุดท้ายก่อนการส่งผลการศึกษา",
                    "แบบฟอร์มคำร้องทั่วไป": "สำหรับนักศึกษาที่มีปัญหาการดำเนินการในขั้นต่างๆ เขียนคำร้องมายังภาควิชาเพื่อแก้ไขปัญหา"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 37,
        "details": [
            {
                "category": "การส่งรายงานโครงงาน",
                "subcategories": {
                    "การส่งรายงานความก้าวหน้าโครงงาน": "เย็บมุมซ้ายบนเท่านั้น ไม่ต้องเข้าเล่ม ให้เขียนชื่อคณะกรรมการสอบ ท่านละ 1 เล่ม (เขียนด้วยดินสอ มุมบนด้านขวามือ) ส่งที่ภาควิชาพร้อมลงชื่อผู้ส่งและวันที่ส่งรายงาน",
                    "การส่งรายงานประมวลผลโครงงาน": "กําหนดให้ส่งในวันศุกร์สุดท้ายของภาคการศึกษาที่ 2 ก่อนเวลา 16.00 น.",
                    "การส่งรายงานโครงงานฉบับสมบูรณ์": "กําหนดให้ส่งภายใน 30 วัน หลังการสอบประมวลผลโครงงาน"
                }
            },
            {
                "category": "รายละเอียดเอกสารรายงานประมวลผลโครงงาน",
                "subcategories": {
                    "ส่วนประกอบ": [
                        "1. ปกนอก",
                        "2. ปกใน (แบบภาษาไทย)",
                        "3. ปกใน (แบบภาษาอังกฤษ)",
                        "4. หน้าอนุมัติ",
                        "5. บทคัดย่อ",
                        "6. Abstract",
                        "7. กิตติกรรมประกาศ",
                        "8. สารบัญ",
                        "9. สารบัญตาราง",
                        "10. สารบัญภาพ",
                        "11. บทที่ 1 – 5 (และบทอื่นๆ หากมีเพิ่มเติม)",
                        "12. รายการอ้างอิง",
                        "13. หน้าภาคผนวก",
                        "14. หน้าภาคผนวก ก, หน้าภาคผนวก ข, . . ."
                    ],
                    "การจัดส่ง": "สําเนาเอกสารส่ง 3 เล่ม เอกสารไม่ต้องเข้าเล่ม เย็บมุมบนด้านซ้าย หรือเย็บข้าง (หากเอกสารมีความหนามาก)",
                    "การส่งไฟล์": "นําส่งไฟล์โครงงานทั้งหมด โดยใส่ไฟล์ลงในโฟลเดอร์ และตั้งชื่อโฟลเดอร์ ตามลําดับกลุ่ม (IE xx) เพื่อตรวจสอบความถูกต้องของการจัดรูปแบบโครงงาน"
                }
            },
            {
                "category": "รายละเอียดการส่งรายงานโครงงานฉบับสมบูรณ์",
                "subcategories": {
                    "เอกสารที่ต้องส่ง": [
                        "1. แบบฟอร์มการส่งรายงานฉบับสมบูรณ์",
                        "2. รูปเล่มรายงานฉบับสมบูรณ์"
                    ],
                    "ข้อกําหนด": "รายงานจะต้องผ่านการตรวจรูปแบบเรียบร้อยแล้ว"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 46,
        "details": [
            {
                "category": "ใบเสร็จรับเงิน",
                "subcategories": {
                    "ลักษณะ": "ใบเสร็จรับเงินแบบเป็นชุด 2-3 ใบ ซึ่งจะใช้แค่ใบใดใบหนึ่งมาเบิกไม่ได้ ต้องนําเอกสารทั้งชุดมาตั้งเบิกเท่านั้น",
                    "ส่วนประกอบที่ถูกต้อง": {
                        "1": "ข้อความส่วนบนใบเสร็จเขียนว่า ใบเสร็จรับเงิน",
                        "2": "ชื่อและที่อยู่ของร้านค้า หรือสถานประกอบการ และเลขประจําตัวผู้เสียภาษี",
                        "3": "ชื่อและที่อยู่ของผู้ซื้อคือ คณะวิศวกรรมศาสตร์ มหาวิทยาลัยธรรมศาสตร์ เลขที่ 99 หมู่ที่ 18 ถ.พหลโยธิน ต.คลองหนึ่ง อ.คลองหลวง จ.ปทุมธานี 12120 โทรศัพท์ 0 2564 3001-9 โทรสาร 0 2564 3017 เลขประจําตัวผู้เสียภาษี 099-4-000016086-1",
                        "4": "เลขที่ เล่มที่ ใบเสร็จรับเงิน",
                        "5": "รายการสินค้าที่ซื้อและราคาแต่ละรายการ",
                        "6": "ลายเซ็นผู้รับเงิน"
                    },
                    "ข้อควรระวัง": "เอกสารที่เขียนว่า \"ใบส่งสินค้า\" \"ใบส่งของ\" \"ใบจองสินค้า\" \"ใบวางบิล\" ไม่สามารถใช้ได้"
                }
            },
            {
                "category": "บิลเงินสด",
                "subcategories": {
                    "ลักษณะ": "ใช้ในกรณีซื้อสินค้ากับร้านค้าทั่วไป ที่ไม่ได้จดทะเบียนการค้า แต่มีสถานที่ตั้งร้านค้าชัดเจน",
                    "ส่วนประกอบที่ถูกต้อง": {
                        "1": "ข้อความบนหัวที่เขียนว่า \"บิลเงินสด\"",
                        "2": "ประทับตราหรือเขียน ชื่อและที่อยู่ของร้านค้า หรือสถานประกอบการ หรือแนบนามบัตรของร้านค้า หรือสถานประกอบการมาด้วย",
                        "3": "ชื่อและที่อยู่ของผู้ซื้อคือ คณะวิศวกรรมศาสตร์ มหาวิทยาลัยธรรมศาสตร์ เลขที่ 99 หมู่ที่ 18 ถ.พหลโยธิน ต.คลองหนึ่ง อ.คลองหลวง จ.ปทุมธานี 12120 โทรศัพท์ 0 2564 3001-9 โทรสาร 0 2564 3017 เลขประจําตัวผู้เสียภาษี 099-4-000016086-1",
                        "4": "เลขที่ เล่มที่ (ต้องให้ผู้รับเงินเขียน เลขที่ เล่มที่ ในบิลเงินสด ทุกครั้ง)",
                        "5": "วันที่",
                        "6": "รายการสินค้าที่ซื้อ และราคาแต่ละรายการ",
                        "7": "ลายเซ็นผู้รับเงิน"
                    },
                    "ข้อควรระวัง": "เอกสารที่เขียนว่า \"ใบส่งสินค้า\" \"ใบส่งของ\" \"ใบจองสินค้า\" ไม่สามารถใช้ได้"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 23,
        "details": [
            {
                "category": "การพิมพ์ภาพ",
                "subcategories": {
                    "เลขกํากับและชื่อภาพ": {
                        "วิธีการกำหนดเลขกำกับ": "แยกเลขลําดับภาพไว้ในแต่ละบท โดยใช้เลขลําดับภาพเหมือนเลขลําดับบท ตามด้วยเครื่องหมายมหัพภาค (.) และเลขบอกลําดับของภาพในบทนั้น",
                        "ตัวอย่าง": "บทที่ 1 ใช้ภาพที่ 1.1 ภาพที่ 1.2, บทที่ 5 ใช้ภาพที่ 5.1 ภาพที่ 5.2"
                    },
                    "การจัดวางภาพ": {
                        "ตำแหน่ง": "แทรกไว้ตามส่วนเนื้อหาที่ระบุถึงภาพนั้น ๆ",
                        "การจัดวาง": "ให้วางอยู่ในตําแหน่งที่เหมาะสม เรียบร้อยและสวยงาม"
                    },
                    "การพิมพ์ลําดับและชื่อภาพ": {
                        "รูปแบบ": "พิมพ์คําว่า \"ภาพที่...\" ระบุลําดับที่ของภาพโดยใช้ตัวเลขอารบิก",
                        "ตัวอย่าง": "\"ภาพที่ 1.1\"",
                        "ความสม่ำเสมอ": "ใช้รูปแบบใดรูปแบบหนึ่งให้เหมือนกันตลอดทั้งเล่ม"
                    },
                    "ภาพต่อเนื่อง": {
                        "วิธีการ": "พิมพ์ส่วนที่เหลือในหน้าถัดไป",
                        "ข้อกำหนด": "ต้องมีลําดับภาพและชื่อภาพทุกหน้า และพิมพ์คําว่า (ต่อ) ไว้ในวงเล็บต่อท้ายชื่อภาพ"
                    }
                }
            },
            {
                "category": "แหล่งอ้างอิงและหมายเหตุของภาพ",
                "subcategories": {
                    "การอ้างอิงแหล่งที่มา": {
                        "ตำแหน่ง": "พิมพ์ไว้ท้ายสุดในบรรทัดถัดจากตัวภาพ",
                        "การจัดวาง": "พิมพ์ให้ตรงกับขอบซ้ายของภาพ หรือพิมพ์ในตําแหน่งที่เหมาะสม",
                        "รูปแบบ": "เลือกใช้รูปแบบการอ้างอิงรูปแบบใดรูปแบบหนึ่งให้เหมือนกันตลอดทั้งเล่ม"
                    },
                    "คําอธิบายภาพเพิ่มเติม": {
                        "ตำแหน่ง": "พิมพ์ในบรรทัดถัดจากตัวภาพ หรือถัดจากบรรทัดอ้างอิง (ถ้ามี)"
                    }
                }
            },
            {
                "category": "การพิมพ์คําภาษาต่างประเทศ",
                "subcategories": {
                    "หลักการทั่วไป": "ให้ใช้เหมือนกันตลอดทั้งเล่ม",
                    "ข้อห้าม": "ไม่ให้พิมพ์คําภาษาต่างประเทศเป็นส่วนหนึ่งของเนื้อหาโดยที่ไม่ใช้คํานั้นที่มีอยู่แล้วในภาษาไทย",
                    "ตัวอย่าง": {
                        "คอมพิวเตอร์": "ไม่ให้พิมพ์ว่า \"Computers\"",
                        "เทคโนโลยีสารสนเทศ": "ไม่ให้พิมพ์คําว่า \"Information Technology\""
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 6,
        "details": [
            {
                "category": "บทที่ 5 การสงรายงานและการบันทึกลงฐานขอมูล",
                "subcategories": {
                    "5.1 การสงรายงาน": {
                        "5.1.1 การสงรายงานรางโครงงาน": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง",
                        "5.1.2 การสงรายงานความกาวหนาโครงงาน": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง",
                        "5.1.3 การสงรายงานประมวลผลโครงงาน": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง",
                        "5.1.4 การสงรายงานโครงงานฉบับสมบูรณ": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง"
                    },
                    "5.2 การบันทึกลงฐานขอมูล": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง"
                }
            },
            {
                "category": "บทที่ 6 การเบกิ งบประมาณ",
                "subcategories": {
                    "6.1 ตารางควบคุมการเบิก-จายงบประมาณ": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง",
                    "6.2 การจําแนกประเภทวัสดุ ครุภัณฑ": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง",
                    "6.3 การเบิก-จา ยงบประมาณ": {
                        "6.3.1 หลักฐานการเบิกเงิน": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง",
                        "6.3.2 ขั้นตอนการเบิก-จายเงิน": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง"
                    }
                }
            },
            {
                "category": "รายการอางอิง",
                "subcategories": {}
            },
            {
                "category": "ภาคผนวก",
                "subcategories": {
                    "ภาคผนวก ก": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง",
                    "ภาคผนวก ข": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง",
                    "ภาคผนวก ค": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง",
                    "ภาคผนวก ง": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง",
                    "ภาคผนวก จ": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง",
                    "ภาคผนวก ฉ": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง",
                    "ภาคผนวก ช": "รายละเอียดไม่ได้ระบุในเอกสารอ้างอิง"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 32,
        "details": [
            {
                "category": "เนื้อหาที่จะต้องระบุในโปสเตอร์",
                "subcategories": {
                    "ชื่อโครงงาน": "ต้องระบุในโปสเตอร์",
                    "ชื่อนักศึกษา": "ต้องระบุในโปสเตอร์",
                    "ลําดับกลุ่มโครงงาน": "ต้องระบุ (IE xx)",
                    "ชื่ออาจารย์ที่ปรึกษา": "ต้องระบุในโปสเตอร์",
                    "บทนํา": "ต้องระบุในโปสเตอร์",
                    "วัตถุประสงค์": "ต้องระบุในโปสเตอร์",
                    "วิธีดําเนินการ": "ต้องระบุในโปสเตอร์",
                    "ผลการดําเนินงาน": "ต้องระบุในโปสเตอร์",
                    "สรุปผล": "ต้องระบุในโปสเตอร์"
                }
            },
            {
                "category": "การเบิกค่าพิมพ์โปสเตอร์",
                "subcategories": {
                    "งบประมาณ": "กลุ่มละ 350 บาท",
                    "เอกสารที่ต้องใช้": "ใบเสร็จรับเงินที่ถูกต้องตามระเบียบ",
                    "รายการในใบเสร็จ": "ค่าจ้างพิมพ์โปสเตอร์"
                }
            },
            {
                "category": "แบบฟอร์มต่าง ๆ",
                "subcategories": {
                    "แบบยื่นหัวข้อโครงงาน": {
                        "รายละเอียด": "นักศึกษาเขียนส่งหัวข้อโครงงาน อาจารย์ที่ปรึกษาลงนามยืนยัน",
                        "การเสนอชื่อคณะกรรมการ": "อาจารย์ที่ปรึกษาต้องเสนอชื่อคณะกรรมการสอบโครงงาน 4 คน ต่อกลุ่ม"
                    },
                    "แบบขอเข้าเก็บข้อมูลการจัดทําโครงงาน": {
                        "การใช้งาน": "สำหรับโครงงานที่ต้องเก็บข้อมูลในสถานประกอบการ",
                        "ขั้นตอน": "นักศึกษาเขียนคําร้อง เจ้าหน้าที่จัดพิมพ์ข้อมูล หัวหน้าภาควิชาอนุมัติ และส่งเอกสารไปยังสถานประกอบการ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 13,
        "details": [
            {
                "category": "สวนประกอบของโครงงาน",
                "subcategories": {
                    "สวนนําเรื่อง": {
                        "หัวขอโครงงานทางวิศวกรรมอุตสาหการ": {
                            "ปกนอก": [
                                "ใชปกแข็งสีแดงเลือดหมู ตัวอักษรสีทอง",
                                "ชื่อเรื่องโครงงานใชตัวอักษรขนาด 20 พอยต ตัวหนา",
                                "รายละเอียดอื่นใชตัวอักษรขนาด 18 พอยต ตัวหนา",
                                "ตรามหาวิทยาลัยธรรมศาสตรสีทอง ขนาดเสนผาศูนยกลาง 1 นิ้ว",
                                "ชื่อเรื่องโครงงานใชภาษาตามเนื้อหาวิทยานิพนธ",
                                "ชื่อผูเขียนโครงงานพิมพกึ่งกลางหนากระดาษ",
                                "ระบุชื่อปริญญา/สาขาวิชา/คณะ/มหาวิทยาลัย/ปการศึกษา",
                                "บรรทัดสุดทายพิมพ 'ลิขสิทธิ์ของมหาวิทยาลัยธรรมศาสตร'"
                            ]
                        }
                    }
                }
            },
            {
                "category": "สวนเนื้อเรื่อง",
                "subcategories": {}
            },
            {
                "category": "สวนประกอบทายเรื่อง",
                "subcategories": {}
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 8,
        "details": [
            {
                "category": "บทที่ 1 บทนํา",
                "subcategories": {
                    "1.1 ความสําคัญของการจัดทําคู่มือ": "อธิบายถึงความสำคัญของโครงงานทางวิศวกรรมอุตสาหการสำหรับนักศึกษาชั้นปีที่ 4 หรือสูงกว่า, รายละเอียดเกี่ยวกับวิชาที่ต้องผ่านก่อน, การกำหนดการเรียนการสอน 2 ภาคการศึกษา, วัตถุประสงค์ของโครงงาน, และความสำคัญของคู่มือการจัดทำโครงงาน",
                    "1.2 วัตถุประสงค์": {
                        "1": "เพื่อให้นักศึกษาได้ทราบถึงขั้นตอนการจัดทําโครงงานทางวิศวกรรมอุตสาหการและสามารถดําเนินการได้อย่างเป็นระบบ",
                        "2": "เพื่อให้ผู้ปฏิบัติงานใช้เป็นแนวทางในการดําเนินงานได้อย่างถูกต้องและมีประสิทธิภาพ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 28,
        "details": [
            {
                "category": "การดำเนินการโครงงาน",
                "subcategories": {
                    "กรณีได้เกรด_F": "ถ้านักศึกษาได้เกรด F วิชา วอ.496 ในภาคการศึกษาที่ 1 ภาควิชาจะเปิดวิชา วอ.496 ให้อีกครั้งในภาคการศึกษาที่ 2 และจะเปิดวิชา วอ.497 ให้ในภาคฤดูร้อน",
                    "โควตาการพิมพ์": "ภาควิชาจะให้โควตาการพิมพ์งานสําหรับนักศึกษา คนละ 200 หน้า ต่อปีการศึกษา และไม่สามารถซื้อโควตาเพิ่มเติมได้ นักศึกษาต้องจัดสรรการใช้โควต้าเอง",
                    "การจัดทำโปสเตอร์": "กําหนดให้นักศึกษาจัดทําโปสเตอร์โครงงาน สําหรับงานสัปดาห์วิชาการที่คณะวิศวกรรมศาสตร์ จะจัดขึ้นในช่วงเดือนสุดท้ายของการเรียนการสอนภาคการศึกษาที่ 2 คิดเป็น 10 % ของคะแนนโครงงาน"
                }
            },
            {
                "category": "การประเมินผล",
                "subcategories": {
                    "การประเมินผลสอบร่างโครงงาน": {
                        "ลักษณะการสอบ": "การสอบร่างโครงงาน จะเป็นการสอบประเมินในครั้งแรกของภาคการศึกษาที่ 1",
                        "หัวข้อที่สอบ": "หัวข้อของโครงงาน ความสําคัญและปัญหา วัตถุประสงค์ ขอบเขตการศึกษา และผลที่คาดว่าจะได้รับ",
                        "รูปแบบการประเมิน": "ผ่าน หรือ ไม่ผ่าน",
                        "กรณีไม่ผ่าน": "นักศึกษาจะต้องทําการศึกษาหาข้อมูลเพิ่มเติมหรือมีการสอบในหัวข้อใหม่ ซึ่งจะต้องดําเนินการให้แล้วเสร็จภายใน สัปดาห์ที่ 2 ของเดือนตุลาคม",
                        "หลักเกณฑ์การพิจารณา": [
                            "ความชัดเจนของความสําคัญและปัญหา",
                            "การกําหนดวัตถุประสงค์ชัดเจน",
                            "การวางขอบเขตของการศึกษา",
                            "ประโยชน์ที่คาดว่าจะได้รับ",
                            "ความเหมาะสมของแผนปฏิบัติงาน",
                            "ความพร้อมและการนําเสนอ",
                            "การตอบข้อซักถาม"
                        ]
                    },
                    "การสอบความก้าวหน้าโครงงาน": {
                        "ลักษณะการสอบ": "การสอบความก้าวหน้าโครงงานเป็นการสอบครั้งที่ 2 ของภาคการศึกษาที่ 1 ต่อจากการสอบร่างโครงงาน",
                        "หัวข้อที่สอบ": "ศึกษาเพิ่มเติมวรรณกรรม ทฤษฎี และงานวิจัยที่เกี่ยวข้อง รวมถึงการกําหนดวิธีการดําเนินการศึกษา ขั้นตอนการปฏิบัติงาน การออกแบบการ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 17,
        "details": [
            {
                "category": "การเรียงลำดับรายการอ้างอิง",
                "subcategories": {
                    "การพิมพ์รายการที่ไม่จบใน_1_บรรทัด": "ให้พิมพ์บรรทัดต่อๆ มาโดยย่อหน้าเข้ามา 0.5 นิ้ว จนจบรายการนั้นๆ แล้วจึงขึ้นรายการใหม่",
                    "ประเภทของรายการอ้างอิง": {
                        "1": "หนังสือและบทความในหนังสือ",
                        "2": "บทความในวารสาร หนังสือพิมพ์ สารานุกรม",
                        "3": "เอกสารอื่นๆ เช่น วารสาร วิทยานิพนธ์ สื่ออิเล็กทรอนิกส์ และเอกสารอื่นๆ ที่ไม่ได้ตีพิมพ์"
                    },
                    "การลำดับภาษาของรายการอ้างอิง": "ให้เรียงรายการอ้างอิงภาษาไทยพร้อมแยกประเภทก่อน แล้วจึงพิมพ์รายการอ้างอิงภาษาต่างประเทศโดยแยกตามประเภทของข้อมูลที่นำมาอ้างอิง"
                }
            },
            {
                "category": "ภาคผนวก",
                "subcategories": {
                    "ลักษณะของภาคผนวก": "เป็นส่วนที่เพิ่มเติมขึ้นเพื่อช่วยเสริมความเข้าใจในเนื้อหาสาระของโครงงานเรื่องนั้นๆ อาจมีหรือไม่มีก็ได้ตามความเหมาะสมและความจำเป็น",
                    "ตัวอย่างเนื้อหาในภาคผนวก": "การคำนวณต่างๆ แบบสอบถาม และอื่นๆ",
                    "การพิมพ์หน้าแรกของภาคผนวก": "ให้ขึ้นหน้าใหม่ ใช้คำว่า ภาคผนวก พิมพ์อยู่กึ่งกลางหน้ากระดาษ",
                    "กรณีมีหลายภาคผนวก": "ให้พิมพ์เรียงลำดับเป็น ภาคผนวก ก ภาคผนวก ข ภาคผนวก ค ต่อเนื่องกันไปจนหมด"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 24,
        "details": [
            {
                "category": "การใช้คำภาษาต่างประเทศ",
                "subcategories": {
                    "กรณีมีคำไทยใช้อยู่แล้ว": "ให้ใช้คำไทย เช่น โทรศัพท์ โทรสาร",
                    "กรณียังไม่มีคำไทย": "ให้เขียนทับศัพท์ตามหลักราชบัณฑิตยสถาน เช่น เว็บไซต์ มาจาก Web Site",
                    "กรณีราชบัณฑิตยสถานบัญญัติไว้แล้ว": "ให้ใช้ตามที่บัญญัติ เช่น รัฐแอริโซนา รัฐอินดีแอนา",
                    "การวงเล็บคำภาษาต่างประเทศ": "อาจวงเล็บกำกับครั้งแรกครั้งเดียว เช่น เว็บไซต์ (Web Site)",
                    "รูปแบบการพิมพ์คำในวงเล็บ": [
                        "พิมพ์ด้วยตัวเล็กทั้งหมดยกเว้นชื่อเฉพาะ",
                        "พิมพ์ตัวใหญ่เฉพาะอักษรตัวแรกของคำแรก",
                        "พิมพ์อักษรตัวแรกของทุกคำด้วยตัวใหญ่"
                    ]
                }
            },
            {
                "category": "การอ้างอิงและรายการอ้างอิง",
                "subcategories": {
                    "ความหมายของการอ้างอิง": "การระบุแหล่งที่มาของข้อความที่คัดลอกหรือประมวลความคิดมา",
                    "ความหมายของรายการอ้างอิง": "รายละเอียดของเอกสารและข้อมูลทุกรายการที่ใช้ประกอบการทำโครงงาน",
                    "ความสำคัญของรายการอ้างอิง": [
                        "ใช้ตรวจสอบความถูกต้อง",
                        "สร้างความน่าเชื่อถือ",
                        "เป็นประโยชน์ในการค้นคว้าเพิ่มเติม",
                        "ให้เกียรติงานที่นำมาอ้าง",
                        "แสดงจรรยาบรรณไม่ละเมิดผลงานผู้อื่น"
                    ],
                    "รูปแบบการอ้างอิงที่กำหนด": "APA citation style (American Psychological Association Citation Style)"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 12,
        "details": [
            {
                "category": "กระบวนการตรวจสอบและเบิกจ่ายเงินคืนนักศึกษา",
                "subcategories": {
                    "ตรวจสอบเอกสาร": {
                        "เจ้าหน้าที่ตรวจสอบใบเสร็จ": "เจ้าหน้าที่ตรวจสอบใบเสร็จและส่งเอกสารให้งานพัสดุ",
                        "งานพัสดุตรวจสอบ": "งานพัสดุตรวจสอบเอกสาร",
                        "ส่งต่อการเงิน": "หลังจากที่พัสดุได้ตรวจใบเสร็จ เจ้าหน้าที่จึงส่งเรื่องไปยังงานการเงินเพื่อตรวจสอบ"
                    },
                    "การเงินดำเนินการ": {
                        "ตรวจสอบและเบิกจ่าย": "งานการเงินตรวจสอบและทำเรื่องเบิก-จ่าย"
                    },
                    "คืนเงินนักศึกษา": {
                        "แจ้งนักศึกษา": "เมื่อเอกสารทางการเงินเรียบร้อยแล้ว จึงได้แจ้งให้นักศึกษามารับเงินคืน",
                        "รับเงินและลงชื่อ": "นักศึกษามารับเงินคืนและลงชื่อรับเงินกับทางภาควิชาฯ"
                    },
                    "สิ้นสุดกระบวนการ": "จบขั้นตอนการทำงาน"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 30,
        "details": [
            {
                "category": "การประเมินโครงงานทางวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "ประเมินโดยกรรมการสอบ_2_ท่าน": {
                        "สัดส่วนคะแนน": "50%",
                        "หัวข้อการประเมิน": [
                            "การศึกษาค้นหาข้อมูล",
                            "ความถูกต้องและสมบูรณ์ของเนื้อหา (รูปเล่มรายงาน)",
                            "ความเข้าใจและวิธีการดําเนินการ",
                            "ปริมาณงานตามแผนที่วางไว้",
                            "การนําเสนอชัดเจน"
                        ]
                    },
                    "ประเมินโดยอาจารย์ที่ปรึกษา": {
                        "สัดส่วนคะแนน": "40%",
                        "หัวข้อการประเมิน": [
                            "ความถี่ในการเข้าพบ",
                            "การศึกษาค้นหาข้อมูล",
                            "ความเข้าใจและวิธีการดําเนินการ",
                            "ปริมาณงานตามแผนที่วางไว้",
                            "การนําเสนอชัดเจน",
                            "รูปเล่มรายงาน"
                        ]
                    },
                    "ประเมินโดยอาจารย์ผู้ประสานงาน": {
                        "สัดส่วนคะแนน": "10%",
                        "รายละเอียด": "รวบรวมผลประเมินการนําเสนอโครงงานในงานสัปดาห์วิชาการจากคณะกรรมการสอบโครงงาน",
                        "หลักเกณฑ์การพิจารณา": [
                            "รูปแบบโปสเตอร์ (ความสวยงาม+ความคิดสร้างสรรค์)",
                            "เนื้อหาโครงงานและผลลัพธ์",
                            "การนําเสนอผลงานและการตอบคําถาม"
                        ]
                    }
                }
            },
            {
                "category": "การคิดคะแนนวิชาโครงงานทางวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "เทอม_1_(วอ.496)": {
                        "หน่วยกิต": "1 หน่วยกิต",
                        "การคิดคะแนน": {
                            "ประเมินโดยอาจารย์ที่ปรึกษา": "50%",
                            "ประเมินโดยกรรมการสอบ_(2_ท่าน)": "50%"
                        }
                    },
                    "เทอม_2_(วอ.497)": {
                        "หน่วยกิต": "2 หน่วยกิต",
                        "การคิดคะแนน": {
                            "ประเมินโดยอาจารย์ที่ปรึกษา": "40%",
                            "ประเมินโดยกรรมการสอบ_(2_ท่าน)": "50%",
                            "ประเมินโดยอาจารย์ผู้ประสานงาน": "10%"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 3,
        "details": [
            {
                "category": "สารบัญ",
                "subcategories": {
                    "คํานํา": "(1)"
                }
            },
            {
                "category": "บทที่ 1 บทนํา",
                "subcategories": {
                    "1.1 ความสําคัญของการจัดทําคูมือ": "1",
                    "1.2 วัตถุประสงค": "1",
                    "1.3 ประโยชนที่คาดวาจะไดรับ": "2",
                    "1.4 ขอบเขตการดําเนินการ": "2",
                    "1.5 ขั้นตอนการจัดทําโครงงานทางวิศวกรรมอุตสาหการ": "2"
                }
            },
            {
                "category": "บทที่ 2 สวนประกอบของโครงงานทางวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "2.1 สวนนําเรื่อง": {
                        "2.1.1 หัวขอโครงงานทางวิศวกรรมอุตสาหการ": {
                            "2.1.1.1 ปกนอก": "6",
                            "2.1.1.2 ปกใน": "7"
                        },
                        "2.1.2 หนาอนุมัติ": "7",
                        "2.1.3 บทคัดยอ": "7",
                        "2.1.4 กิตติกรรมประกาศ": "7",
                        "2.1.5 สารบัญ": "7",
                        "2.1.6 สารบัญตาราง (ถามี)": "8",
                        "2.1.7 สารภาพ (ถามี)": "8"
                    },
                    "2.2 สวนเนื้อเรื่อง": {
                        "2.2.1 บทที่ 1 บทนํา": "8",
                        "2.2.2 บทที่ 2 วรรณกรรมและงานวิจัยที่เกี่ยวของ": "8",
                        "2.2.3 บทที่ 3 วิธีการวิจัย": "9",
                        "2.2.4 บทที่ 4 ผลการวิจัยและการอภิปรายผล": "9",
                        "2.2.5 บทที่ 5 สรุปผลการวิจัย และขอเสนอแนะ": "9"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 11,
        "details": [
            {
                "category": "ขั้นตอนการดำเนินโครงงาน",
                "subcategories": {
                    "ศึกษาและทดลอง": "ศึกษาข้อมูลเพิ่มเติม ดำเนินการทดลองและสรุปผล คิดวิเคราะห์ตามแผนงาน และสรุปผลการดำเนินงาน",
                    "นำเสนอโครงงาน": "นำเสนอโครงงานในงานสัปดาห์วิชาการคณะวิศวกรรมศาสตร์",
                    "สอบประมวลผล": "นักศึกษาส่งเล่ม ดำเนินการสอบความประมวลผลโครงงาน",
                    "ปรับปรุงรายงาน": "ปรับปรุงแก้ไขข้อมูลให้ถูกต้อง ชัดเจน ตามที่คณะกรรมการสอบได้แจ้งให้ทราบ และจัดทำรายงานให้ถูกต้อง ตามรูปแบบที่ภาควิชากำหนด",
                    "ตรวจรูปแบบ": "เจ้าหน้าที่ตรวจรูปแบบการจัดพิมพ์รายงาน ตามรูปแบบที่ภาควิชากำหนด",
                    "บันทึกข้อมูล": "บันทึกข้อมูลโครงงานทางวิศวกรรมอุตสาหการลงในระบบฐานข้อมูลอ้างอิงของคณะวิศวกรรมศาสตร์",
                    "ส่งรายงานฉบับสมบูรณ์": "ส่งรายงานฉบับสมบูรณ์ให้ภาควิชา"
                }
            },
            {
                "category": "การประเมินผล",
                "subcategories": {
                    "ส่งผลการสอบ": "คณะกรรมการสอบจะต้องส่งผลการสอบประมวลผลมายังภาควิชาฯ เพื่อรวบรวมผลการประเมิน และส่งผลการศึกษาภายหลังจากที่นักศึกษาได้ส่งรายงานฉบับสมบูรณ์แล้ว"
                }
            },
            {
                "category": "การเงิน",
                "subcategories": {
                    "ส่งหลักฐานการเงิน": "นักศึกษานำบิลเงินสด/ใบเสร็จรับเงิน ส่งภาควิชาฯ และเจ้าหน้าที่ตรวจสอบและทำการเบิก-จ่ายตามระเบียบพัสดุ และระเบียบการเงิน"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 9,
        "details": [
            {
                "category": "ประโยชน์ที่คาดว่าจะได้รับ",
                "subcategories": {
                    "ประโยชน์_1": "นักศึกษาได้ทราบถึงวิธีการดําเนินการจัดทําโครงงานทางวิศวกรรมอุตสาหการและดําเนินการได้อย่างถูกต้องเป็นระบบ",
                    "ประโยชน์_2": "ผู้ปฏิบัติงานสามารถดําเนินการได้อย่างถูกต้องและมีประสิทธิภาพ และลดความผิดพลาดที่อาจเกิดขึ้นจากการปฏิบัติงาน",
                    "ประโยชน์_3": "เป็นแหล่งความรู้เกี่ยวกับวิธีการจัดทําโครงงานให้ถูกต้อง และสอดคล้องกับระเบียบและข้อบังคับที่เกี่ยวข้อง"
                }
            },
            {
                "category": "ขอบเขตการดําเนินการ",
                "subcategories": {
                    "กลุ่มเป้าหมาย": "ใช้สําหรับนักศึกษา อาจารย์ และเจ้าหน้าที่ภาควิชาวิศวกรรมอุตสาหการ",
                    "การนําไปใช้": "เป็นแหล่งความรู้ให้ผู้ที่สนใจนําไปประยุกต์ใช้ในการปฏิบัติงานอื่น ๆ ได้"
                }
            },
            {
                "category": "ขั้นตอนการจัดทําโครงงานทางวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "รายละเอียด": "กล่าวถึงขั้นตอนและวิธีการปฏิบัติงานต่าง ๆ ที่เกี่ยวข้องกับการจัดทําโครงงานทางวิศวกรรมอุตสาหการ"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 21,
        "details": [
            {
                "category": "3.4 การพิมพ์อัญประภาษ",
                "subcategories": {
                    "ความหมาย": "อัญประภาษ คือ ข้อความที่ผู้เขียนคัดลอกมาจากข้อเขียนหรือคําพูดของผู้อื่น เพื่อใช้ประกอบเนื้อเรื่องในโครงงาน",
                    "หลักการพิมพ์": {
                        "1_อัญประภาษไม่เกิน_3_บรรทัด": "ให้พิมพ์ต่อจากข้อความในโครงงานได้โดยไม่ต้องขึ้นบรรทัดใหม่ แต่ต้องพิมพ์อยู่ในเครื่องหมายอัญประกาศคู่ (\"……….\")",
                        "2_อัญประภาษเกิน_3_บรรทัด": "ให้พิมพ์ขึ้นบรรทัดใหม่โดยย่อหน้าเข้ามา 0.8 นิ้ว ในกรณีที่มีย่อหน้าภายในอัญประภาษ ให้ย่อหน้าเข้ามาอีก 0.3 นิ้วทุกย่อหน้า ไม่ต้องมีเครื่องหมายอัญประกาศกํากับ",
                        "3_การละเว้นข้อความบางส่วน": "ให้พิมพ์เครื่องหมายจุดสามจุดโดยพิมพ์เว้นระยะ 1 ช่วงตัวอักษรระหว่างจุด (. . .)",
                        "4_ข้อความซ้อนในอัญประภาษ": "ให้ใส่เครื่องหมายอัญประกาศเดี่ยว สาหรับข้อความที่ซ้อนอยู่ เช่น \"…….. '………..' ……….\"",
                        "5_การอ้างอิงที่มา": "ให้เลือกใช้รูปแบบการอ้างอิงรูปแบบใดรูปแบบหนึ่งให้เหมือนกันตลอดทั้งเล่ม"
                    }
                }
            },
            {
                "category": "3.5 การพิมพ์ตาราง",
                "subcategories": {
                    "3.5.1_เลขกํากับและชื่อตาราง": {
                        "หลักการ": "ตารางทุกตารางต้องมีเลขกํากับเพื่อให้อ้างถึงได้ง่าย",
                        "วิธีการกำหนดเลข": "ให้แยกเลขลําดับตารางไว้ในแต่ละบท โดยใช้เลขลําดับตารางเหมือนเลขลําดับบท ตามด้วยเครื่องหมายมหัพภาค ( . ) และเลขบอกลําดับของตารางในบทนั้น",
                        "ตัวอย่าง": "บทที่ 1 ใช้ตารางที่ 1.1 ตารางที่ 1.2 เรียงกันไป, บทที่ 5 ใช้ตารางที่ 5.1 ตารางที่ 5.2 เรียงกันไปตามลําดับ"
                    },
                    "3.5.2_การพิมพ์ตาราง": {
                        "1_องค์ประกอบของตาราง": "ลําดับที่และชื่อของตารางอยู่ส่วนบน ตามด้วยตัวตารางและอาจมีการอ้างอิงที่มาของตาราง และหมายเหตุคําอธิบายเพิ่มเติมในส่วนท้าย",
                        "2_ภาษาที่ใช้": "ให้พิมพ์ตารางโดยใช้ภาษาเดียวกันกับภาษาที่ใช้พิมพ์โครงงาน ยกเว้นกรณีที่มีความจําเป็นต้องคงข้อมูลไว้ตามภาษาเดิมที่คัดลอกมา หรือการนําเสนอข้อมูลในตารางเรื่องนั้น ๆ เป็นภาษาอื่นจะมีความถูกต้องและน่าเชื่อถือในทางวิชาการมากกว่า"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 40,
        "details": [
            {
                "category": "ขั้นตอนการยืนยันข้อมูลและพิมพ์เอกสาร",
                "subcategories": {
                    "การยืนยันเอกสาร": "หน้าโปรแกรมจะกลับมาที่หน้า 'ข้อมูลส่วนบุคคล' ให้เลือกยืนยันเอกสาร",
                    "การตรวจสอบเอกสาร": "โปรแกรมจะเข้าสู่การตรวจสอบเอกสารอีกครั้งหนึ่ง",
                    "การยืนยันข้อมูล": "หากถูกต้องแล้ว ให้เลือก 'ยืนยันข้อมูล'",
                    "การบันทึกข้อมูล": "การบันทึกข้อมูลในระบบ Student ดําเนินการเรียบร้อยแล้ว",
                    "การพิมพ์เอกสาร": "เมื่อยืนยันข้อมูลเรียบร้อยแล้ว ให้ดําเนินการสั่งพิมพ์เอกสาร",
                    "การลงลายมือชื่อ": "ลงลายมือชื่อเพื่อใช้เป็นหลักฐาน",
                    "การใช้เอกสาร": "ใช้เป็นหลักฐานแนบในการส่งรายงานโครงงานฉบับสมบูรณ์"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 43,
        "details": [
            {
                "category": "Research Methodology",
                "subcategories": {
                    "Sample_Size": "25 respondents",
                    "Data_Collection_Method": "Surveyed using questionnaire"
                }
            },
            {
                "category": "Factors Influencing Gait Training Device Purchase for Stroke Patients",
                "subcategories": {
                    "Design_Factors": [
                        "Intuitive",
                        "Portable and lightweight",
                        "Uses small space",
                        "Can be removed and assembled",
                        "Adjustable proportional to body"
                    ],
                    "Safety_Factors": [
                        "Provides emergency automatic stop"
                    ],
                    "Service_Factors": [
                        "Provides warranty",
                        "Long durability",
                        "Quick repair",
                        "Provides complaint center for customers"
                    ],
                    "Availability_Factor": "Can be purchased in hospitals"
                }
            },
            {
                "category": "Proposed Marketing Mix",
                "subcategories": {
                    "Product_Improvement": "Adding an emergency stop button",
                    "Pricing_Strategy": {
                        "Original_Price": "200,000 baht",
                        "New_Pricing_Model": "Rent for 7,500 baht per month",
                        "Additional_Support": "Patient matching with some donation"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 27,
        "details": [
            {
                "category": "ขั้นตอนการส่งเอกสารและจัดสอบ",
                "subcategories": {
                    "การลงนามและส่งเอกสาร": "กรรมการสอบลงนาม และนําแบบฟอร์มฯ ที่อาจารย์ที่ปรึกษาและกรรมการสอบทุกท่านลงนามทุกท่านแล้ว นําเอกสารไปถ่ายสําเนาเอกสารเท่าจํานวนของคณะกรรมการพร้อมเอกสารฉบับจริงส่งให้กับทางภาควิชาฯ เพื่อจัดหาห้องสอบต่อไป",
                    "การจัดสอบ": "การสอบความก้าวหน้าโครงงาน และการสอบประมวลผลโครงงาน ภาควิชาฯ จะดําเนินการจัดสอบให้ในวันเดียวกัน และแจ้งให้อาจารย์และนักศึกษาทราบเวลาในการสอบของแต่ละกลุ่ม"
                }
            },
            {
                "category": "ข้อกําหนดโครงงาน",
                "subcategories": {
                    "การปฐมนิเทศ": "นักศึกษาภาควิชาวิศวกรรมอุตสาหการชั้นปีที่ 4 หรือสูงกว่า จะได้รับการปฐมนิเทศก่อนการจดทะเบียนการศึกษา วิชาโครงงานงานวิศวกรรมอุตสาหการ",
                    "การปฏิบัติตามกําหนดการ": "นักศึกษาจะต้องปฏิบัติงานตามกําหนดการอย่างเคร่งครัด หากนักศึกษาไม่ดําเนินการในขั้นตอนใด จะถูกตัดคะแนนการประเมินผลโครงงานครั้งละ 1 ประจุ (ครึ่งเกรด) ตามข้อกําหนดโครงงาน",
                    "การส่งงานล่าช้าในภาคการศึกษาที่ 1": "หากนักศึกษากลุ่มใดดําเนินการช้ากว่าเวลาที่กําหนดไว้ในตารางกําหนดเวลา ภาควิชาจะลดเกรดที่นักศึกษาควรจะได้ลงครั้งละหนึ่งประจุ (ครึ่งเกรด)",
                    "การส่งงานล่าช้าในภาคการศึกษาที่ 2": "หากนักศึกษากลุ่มใดดําเนินการช้ากว่าเวลาที่กําหนดไว้ในตารางกําหนดเวลา ภาควิชาจะลดเกรดที่นักศึกษาควรจะได้ลงครั้งละหนึ่งประจุ (ครึ่งเกรด)",
                    "บทลงโทษการส่งงานล่าช้า": "ถ้านักศึกษาส่งงานช้ากว่าที่กําหนดทุกครั้ง นักศึกษาจะถูกลดเกรดสองเกรด นั่นคือ จากเกรด A จะได้เกรด C หรือ จากเกรด C จะได้เกรด F",
                    "การประเมินความสมบูรณ์ของเนื้อหา": "จะพิจารณาจากรายงานที่นําส่งฉบับแรกเท่านั้น",
                    "การสอบความก้าวหน้า วอ 496": "นักศึกษาสามารถสอบความก้าวหน้าของวิชา วอ 496 (เทอม 1) ได้เพียง 1 ครั้งเท่านั้น (เกรดตั้งแต่ D ถึง A) ถ้าไม่ผ่านจะถือว่าได้เกรด F ทันที โดยไม่มีการสอบแก้ไข",
                    "การสอบประมวลผล วอ 497": "ในกรณีที่สอบครั้งแรกไม่ผ่าน ให้นักศึกษาทําการนัดวันและเวลากับอาจารย์ที่ปรึกษาและคณะกรรมการเพื่อทําการสอบซ่อมใหม่อีกครั้งภายใน 1 เดือนหลังจากวันที่สอบครั้งแรก แล้วแจ้งให้อาจารย์ผู้ประสานงานและเลขาภาควิชาทราบ และเมื่อทําการสอบซ่อมแล้วนักศึกษาจะมีสิทธ์ได้เกรดน้อยกว่าหรือเท่ากับ C เท่านั้น"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 10,
        "details": [
            {
                "category": "ขั้นตอนการทำโครงงาน",
                "subcategories": {
                    "ปฐมนิเทศ": "ปฐมนิเทศนักศึกษาเพื่อให้ข้อมูลเกี่ยวกับประวัติของอาจารย์ประจําภาควิชาในด้านความรู้ ความถนัด ความเชี่ยวชาญ, กําหนดการจัดทําโครงงาน, ข้อกําหนดโครงงาน ระเบียบและวิธีการปฏิบัติต่าง ๆ",
                    "ศึกษาข้อมูล": "นักศึกษาค้นคว้าหาข้อมูลช่วงปิดภาคการศึกษาและเข้าพบอาจารย์เพื่อขอคําปรึกษาเกี่ยวกับความเป็นไปได้ของหัวข้อที่จะศึกษา",
                    "ส่งหัวข้อ": "นักศึกษาส่งหัวข้อโครงงานที่คาดว่าจะดําเนินการศึกษา อาจารย์พิจารณาหัวข้อและความเป็นไปได้ในการศึกษาค้นคว้า",
                    "แต่งตั้งคณะกรรมการสอบ": "ภาควิชาฯ แต่งตั้งอาจารย์ที่ปรึกษาและกรรมการสอบ ประกาศให้อาจารย์และนักศึกษาทราบ",
                    "ศึกษาข้อมูลที่เกี่ยวข้อง": "นักศึกษาค้นหาข้อมูลเพิ่มเติม",
                    "สอบร่างโครงงาน": "นักศึกษาส่งเล่มสอบร่างโครงงาน ดําเนินการสอบร่างโครงงาน และคณะกรรมการประเมินผลสอบ หากไม่ผ่าน นักศึกษาต้องไปศึกษาข้อมูลเพิ่มเติมและทําการสอบอีกครั้งหนึ่ง",
                    "ศึกษาทฤษฎีและงานวิจัย": "ศึกษาข้อมูลเพิ่มเติม ด้านทฤษฎีและงานวิจัยที่เกี่ยวข้อง วางแผนการปฏิบัติงานและดําเนินงาน",
                    "สอบความก้าวหน้าโครงงาน": "นักศึกษาส่งเล่มสอบความก้าวหน้าโครงงาน ดําเนินการสอบความก้าวหน้าโครงงาน",
                    "ส่งผลสอบ วอ.496": "หลังการสอบความก้าวหน้าโครงงาน คณะกรรมการสอบจะต้องส่งผลการสอบมายังภาควิชาฯ เพื่อรวมรวมผลการประเมิน และส่งผลการศึกษา"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 14,
        "details": [
            {
                "category": "องค์ประกอบของโครงงาน",
                "subcategories": {
                    "ปกใน": {
                        "รายละเอียด": "พิมพ์รายละเอียดเหมือนปกนอกทุกประการ จัดพิมพ์เป็น 2 หน้า คือ หน้าแรกเป็นภาษาไทย หน้าที่สองเป็นภาษาอังกฤษ",
                        "อ้างอิง": "ดูตัวอย่างหน้า 51"
                    },
                    "หน้าอนุมัติ": {
                        "ภาษา": "พิมพ์เป็นภาษาไทยหรือภาษาที่ใช้เขียนโครงงาน",
                        "องค์ประกอบ": "ชื่อมหาวิทยาลัย, ชื่อคณะ, ชื่อผู้เขียน, ชื่อเรื่องโครงงาน, วันอนุมัติโครงงาน, ชื่อและลายมือชื่อกรรมการสอบโครงงาน, อาจารย์ที่ปรึกษาโครงงาน, อาจารย์ที่ปรึกษาโครงงานร่วม (ถ้ามี), และหัวหน้าภาควิชา",
                        "อ้างอิง": "ดูตัวอย่างหน้า 53"
                    },
                    "บทคัดย่อ": {
                        "ภาษา": "จัดพิมพ์ทั้งภาษาไทยและภาษาอังกฤษ โดยเรียงลำดับภาษาไทยก่อนภาษาอังกฤษ",
                        "องค์ประกอบ": [
                            "ชื่อเรื่องโครงงาน, ชื่อผู้เขียน, ชื่อปริญญา, สาขาวิชา/คณะ/มหาวิทยาลัย, อาจารย์ที่ปรึกษา, อาจารย์ที่ปรึกษาร่วม (ถ้ามี), ปีการศึกษาที่สำเร็จการศึกษา",
                            "เนื้อหาบทคัดย่อ: สภาพปัญหา, วัตถุประสงค์, วิธีดำเนินการวิจัย, ผลของการวิจัย, และข้อเสนอแนะโดยย่อ"
                        ],
                        "อ้างอิง": "ดูตัวอย่างหน้า 54"
                    },
                    "กิตติกรรมประกาศ": {
                        "เนื้อหา": "แสดงความขอบคุณบุคคล สถาบัน และ/หรือหน่วยงานที่มีส่วนช่วยเหลือ",
                        "การเขียน": "ใช้ภาษาราชการหรือคำสุภาพ ระบุชื่อจริงพร้อมชื่อสกุลและคำนำหน้าชื่อ รวมถึงยศ ฐานันดรศักดิ์ ราชทินนาม หรือสมณศักดิ์ (ถ้ามี)",
                        "อ้างอิง": "ดูตัวอย่างหน้า 56"
                    },
                    "สารบัญ": {
                        "รายละเอียด": "แสดงส่วนประกอบสำคัญทั้งหมด เรียงตามลำดับพร้อมเลขหน้า",
                        "อ้างอิง": "ดูตัวอย่างหน้า 57"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 5,
        "details": [
            {
                "category": "การพิมพ์และการอ้างอิง",
                "subcategories": {
                    "การพิมพ์คำภาษาต่างประเทศ": "ข้อ 3.7",
                    "การอ้างอิงและรายการอ้างอิง": "ข้อ 3.8"
                }
            },
            {
                "category": "กำหนดการ ข้อกำหนด และการประเมินผล",
                "subcategories": {
                    "กำหนดการ": "ข้อ 4.1",
                    "ข้อกำหนด": "ข้อ 4.2",
                    "การประเมินผล": {
                        "การประเมินผลสอบร่างโครงงาน": "ข้อ 4.3.1",
                        "การสอบความก้าวหน้าโครงงาน": "ข้อ 4.3.2",
                        "การสอบประมวลผลโครงงาน": "ข้อ 4.3.3"
                    },
                    "การจัดทำโปสเตอร์": "ข้อ 4.4"
                }
            },
            {
                "category": "แบบฟอร์มต่างๆ",
                "subcategories": {
                    "แบบยื่นหัวข้อโครงงาน": "ข้อ 4.5.1",
                    "แบบขอเข้าเก็บข้อมูลการจัดทำโครงงาน": "ข้อ 4.5.2",
                    "แบบการตอบรับการเก็บข้อมูล": "ข้อ 4.5.3",
                    "แบบขออนุมัติวันและเวลาสอบโครงงาน": "ข้อ 4.5.4",
                    "แบบคำร้องขอสอบนอกตาราง": "ข้อ 4.5.5",
                    "แบบประเมินผลการสอบร่างโครงงาน": "ข้อ 4.5.6",
                    "แบบประเมินผลการสอบความก้าวหน้า": "ข้อ 4.5.7",
                    "แบบประเมินผลสอบประมวลผล": "ข้อ 4.5.8",
                    "แบบการขออนุมัติงบประมาณ": "ข้อ 4.5.9",
                    "แบบขออนุมัติเบิกเงินโครงงาน": "ข้อ 4.5.10",
                    "แบบฟอร์มการส่งรายงานฉบับสมบูรณ์": "ข้อ 4.5.11",
                    "แบบฟอร์มคำร้องทั่วไป": "ข้อ 4.5.12",
                    "แบบขออนุมัติดำเนินการจัดซื้อวัสดุ": "ข้อ 4.5.13",
                    "แบบขออนุมัติดำเนินการจัดจ้างเหมาบริการ": "ข้อ 4.5.14",
                    "ใบสำคัญจ่าย": "ข้อ 4.5.15"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 33,
        "details": [
            {
                "category": "4.5 แบบฟอร์มต่างๆ",
                "subcategories": {
                    "4.5.3 แบบการตอบรับการเก็บข้อมูล": "แนบไปพร้อมกับจดหมายขอความอนุเคราะห์เข้าเก็บข้อมูลที่ส่งไปยังสถานประกอบการ เพื่อเป็นเอกสารยืนยันการอนุญาตและยินยอมให้เข้าไปเก็บข้อมูลจากสถานประกอบการ",
                    "4.5.4 แบบขออนุมัติวันและเวลาสอบโครงงาน": {
                        "ขั้นตอนการปฏิบัติ": [
                            "1. รับแบบฟอร์มที่ห้องสำนักงานภาควิชา และนัดวันสอบตามตารางว่างของคณะกรรมการสอบ",
                            "2. เข้าพบคณะกรรมการสอบเพื่อยืนยันกำหนดการและขอลงนามรับทราบ",
                            "3. สำเนาแบบฟอร์ม 3 ชุด และส่งที่ภาควิชาเพื่อจัดเตรียมห้องสอบ (ส่งล่วงหน้า 2 วันทำการ)",
                            "4. ติดต่อภาควิชาก่อนวันสอบเพื่อรับทราบห้องสอบ",
                            "5. รับแบบประเมินผลการสอบร่างโครงงาน กรอกข้อมูล และนำไปให้อาจารย์ที่ปรึกษาในห้องสอบ"
                        ]
                    },
                    "4.5.5 แบบคำร้องขอสอบนอกตาราง": "ใช้เมื่อคณะกรรมการสอบมีเวลาว่างไม่ตรงกันในช่วงกำหนดการสอบ เพื่อป้องกันการตัดประจุ นักศึกษาต้องเขียนคำร้องโดยระบุเหตุผล ให้คณะกรรมการลงนามยืนยัน และกำหนดวันสอบใหม่ เพื่อให้อาจารย์ผู้ประสานงานพิจารณา"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 48,
        "details": [
            {
                "category": "รายการอ้างอิง",
                "subcategories": {
                    "สํานักงบประมาณ": {
                        "แหล่งที่_1": "แนวทางการพิจารณาสิ่งของที่จัดเป็นวัสดุและครุภัณฑ์ตามหลักการจําแนกประเภทรายจ่ายตามงบประมาณ (นร ๐๗๐๔/ว๓๗ ลว ๖ ม.ค. ๒๕๕๙). สืบค้นเมื่อวันที่ 1 ตุลาคม 2559, จาก http://www.bb.go.th/bbweb/",
                        "แหล่งที่_2": "ตัวอย่างสิ่งของที่เป็นวัสดุโดยสภาพ. สืบค้นเมื่อวันที่ 1 ตุลาคม 2559, จาก http://www.bb.go.th"
                    },
                    "มหาวิทยาลัยธรรมศาสตร์": {
                        "สํานักหอสมุด": "คู่มือการพิมพ์วิทยานิพนธ์ (พิมพ์ครั้งที่ 8 ฉบับแก้ไขเพิ่มเติม). กรุงเทพฯ โรงพิมพ์มหาวิทยาลัยธรรมศาสตร์. (2556)"
                    },
                    "ปริญญานิพนธ์": {
                        "ผู้เขียน": "ณัฏฐา ตระการอุดมสุข และ วรรณสรณ์ จินตนานุรัตน์",
                        "ปี": "2558",
                        "ชื่อเรื่อง": "กลยุทธ์ทางการตลาดของผลิตภัณฑ์อุปกรณ์ช่วยเดิน สําหรับผู้ป่วยโรคหลอดเลือดสมอง",
                        "สถาบัน": "มหาวิทยาลัยธรรมศาสตร์",
                        "คณะ": "คณะวิศวกรรมศาสตร์",
                        "ภาควิชา": "ภาควิชาวิศวกรรมอุตสาหการ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 1,
        "details": [
            {
                "category": "คู่มือการจัดทำโครงงานทางวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "ผู้จัดทำ": "นางอุษมา พิณสุรงค์",
                    "ตำแหน่ง": "เจ้าหน้าที่บริหารงานทั่วไปปฏิบัติการ",
                    "หน่วยงาน": "ภาควิชาวิศวกรรมอุตสาหการ คณะวิศวกรรมศาสตร์",
                    "สถาบัน": "มหาวิทยาลัยธรรมศาสตร์",
                    "ปีที่จัดทำ": "พ.ศ. 2559"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 47,
        "details": [
            {
                "category": "ใบสําคัญรับเงิน",
                "subcategories": {
                    "การใช้งาน": "ใช้ในกรณีที่ไม่สามารถเรียกใบเสร็จรับเงิน หรือบิลเงินสดจากผู้ขายได้",
                    "ขั้นตอนการขอ": "ผู้จ่ายเงินต้องร้องขอให้ผู้รับเงินเขียนใบสําคัญรับเงิน ตามแบบฟอร์มภาควิชากําหนดทุกครั้ง",
                    "เอกสารประกอบ": "ขอสําเนาบัตรประจําตัวประชาชนของผู้รับเงิน พร้อมลงนามสําเนาถูกต้อง",
                    "ส่วนประกอบที่ถูกต้อง": {
                        "1": "เป็นใบสําคัญรับเงินตามแบบฟอร์มที่ภาควิชากําหนด",
                        "2": "ชื่อ และที่อยู่ของผู้รับเงิน รวมถึงรายละเอียดต่างๆ ตามแบบฟอร์มที่สมบูรณ์ครบถ้วน",
                        "3": "วันที่",
                        "4": "รายละเอียดสินค้าหรือบริการ พร้อมราคาแต่ละรายการ",
                        "5": "ลายเซ็นของผู้รับเงิน"
                    },
                    "การแก้ไขข้อมูล": "หากมีการบันทึกข้อมูลผิด ให้ขีดฆ่าเป็นลายเส้น และต้องลงลายมือชื่อของผู้รับเงินกํากับทุกครั้ง ทุกที่ที่มีการแก้ไข"
                }
            },
            {
                "category": "ขั้นตอนการเบิก-จ่ายเงิน",
                "subcategories": {
                    "ระยะเวลาการดําเนินการ": "ภาควิชาจะดําเนินการทําเรื่องเบิกทุกวันที่ 15 ของเดือน",
                    "ขั้นตอน": {
                        "1": "นักศึกษากรอกแบบฟอร์มการขอเบิกงบประมาณ พร้อมแนบหลักฐานการจ่ายเงินและลงชื่อผู้รับของ",
                        "2": "เจ้าหน้าที่ตรวจข้อมูลบนใบเสร็จรับเงิน บิลเงินสด ใบสําคัญรับเงินให้ครบถ้วน",
                        "3": "เขียนแบบขออนุมัติดําเนินการจัดซื้อวัสดุ หรือ แบบขออนุมัติดําเนินการจัดจ้างเหมาบริการ",
                        "4": "จัดทําเอกสารใบสําคัญจ่าย",
                        "5": "เสนอเรื่องให้หัวหน้าภาควิชา ลงนามอนุมัติ",
                        "6": "ส่งเรื่องให้งานคลังและพัสดุ และงานการเงินตรวจสอบ",
                        "7": "งานคลังและพัสดุ ดําเนินการตรวจสอบตามระเบียบ",
                        "8": "งานการเงิน ดําเนินการการตรวจสอบตามระเบียบ",
                        "9": "เมื่องานการเงินดําเนินการการตรวจสอบเอกสารตรงตามระเบียบ",
                        "10": "เมื่อได้รับการโอนเงินคืนแล้ว เจ้าหน้าที่จึงแจ้งให้นักศึกษามารับเงินคืน"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 22,
        "details": [
            {
                "category": "การพิมพ์ตาราง",
                "subcategories": {
                    "การพิมพ์ลำดับที่และชื่อตาราง": "ให้พิมพ์ไว้เหนือตารางนั้น ๆ โดยพิมพ์คำว่า 'ตารางที่...' ระบุลำดับที่ของตารางโดยใช้ตัวเลขอารบิก เช่น 'ตารางที่ 1.1'",
                    "การพิมพ์ตัวตาราง": "ประกอบด้วยส่วนหัวของตารางและส่วนข้อความในตาราง ให้จัดวางตารางชิดขอบซ้ายของหน้ากระดาษหรือจัดวางให้เหมาะสมสวยงาม",
                    "การพิมพ์ตารางในหน้าเดียวกับเนื้อเรื่อง": "ให้พิมพ์คำว่า ตารางพร้อมเลขกำกับต่อจากเนื้อเรื่อง เว้นห่างจากเนื้อเรื่อง 1 บรรทัด",
                    "การพิมพ์ตารางที่มีความยาวมาก": "ให้พิมพ์ส่วนที่เหลือในหน้าถัดไป ต้องมีลำดับที่และชื่อตารางทุกหน้า และพิมพ์คำว่า (ต่อ) ไว้ในวงเล็บต่อท้ายชื่อของตาราง",
                    "ตารางที่มีความกว้างเกินหน้ากระดาษ": "อาจย่อส่วนลงได้แต่ให้มีขนาดที่สามารถอ่านได้ชัดเจน หรือใช้กระดาษที่มีขนาดใหญ่กว่า A4 และพับเก็บในเล่มได้",
                    "การพิมพ์ตารางตามแนวขวางของกระดาษ": "ให้จัดวางส่วนบนของตารางหันเข้าหาขอบซ้ายของหน้ากระดาษ และวางขอบซ้ายของตัวตารางให้ชิดขอบล่างของหน้ากระดาษ ส่วนเลขหน้าให้ใส่ไว้ที่มุมบนขวา"
                }
            },
            {
                "category": "แหล่งอ้างอิงและหมายเหตุของตาราง",
                "subcategories": {
                    "การอ้างอิงแหล่งที่มาของตาราง": "ให้ลงแหล่งอ้างอิงที่มาของตารางนั้นด้วย โดยพิมพ์ไว้ท้ายสุดในบรรทัดถัดจากตัวตาราง และพิมพ์ให้ตรงกับขอบซ้ายของตาราง หรือพิมพ์ในตำแหน่งที่เหมาะสม",
                    "การพิมพ์คำอธิบายตารางเพิ่มเติม": "ให้พิมพ์ในบรรทัดถัดจากตัวตารางหรือถัดจากบรรทัดอ้างอิง (ถ้ามี)"
                }
            },
            {
                "category": "การพิมพ์ภาพ",
                "subcategories": {
                    "ความหมายของภาพ": "ภาพ หมายถึง รูปภาพ ภาพถ่าย แผนภูมิ แผนที่ แผนภาพ และกราฟ",
                    "การจัดพิมพ์ภาพ": "จะต้องจัดพิมพ์หรือทำสำเนาให้มีความชัดเจน"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 20,
        "details": [
            {
                "category": "การลำดับหน้าสำคัญ",
                "subcategories": {
                    "ความหมาย": "หน้าบอกภาคผนวก",
                    "การพิมพ์": "พิมพ์อยู่กึ่งกลางหน้ากระดาษ อีกหน้าหนึ่งต่างหากก่อนขึ้นภาคหรือตอนนั้น ๆ",
                    "การนับหน้า": "ไม่ต้องนับหน้าและไม่ต้องใส่เลขหน้า"
                }
            },
            {
                "category": "การพิมพ์บทและหัวข้อในบท",
                "subcategories": {
                    "บท": {
                        "การขึ้นบทใหม่": "ขึ้นหน้าใหม่ทุกครั้ง",
                        "เลขลำดับบท": "ต้องมีเลขลำดับบท (บทที่ 1 บทที่ 2 …)",
                        "การพิมพ์": "พิมพ์ 'บทที่ …' ไว้ตรงกลางหน้ากระดาษ",
                        "ชื่อบท": {
                            "ตำแหน่ง": "พิมพ์ชื่อบทในบรรทัดต่อมา",
                            "การขึ้นบรรทัดใหม่": "ใช้วิธีการกดปุ่ม Shift พร้อมปุ่ม Enter",
                            "การจัดรูปแบบ": "ชื่อบทที่ยาวให้แบ่งเป็น 2-3 บรรทัดตามความเหมาะสม เรียงลงมาในลักษณะสามเหลี่ยมหัวกลับ",
                            "รูปแบบตัวอักษร": "ใช้ตัวอักษรเข้มหนา"
                        },
                        "ระยะห่าง": "เว้นระยะห่าง 1 บรรทัดหลังชื่อบท แล้วจึงพิมพ์เนื้อเรื่องต่อไป"
                    },
                    "หัวข้อในบท": {
                        "การแบ่งหัวข้อ": "แบ่งออกเป็นหัวข้อใหญ่ และหัวข้อย่อยตามลำดับ",
                        "หัวข้อใหญ่": {
                            "ตำแหน่ง": "พิมพ์ชิดริมขอบซ้ายของกระดาษ",
                            "ระยะห่าง": "เว้นระยะห่างจากบรรทัดบนและบรรทัดล่าง 1 บรรทัด (ถ้าไม่อยู่ตอนบนสุดของกระดาษ)",
                            "รูปแบบตัวอักษร": "ใช้ตัวอักษรเข้มหนา ขนาด 16 พอยต์",
                            "การกำกับ": "ใส่ตัวเลขกำกับตามบท",
                            "การขึ้นหน้าใหม่": "ถ้าที่ว่างสำหรับพิมพ์เนื้อเรื่องไม่เกิน 1 บรรทัด ให้ยกหัวข้อนั้นไปขึ้นหน้าใหม่"
                        },
                        "การแบ่งหัวข้อย่อย": {
                            "การกำกับ": "ใช้ตัวเลขกำกับ ไม่เกิน 4 ตัว (1.1.1.1)",
                            "การแบ่งย่อยเพิ่มเติม": "ใช้เครื่องหมายวงเล็บ ( ) ช่วย"
                        },
                        "หัวข้อย่อยระดับที่_1": {
                            "ตำแหน่ง": "พิมพ์ที่ย่อหน้าใหม่ห่างจากขอบซ้าย 0.8 นิ้ว",
                            "ระยะห่าง": "เว้นห่างจากบรรทัดบน 1 บรรทัด"
                        },
                        "หัวข้อย่อยระดับที่_2": {
                            "ตำแหน่ง": "พิมพ์ที่ย่อหน้าใหม่ เว้นระยะเพิ่มออกไปจากย่อหน้าเดิมอีก 0.3 นิ้ว",
                            "ระยะห่าง": "พิมพ์ตามบรรทัดพิมพ์ปกติไม่ต้องเว้นห่างจากบรรทัดบน"
                        },
                        "หัวข้อย่อยระดับที่_3_เป็นต้นไป": {
                            "ตำแหน่ง": "พิมพ์ย่อหน้าใหม่ เว้นระยะเพิ่มออกไปจากย่อหน้าเดิมอีก 0.3 นิ้ว ต่อไปเรื่อย ๆ ทุกย่อหน้า"
                        },
                        "รูปแบบตัวอักษร": {
                            "หัวข้อย่อย": "ใช้ตัวอักษรเข้มหนา",
                            "เนื้อเรื่อง": "พิมพ์ย่อหน้าใหม่โดยย่อเข้าไปจากหัวข้อของหัวข้อย่อยนั้น"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 16,
        "details": [
            {
                "category": "2.2.3 บทที่ 3 วิธีการวิจัย",
                "subcategories": {
                    "เนื้อหา": "อธิบายวิธีการต่าง ๆ และสมมุติฐานที่ต้องการศึกษาวิจัยอย่างละเอียด",
                    "กรณีใช้แบบสอบถาม": "อธิบายวิธีการทำแบบสอบถาม ลักษณะของคำถาม หลักเกณฑ์การสุ่มตัวอย่าง วิธีการเก็บรวบรวมข้อมูล วิธีการวิเคราะห์ข้อมูล",
                    "กรณีใช้วิธีการทางสถิติ": "อธิบายขั้นตอนของการคำนวณและการทดสอบสมมุติฐานทางสถิติให้ชัดเจน"
                }
            },
            {
                "category": "2.2.4 บทที่ 4 ผลการวิจัยและอภิปรายผล",
                "subcategories": {
                    "การแสดงผล": "ใช้ตาราง กราฟ แผนภูมิ ภาพประกอบ และอื่น ๆ ตามความเหมาะสม",
                    "การวิเคราะห์": "วิเคราะห์ผลงานวิจัยเพื่อตอบสมมุติฐาน",
                    "การอ้างอิง": "อ้างอิงทฤษฎีและผลการวิจัยอื่น ๆ ที่เกี่ยวข้อง",
                    "การเปรียบเทียบ": "ระบุว่าผลงานสนับสนุนหรือโต้แย้งผลงานวิจัยอื่นอย่างไร",
                    "ความก้าวหน้าทางวิชาการ": "ระบุความก้าวหน้าที่อาจเปลี่ยนแปลงแนวคิดในเรื่องที่ศึกษา"
                }
            },
            {
                "category": "2.2.5 บทที่ 5 สรุปผลการวิจัยและข้อเสนอแนะ",
                "subcategories": {
                    "เนื้อหา": "สรุปเนื้อหาสาระของโครงงานโดยย่อ",
                    "การอ้างอิง": "อ้างย้อนถึงวัตถุประสงค์และวิธีการศึกษาวิจัยโดยสังเขป",
                    "การประยุกต์ใช้": "สรุปการนำผลการศึกษาวิจัยไปประยุกต์ใช้",
                    "ข้อเสนอแนะ": "เสนอแนะแนวทางเพื่อการศึกษาวิจัยในเรื่องเดียวกันต่อไป"
                }
            },
            {
                "category": "2.3 ส่วนประกอบท้ายเรื่อง",
                "subcategories": {
                    "องค์ประกอบ": "ประกอบด้วยรายการอ้างอิง ภาคผนวก"
                }
            },
            {
                "category": "2.3.1 รายการอ้างอิง",
                "subcategories": {
                    "ความหมาย": "รายชื่อหนังสือ สิ่งพิมพ์อื่น ๆ โสตทัศนวัสดุ และสื่ออิเล็กทรอนิกส์ที่ใช้อ้างอิง",
                    "การพิมพ์": "พิมพ์คำว่า 'รายการอ้างอิง' ตรงกลางบรรทัดบนสุดหน้าแรก ห่างจากขอบบน 1.5 นิ้ว",
                    "การเว้นบรรทัด": "เว้น 1 บรรทัดก่อนพิมพ์รายการข้อมูล",
                    "การจัดวาง": "พิมพ์ชิดขอบกระดาษด้านซ้าย ไม่ต้องตั้งการพิมพ์กั้นขวา"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 18,
        "details": [
            {
                "category": "การจัดพิมพ์โครงงาน",
                "subcategories": {
                    "เรื่องทั่วไปเกี่ยวกับการพิมพ์": {
                        "กระดาษที่ใช้พิมพ์": "กระดาษขาว ไม่มีเส้นบรรทัด ความหนาตั้งแต่ 80 แกรมขึ้นไป ขนาดมาตรฐาน A4 พิมพ์หน้าเดียวตลอดทั้งเล่ม",
                        "ตัวพิมพ์": {
                            "ลักษณะทั่วไป": "ตัวอักษรสีดำ ใช้แบบเดียวกันตลอดทั้งเล่ม",
                            "ขนาดและรูปแบบ": [
                                "ใช้ TH Sarabun New ขนาด 16 พอยต์ ตัวพิมพ์ธรรมดา",
                                "ตารางหรือภาพประกอบอนุโลมให้ใช้ตัวพิมพ์ที่เล็กลงหรือย่อส่วนได้",
                                "บทที่ ชื่อบท และชื่อส่วนประกอบต่างๆ ใช้ตัวอักษรเข้มหนา ขนาด 18 พอยต์"
                            ]
                        },
                        "การเว้นขอบกระดาษ": {
                            "ขอบบน": "เว้นระยะ 1.5 นิ้ว นับจากด้านบนตัวอักษร",
                            "ขอบซ้าย": "เว้นระยะ 1.5 นิ้ว",
                            "ขอบขวาและขอบล่าง": "เว้นระยะ 1 นิ้ว",
                            "ข้อควรระวัง": "ท้ายกระดาษเป็นหัวข้อ ต้องมีเนื้อหาต่ออย่างน้อย 1-2 บรรทัด หรือย้ายไปหน้าถัดไปทั้งหมด"
                        },
                        "การเว้นระยะระหว่างบรรทัด": "ใช้ระยะบรรทัดปกติเป็น 1 เท่า ตลอดทั้งเล่ม",
                        "การย่อหน้า": "เว้นระยะห่างจากขอบซ้ายเข้ามา 0.8 นิ้ว"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/ieprojects/",
        "document": "Binder1",
        "page": 2,
        "details": [
            {
                "category": "คู่มือโครงงานทางวิศวกรรมอุตสาหการ",
                "subcategories": {
                    "ที่มา": "อ้างอิงและดัดแปลงข้อมูลจากคู่มือการพิมพ์วิทยานิพนธ์ มหาวิทยาลัยธรรมศาสตร์ ฉบับแก้ไขและเพิ่มเติม พ.ศ. 2556",
                    "วัตถุประสงค์": "เพื่อให้นักศึกษาภาควิชาวิศวกรรมอุตสาหการทราบถึงวิธีการ ขั้นตอน การจัดทำโครงงานทางวิศวกรรมอุตสาหการได้อย่างถูกต้องเป็นระบบ",
                    "ประโยชน์": [
                        "เจ้าหน้าที่ผู้ปฏิบัติงานสามารถดำเนินการได้อย่างถูกต้อง",
                        "สอดคล้องกับระเบียบ และข้อบังคับต่างๆ",
                        "ลดความผิดพลาดที่อาจเกิดขึ้นจากการปฏิบัติงาน"
                    ]
                }
            },
            {
                "category": "โครงสร้างเนื้อหา",
                "subcategories": {
                    "บทที่_1": "บทนำ ความสำคัญของการจัดทำคู่มือ และขั้นตอนในการจัดทำโครงงาน",
                    "บทที่_2": "ส่วนประกอบของโครงงานทางวิศวกรรมอุตสาหการ",
                    "บทที่_3": "รายละเอียดของการจัดพิมพ์โครงงาน",
                    "บทที่_4": "กำหนดการ ข้อกำหนด และการประเมินผล",
                    "บทที่_5": "การส่งรายงานและการบันทึกลงฐานข้อมูล",
                    "บทที่_6": "การเบิก-จ่ายงบประมาณ",
                    "ภาคผนวก": [
                        "ตัวอย่างการพิมพ์",
                        "การจัดวางเนื้อหาและส่วนประกอบของโครงงาน",
                        "รายละเอียดการดำเนินงาน",
                        "แบบฟอร์มต่าง ๆ ที่เกี่ยวข้อง"
                    ]
                }
            },
            {
                "category": "ข้อมูลผู้จัดทำ",
                "subcategories": {
                    "ชื่อ": "นางอุษมา พิณสุรงค์",
                    "ตำแหน่ง": "ผู้จัดทำ"
                }
            }
        ]
    }
]