[
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 41,
        "details": [
            {
                "category": "การพัฒนาหลักสูตรและการเรียนการสอน",
                "subcategories": {
                    "การส่งเสริมประสบการณ์นักศึกษา": {
                        "กิจกรรม": [
                            "สนับสนุนค่าใช้จ่ายให้นักศึกษาได้พัฒนาหัวข้อวิทยานิพนธ์กับอาจารย์ผู้เชี่ยวชาญ ณ สถาบันคู่สัญญาในต่างประเทศ"
                        ],
                        "ตัวชี้วัด": [
                            "จำนวนนักศึกษาที่เดินทางไปพัฒนาหัวข้อวิทยานิพนธ์ยังสถาบันคู่สัญญาในต่างประเทศ"
                        ]
                    },
                    "การเผยแพร่ผลงานทางวิชาการ": {
                        "กิจกรรม": [
                            "กระตุ้นให้คณาจารย์และนักศึกษาตีพิมพ์เผยแพร่ผลงานทางวิชาการต่อสาธารณะ",
                            "ตีพิมพ์บทความทางวิชาการลงวารสาร",
                            "ลงหนังสือพิมพ์"
                        ],
                        "ตัวชี้วัด": [
                            "จำนวนผลงานทางวิชาการของคณาจารย์และนักศึกษา"
                        ]
                    },
                    "การประเมินหลักสูตร": {
                        "กิจกรรม": [
                            "ประเมินผลความพึงพอใจของหลักสูตรและการเรียนการสอนโดยบัณฑิตที่สำเร็จการศึกษา"
                        ],
                        "ตัวชี้วัด": [
                            "รายงานการประเมินหลักสูตรโดยบัณฑิตที่สำเร็จการศึกษา"
                        ]
                    }
                }
            },
            {
                "category": "สิ่งสนับสนุนการเรียนรู้",
                "subcategories": {
                    "การบริหารงบประมาณ": {
                        "รายละเอียด": [
                            "จัดสรรงบประมาณประจำปีทั้งงบประมาณแผ่นดินและเงินรายได้",
                            "จัดซื้อตำรา สื่อการเรียนการสอน โสตทัศนูปกรณ์และวัสดุครุภัณฑ์คอมพิวเตอร์",
                            "สร้างสภาพแวดล้อมให้เหมาะสมกับการเรียนรู้ด้วยตนเองของนักศึกษา",
                            "จัดสรรงบประมาณเพื่อซื้อและซ่อมแซมครุภัณฑ์เพื่อสนับสนุนงานวิจัยของนักศึกษา"
                        ]
                    },
                    "ทรัพยากรการเรียนการสอนที่มีอยู่เดิม": {
                        "แหล่งทรัพยากร": [
                            "สำนักหอสมุดกลาง",
                            "หนังสือและตำราระดับคณะ",
                            "ฐานข้อมูลสำหรับสืบค้น",
                            "อุปกรณ์สนับสนุนการเรียนการสอน"
                        ],
                        "หมวดหนังสือ": {
                            "หมวดวิชาพื้นฐาน": {
                                "มนุษยศาสตร์": "5,438 เล่ม",
                                "สังคมศาสตร์": "14,762 เล่ม",
                                "วิทยาศาสตร์และคณิตศาสตร์": "23,699 เล่ม",
                                "ภาษา": "2,942 เล่ม"
                            },
                            "วิชาเฉพาะด้าน": "ไม่ระบุจำนวน"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 19,
        "details": [
            {
                "category": "อาจารย์ประจำหลักสูตร",
                "subcategories": [
                    {
                        "ลำดับที่": "12",
                        "เลขประจำตัวประชาชน": "3100501000xxx",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "ชื่อ-สกุล": "พงศ์ธร ธูปะเตมีย์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "D.Eng.",
                                "สาขาวิชา": "Materials Process Engineering",
                                "สถาบัน": "Kyushu University, Japan",
                                "ปี": "2543"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Hydrocarbon chemistry Engineering",
                                "สถาบัน": "Kyoto University, Japan",
                                "ปี": "2535"
                            },
                            {
                                "ระดับ": "B.Eng.",
                                "สาขาวิชา": "Hydrocarbon Chemistry Engineering",
                                "สถาบัน": "Kyoto University Japan",
                                "ปี": "2533"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "13",
                        "เลขประจำตัวประชาชน": "3101700601xxx",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "ชื่อ-สกุล": "ทิพบุษฎ์ เอกแสงศรี",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "D.Eng.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "Tokyo Institute of Technology, Japan",
                                "ปี": "2547"
                            },
                            {
                                "ระดับ": "M.S.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "New Jersey Institute of Technology, U.S.A.",
                                "ปี": "2537"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2535"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "14",
                        "เลขประจำตัวประชาชน": "3100201289xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "ไพรัช อุศุภรัตน์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Environmental System Engineering",
                                "สถาบัน": "University of Regina, Canada",
                                "ปี": "2552",
                                "หมายเหตุ": "(หลักสูตรปริญญาโทควบเอก)"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "มหาวิทยาลัยธรรมศาสตร์",
                                "ปี": "2540"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "15",
                        "เลขประจำตัวประชาชน": "3959900235xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "พัชราภรณ์ วุฒิเจริญมงคล",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Polymer Science",
                                "สถาบัน": "Chulalongkorn University",
                                "ปี": "2550",
                                "หมายเหตุ": "(หลักสูตรปริญญาโทควบเอก)"
                            },
                            {
                                "ระดับ": "วท.บ.",
                                "สาขาวิชา": "วิทยาศาสตร์ (เคมี)",
                                "สถาบัน": "มหาวิทยาลัยสงขลานครินทร์",
                                "ปี": "2546"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 29,
        "details": [
            {
                "category": "2.4 ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ",
                "subcategories": {
                    "1) ผลการเรียนรู้ด้านทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": {
                        "คุณสมบัติที่นักศึกษาต้องมี": [
                            "สามารถสื่อสารกับกลุ่มคนหลากหลายและสนทนาทั้งภาษาไทยและภาษาต่างประเทศอย่างมีประสิทธิภาพ",
                            "สามารถให้ความช่วยเหลือและอำนวยความสะดวกแก่การแก้ปัญหาสถานการณ์ต่างๆ ในกลุ่ม",
                            "สามารถใช้ความรู้ในศาสตร์มาชี้นำสังคมในประเด็นที่เหมาะสม",
                            "มีความรับผิดชอบในการกระทำของตนเองและรับผิดชอบงานในกลุ่ม",
                            "สามารถเป็นผู้ริเริ่มแสดงประเด็นในการแก้ไขสถานการณ์ทั้งส่วนตัวและส่วนรวม"
                        ]
                    },
                    "2) กลยุทธ์การสอนที่ใช้ในการพัฒนาการเรียนรู้ด้านทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": "ใช้การสอนที่มีการกำหนดกิจกรรมให้มีการทำงานเป็นกลุ่ม การทำงานที่ต้องประสานงานกับผู้อื่น หรือต้องค้นคว้าหาข้อมูลจากการสัมภาษณ์บุคคลอื่น หรือผู้มีประสบการณ์",
                    "3) กลยุทธ์การประเมินผลการเรียนรู้ด้านทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": "ประเมินจากพฤติกรรมและการแสดงออกของนักศึกษาในการนำเสนอหัวข้อวิทยานิพนธ์ และสังเกตจากพฤติกรรมที่แสดงออกในการร่วมกิจกรรมต่างๆ และความครบถ้วนชัดเจนตรงประเด็นของข้อมูล"
                }
            },
            {
                "category": "2.5 ทักษะในการวิเคราะห์เชิงตัวเลข การสื่อสาร และการใช้เทคโนโลยีสารสนเทศ",
                "subcategories": {
                    "1) ผลการเรียนรู้ด้านทักษะการวิเคราะห์เชิงตัวเลข การสื่อสาร และการใช้เทคโนโลยีสารสนเทศ": [
                        "มีทักษะในการใช้เครื่องมือที่จำเป็นที่มีอยู่ในปัจจุบันต่อการทำงานที่เกี่ยวกับคอมพิวเตอร์"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 44,
        "details": [
            {
                "category": "ตัวบ่งชี้ผลการดำเนินงาน (Key Performance Indicators)",
                "subcategories": [
                    {
                        "indicator": "อาจารย์ผู้รับผิดชอบหลักสูตรอย่างน้อยร้อยละ 80 มีส่วนร่วมในการประชุมเพื่อวางแผน ติดตาม และทบทวนการดำเนินงานหลักสูตร",
                        "years_applicable": [
                            1,
                            2,
                            3,
                            4,
                            5
                        ]
                    },
                    {
                        "indicator": "มีรายละเอียดของหลักสูตร ตามแบบ มคอ.2 ที่สอดคล้องกับกรอบมาตรฐานคุณวุฒิแห่งชาติ หรือ มาตรฐานคุณวุฒิสาขา/สาขาวิชา (ถ้ามี)",
                        "years_applicable": [
                            1,
                            2,
                            3,
                            4,
                            5
                        ]
                    },
                    {
                        "indicator": "มีรายละเอียดของรายวิชา และรายละเอียดของประสบการณ์ภาคสนาม (ถ้ามี) ตามแบบ มคอ.3 และ มคอ.4 อย่างน้อยก่อนการเปิดสอนในแต่ละภาคการศึกษาให้ครบทุกรายวิชา",
                        "years_applicable": [
                            1,
                            2,
                            3,
                            4,
                            5
                        ]
                    },
                    {
                        "indicator": "จัดทำรายงานผลการดำเนินการของรายวิชา และรายงานผลการดำเนินการของประสบการณ์ภาคสนาม (ถ้ามี) ตามแบบ มคอ.5 และมคอ.6 ภายใน 30 วัน หลังสิ้นสุดภาคการศึกษาที่เปิดสอนให้ครบทุกรายวิชา",
                        "years_applicable": [
                            1,
                            2,
                            3,
                            4,
                            5
                        ]
                    },
                    {
                        "indicator": "จัดทำรายงานผลการดำเนินการของหลักสูตร ตามแบบ มคอ.7 ภายใน 60 วัน หลังสิ้นสุดปีการศึกษา",
                        "years_applicable": [
                            1,
                            2,
                            3,
                            4,
                            5
                        ]
                    },
                    {
                        "indicator": "มีการทวนสอบผลสัมฤทธิ์ของนักศึกษาตามมาตรฐานผลการเรียนรู้ที่กำหนดใน มคอ.3 และมคอ.4 (ถ้ามี) อย่างน้อยร้อยละ 25 ของรายวิชาที่เปิดสอนในแต่ละปีการศึกษา",
                        "years_applicable": [
                            1,
                            2,
                            3,
                            4,
                            5
                        ]
                    },
                    {
                        "indicator": "มีการพัฒนา/ปรับปรุง การจัดการเรียนการสอน กลยุทธ์การสอนหรือ การประเมินผลการเรียนรู้ จากผลการประเมินการดำเนินงานที่รายงานใน มคอ.7 ปีที่แล้ว",
                        "years_applicable": [
                            2,
                            3,
                            4,
                            5
                        ]
                    },
                    {
                        "indicator": "อาจารย์ใหม่ (ถ้ามี) ทุกคน ได้รับการปฐมนิเทศหรือคำแนะนำด้านการจัดการเรียนการสอน",
                        "years_applicable": [
                            1,
                            2,
                            3,
                            4,
                            5
                        ]
                    },
                    {
                        "indicator": "อาจารย์ประจำหลักสูตรทุกคนได้รับการพัฒนาทางวิชาการ และ/หรือวิชาชีพ อย่างน้อยปีละหนึ่งครั้ง",
                        "years_applicable": [
                            1,
                            2,
                            3,
                            4,
                            5
                        ]
                    },
                    {
                        "indicator": "จำนวนบุคลากรสนับสนุนการเรียนการสอน (ถ้ามี) ได้รับการพัฒนาวิชาการ และ/หรือวิชาชีพ ไม่น้อยกว่าร้อยละ 50 ต่อปี",
                        "years_applicable": [
                            1,
                            2,
                            3,
                            4,
                            5
                        ]
                    },
                    {
                        "indicator": "ระดับความพึงพอใจของนักศึกษาปีสุดท้าย/บัณฑิตใหม่ที่มีต่อคุณภาพหลักสูตร เฉลี่ยไม่น้อยกว่า 3.5 จากคะแนนเต็ม 5.0",
                        "years_applicable": [
                            4,
                            5
                        ]
                    },
                    {
                        "indicator": "ระดับความพึงพอใจของผู้ใช้บัณฑิตที่มีต่อบัณฑิตใหม่ เฉลี่ยไม่น้อยกว่า 3.5 จากคะแนนเต็ม 5.0",
                        "years_applicable": [
                            5
                        ]
                    }
                ]
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 39,
        "details": [
            {
                "category": "การให้คำปรึกษาและช่วยเหลือนักศึกษา",
                "subcategories": {
                    "การควบคุมจำนวนนักศึกษาต่ออาจารย์ที่ปรึกษา": "มีการควบคุมจำนวนนักศึกษาต่ออาจารย์ที่ปรึกษาให้เป็นไปตามเกณฑ์ที่กำหนด โดยมีการจัดทำตารางสรุปจำนวนนักศึกษาในที่ปรึกษาของอาจารย์แต่ละท่านตามปีการศึกษาปัจจุบัน",
                    "การติดตามให้คำปรึกษาแก่นักศึกษาระดับบัณฑิตศึกษา": "มีการติดตามให้คำปรึกษาแก่นักศึกษาระดับบัณฑิตศึกษาที่ทำวิทยานิพนธ์ โดยได้จัดทำแบบติดตามและประเมินความก้าวหน้า ในการขออนุมัติสอบ เพื่อให้นักศึกษาได้ติดต่อ และเข้าพบอาจารย์ที่ปรึกษา โดยผ่านช่องทางต่าง ๆ เช่น E-mail, ไลน์กลุ่ม, เฟสบุค และผ่านโทรศัพท์",
                    "การบริหารจัดการความเสี่ยงของนักศึกษา": "มีการบริหารจัดการความเสี่ยงของนักศึกษา เพื่อให้สามารถสำเร็จการศึกษาได้ตามระยะเวลาที่หลักสูตรกำหนด โดยมีการติดตามและประเมินผลการเรียนของนักศึกษาทุกคน"
                }
            },
            {
                "category": "การคงอยู่ การสำเร็จการศึกษา",
                "subcategories": {
                    "อัตราการคงอยู่ของนักศึกษา": "จำนวนนักศึกษาที่ลาออก/ถูกถอนชื่อในแต่ละปีการศึกษาเนื่องจากมีปัญหาทางด้านการเงิน ทำให้ไม่สามารถเรียนได้ครบตามกำหนดของหลักสูตรฯ",
                    "การสำเร็จการศึกษา": "นักศึกษาเป็นผู้มีงานทำประจำ อาจจะมีภาระงานเพิ่มขึ้นโดยที่ไม่ได้คาดหมาย ทำให้การทำวิทยานิพนธ์ไม่ต่อเนื่องและไม่ได้ดำเนินการตามแผนการทำวิจัยที่วางแผนไว้ ทำให้ไม่สามารถจบได้ทันตามกำหนดของหลักสูตร และรอการตอบรับผลงานตีพิมพ์ซึ่งต้องใช้ระยะเวลา"
                }
            },
            {
                "category": "ความพึงพอใจและการจัดการข้อร้องเรียนของนักศึกษา",
                "subcategories": {
                    "การประเมินความพึงพอใจ": "หลักสูตรฯ มีการประเมินความพึงพอใจของนักศึกษาต่อคุณภาพหลักสูตร",
                    "ช่องทางการร้องเรียน": "ผ่านอาจารย์ที่ปรึกษา ผ่านทางอีเมล์ ผ่านทางไลน์ หรือนักศึกษาส่งข้อร้องเรียนด้วยตนเอง",
                    "ขั้นตอนการจัดการข้อร้องเรียน": [
                        "นักศึกษาส่งข้อร้องเรียนผ่านช่องทางต่าง ๆ ที่หลักสูตรกำหนด",
                        "เจ้าหน้าที่รวบรวมข้อร้องเรียนนำเสนอต่อผู้อำนวยการโครงการบัณฑิตศึกษา",
                        "ผู้อำนวยการโครงการฯ นำเสนอเข้าที่ประชุมฯ เพื่อให้คณะกรรมการพิจารณา และหาแนวทางแก้ไข",
                        "แจ้งผล และแนวทางแก้ไขให้นักศึกษาทราบ"
                    ]
                }
            },
            {
                "category": "การอุทธรณ์ของนักศึกษา",
                "subcategories": {
                    "ระเบียบการอุทธรณ์": "ให้เป็นไปตามระเบียบและข้อบังคับของคณะวิศวกรรมศาสตร์และตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยวินัยนักศึกษา พ.ศ. 2564"
                }
            },
            {
                "category": "อาจารย์",
                "subcategories": {
                    "การรับอาจารย์ใหม่": "อาจารย์ประจำต้องมีคุณวุฒิเป็นไปตามประกาศกระทรวงศึกษาธิการ เรื่อง เกณฑ์มาตรฐานหลักสูตรระดับบัณฑิตศึกษา พ.ศ.2558 และมีความเข้าใจถึงวัตถุประสงค์และเป้าหมายของหลักสูตร มีความรู้ มีทักษะในการจัดการเรียนการสอน และการประเมินผลสัมฤทธิ์ของนักศึกษา ประสบการณ์ทำวิจัยหรือประสบการณ์ประกอบวิชาชีพในสาขาวิชาที่สอน"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 67,
        "details": [
            {
                "category": "มคอ.2",
                "subcategories": {
                    "ฉบับปรับปรุง_พ.ศ._2560": {
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "กพ. 893",
                                "ชื่อวิชา": "สัมมนา 2",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "กพ. 894",
                                "ชื่อวิชา": "สัมมนา 3",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "กพ. 901",
                                "ชื่อวิชา": "วิทยานิพนธ์",
                                "หน่วยกิต": 48
                            }
                        ]
                    },
                    "ฉบับปรับปรุง_พ.ศ._2565": {
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "กพ. 893",
                                "ชื่อวิชา": "สัมมนา 2",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "กพ. 894",
                                "ชื่อวิชา": "สัมมนา 3",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "กพ. 901",
                                "ชื่อวิชา": "วิทยานิพนธ์",
                                "หน่วยกิต": 48
                            }
                        ]
                    },
                    "สรุปการเปลี่ยนแปลง": "ไม่มีการเปลี่ยนแปลงในรายวิชาที่แสดง"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 45,
        "details": [
            {
                "category": "การประเมินและปรับปรุงการดำเนินการของหลักสูตร",
                "subcategories": {
                    "การประเมินประสิทธิผลของการสอน": {
                        "การประเมินกลยุทธ์การสอน": "ประเมินจากช่วงก่อนการสอนโดยทีมผู้สอนหรือระดับภาควิชา และ/หรือการปรึกษาผู้เชี่ยวชาญ ช่วงหลังการสอนวิเคราะห์ผลการประเมินการสอนโดยนักศึกษาและผลการเรียน นำผลไปปรับปรุงโดยทีมผู้สอนและรายงานผล",
                        "การประเมินทักษะของอาจารย์ในการใช้แผนกลยุทธ์การสอน": "ประเมินโดยนักศึกษาในแต่ละวิชา, การสังเกตการณ์ของผู้รับผิดชอบหลักสูตร, ประเมินภาพรวมโดยบัณฑิตใหม่"
                    },
                    "การประเมินหลักสูตรในภาพรวม": {
                        "ประเมินจากนักศึกษาและศิษย์เก่า": "ประเมินจากผลการทำวิทยานิพนธ์ของนักศึกษา และใช้แบบสอบถามหรือจัดประชุมสำหรับศิษย์เก่า",
                        "ประเมินจากนายจ้างหรือสถานประกอบการ": "สัมภาษณ์หรือส่งแบบสอบถามไปยังผู้ใช้ดุษฎีบัณฑิต",
                        "ประเมินโดยผู้ทรงคุณวุฒิหรือที่ปรึกษา": "เชิญผู้ทรงคุณวุฒิมาให้ความเห็นหรือใช้ข้อมูลจากรายงานผลการดำเนินงานหลักสูตรหรือรายงานการประกันคุณภาพภายใน"
                    },
                    "การประเมินผลการดำเนินงานตามรายละเอียดหลักสูตร": "เป็นไปตามการประเมินคุณภาพหลักสูตรตามหลักเกณฑ์ของ สป.อว.",
                    "การทบทวนผลการประเมินและวางแผนปรับปรุง": {
                        "การทบทวนผลการประเมิน": "รวบรวมข้อเสนอแนะ/ข้อมูลจากการประเมิน และวิเคราะห์ทบทวนโดยผู้รับผิดชอบหลักสูตร",
                        "กระบวนการวางแผนปรับปรุงหลักสูตร": "ศึกษาผลการประเมิน, วิเคราะห์หากลยุทธ์, ปรับปรุงหลักสูตรให้ทันสมัยและสอดคล้องกับความต้องการของผู้ใช้บัณฑิต โดยดำเนินการทุก 5 ปี"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 35,
        "details": [
            {
                "category": "กระบวนการทวนสอบมาตรฐานผลสัมฤทธิ์ของนักศึกษา",
                "subcategories": {
                    "วัตถุประสงค์": "เพื่อแสดงหลักฐานยืนยันหรือสนับสนุนว่านักศึกษาและดุษฎีบัณฑิตทุกคนมีมาตรฐานผลการเรียนรู้ทุกด้าน เป็นไปตามที่กำหนดไว้ในมาตรฐานคุณวุฒิระดับปริญญาเอก สาขาวิชาเทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อม",
                    "การทวนสอบขณะนักศึกษายังไม่สำเร็จการศึกษา": {
                        "ขอบเขต": "ทุกรายวิชา ทั้งภาคทฤษฎี ภาคปฏิบัติ การสัมมนา การทำวิทยานิพนธ์",
                        "ผู้รับผิดชอบ": "อาจารย์ผู้สอน",
                        "กระบวนการ": [
                            "ออกข้อสอบหรือกำหนดกลไกและกระบวนการสอบ",
                            "ประเมินแผนการสอนสัมพันธ์กับการประเมินข้อสอบ",
                            "ประเมินผลสัมฤทธิ์ทางการเรียนการสอนจากผลการสอบ",
                            "ประเมินอาจารย์",
                            "ประเมินผลการเรียนการสอนโดยนักศึกษาเอง"
                        ],
                        "ผู้ประเมิน": [
                            "คณะกรรมการประจำหลักสูตร",
                            "คณะกรรมการผู้ทรงคุณวุฒิทั้งจากภายในและภายนอกสถาบัน"
                        ],
                        "ระดับหลักสูตร": "มีระบบประกันคุณภาพภายใน เพื่อดำเนินการทวนสอบมาตรฐานผลการเรียนรู้และรายงานผล"
                    },
                    "การทวนสอบหลังจากนักศึกษาสำเร็จการศึกษา": {
                        "วิธีการ": "การทำวิจัยสัมฤทธิผลของการประกอบอาชีพหรือการศึกษาต่อของดุษฎีบัณฑิต",
                        "ความถี่": "อย่างต่อเนื่อง",
                        "การนำผลไปใช้": "เป็นข้อมูลในการประเมินคุณภาพของหลักสูตร การพัฒนาหรือปรับปรุงหลักสูตร และกระบวนการเรียนการสอน",
                        "หัวข้อการทวนสอบ": [
                            "สภาวะการได้งานทำหรือศึกษาต่อของดุษฎีบัณฑิต",
                            "ตำแหน่งงานและความก้าวหน้าในสายงานของดุษฎีบัณฑิต",
                            "ความพึงพอใจของดุษฎีบัณฑิตต่อความรู้ความสามารถที่ได้เรียนรู้จากหลักสูตร",
                            "ความพึงพอใจของผู้ใช้ดุษฎีบัณฑิตหรือนายจ้าง",
                            "ความพึงพอใจของสถาบันการศึกษาอื่นซึ่งรับดุษฎีบัณฑิตที่สำเร็จจากหลักสูตรเข้าศึกษาต่อ",
                            "ความเห็นและข้อเสนอแนะจากอาจารย์พิเศษและผู้ทรงคุณวุฒิภายนอก",
                            "ผลงานของนักศึกษาและดุษฎีบัณฑิตที่สามารถวัดเป็นรูปธรรมได้"
                        ],
                        "ตัวอย่างผลงานที่วัดได้": [
                            "จำนวนผลงานวิจัยที่เผยแพร่",
                            "จำนวนสิทธิบัตร",
                            "จำนวนกิจกรรมเพื่อสังคมและประเทศชาติ",
                            "จำนวนกิจกรรมอาสาสมัครในองค์กรที่ทำประโยชน์เพื่อสังคม"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 53,
        "details": [
            {
                "category": "อาจารย์ประจำหลักสูตร",
                "subcategories": {
                    "ผู้ช่วยศาสตราจารย์_ดร.วรรัตน์_ปัตรประกร": {
                        "ผลงานทางวิชาการ": [
                            {
                                "ประเภท": "บทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุมวิชาการระดับนานาชาติ",
                                "คะแนน": 0.4,
                                "รายละเอียด": [
                                    "Pattaraprakorn, W. Optimal Sizing of Energy Storage Systems in Power Distribution Systems for Outage Cost Minimization in Thailand. 12th GMSARN International Conference on Energy Connectivity, Environment and Development in GMS, 28-Nov-2017, 1-7."
                                ]
                            },
                            {
                                "ประเภท": "บทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุมวิชาการระดับชาติ",
                                "คะแนน": 0.2,
                                "รายละเอียด": [
                                    "วรรัตน์ ปัตรประกร, พรระพีพัฒน์ ภาสบุตร. (2561). กำลังผลิตติดตั้งสูงสุดที่เหมาะสมของโรงไฟฟ้าพลังงานแสงอาทิตย์ในเขต ภาคเหนือของประเทศไทย. การประชุมวิชาการระดับชาติ \"มศว.วิจัย\", ครั้งที่ 11 , 29 มี.ค. - 30 มี.ค. 2561, 871- 882.",
                                    "วรรัตน์ ปัตรประกร, พรระพีพัฒน์ ภาสบุตร. (2561). กำลังผลิตติดตั้งสูงสุดที่เหมาะสมของโรงไฟฟ้าพลังงานแสงอาทิตย์ในเขต ภาคตะวันออกของประเทศไทย. การประชุมวิชาการระดับชาติ \"วลัยลักษณ์วิจัย\", ครั้งที่ 10, 27 มี.ค.- 28 มี.ค. 2561, 1-7."
                                ]
                            }
                        ]
                    },
                    "ผู้ช่วยศาสตราจารย์_ดร.สุพิชชา_รุ่งโรจน์นิมิตชัย": {
                        "ผลงานทางวิชาการ": [
                            {
                                "ประเภท": "บทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติ",
                                "คะแนน": 1,
                                "รายละเอียด": [
                                    "ศิรินภา มายอด และ สุพิชชา รุ่งโรจน์นิมิตชัย, การผลิตตัวดูดซับไอออนปรอทและไอออนซัลไฟด์จากยางรถยนต์ใช้แล้ว, วารสารวิชาการพระจอมเกล้าพระนครเหนือ, เล่มที่ 30, เลขที 3,หน้า 416–431, กค.-กย. 2563.",
                                    "S. Hiranphinyophat, S. Rungrodnimitchai \"Oxidation of Palm Shell Coal Using HNO3/H3PO4-NaNO2 System for Adsorbents\" Defect and Diffusion Forum, Vol. 382, 10 January 2018, pp 312-317",
                                    "Supitcha Rungrodnimitchai and Ditpon Kotatha, New adsorbents for nitrate from modified ground tire rubber, Reactive and Functional Polymers, Vol. 136, 2019, pp 9–18. (ISI Q1)"
                                ]
                            }
                        ]
                    },
                    "ผู้ช่วยศาสตราจารย์_ดร.บรรพต_ศิริณัฐสมบูรณ์": {
                        "ผลงานทางวิชาการ": [
                            {
                                "ประเภท": "บทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติ",
                                "คะแนน": 1,
                                "รายละเอียด": [
                                    "Takeguchi T., Sirinutsomboon B., Wongsawa T., & Ui K. (2017). Effect of valency of Sn in Sn-modified Pt-Ru catalyst on CO tolerance and HOR activity for PEFC. ECS Transactions, 77(11), 1375-1382."
                                ]
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 59,
        "details": [
            {
                "category": "วัตถุประสงค์ของหลักสูตร",
                "subcategories": {
                    "วัตถุประสงค์_1": "เพื่อผลิตนักวิจัยระดับสูงในสาขาวิชาการจัดการพลังงานและสิ่งแวดล้อมที่มีความรู้ควบคู่กับคุณธรรม และมีความสามารถในการพัฒนาเทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อมในภาครัฐบาลและภาคอุตสาหกรรม",
                    "วัตถุประสงค์_2": "เพื่อผลิตบัณฑิตที่มีความรู้ความสามารถในด้านการจัดการพลังงานและการจัดการสิ่งแวดล้อม เพื่อวางแผนจัดการและพัฒนากระบวนการหรือเทคโนโลยีรวมทั้งการแก้ไขวิกฤตด้านพลังงานและสิ่งแวดล้อมในระดับนานาชาติที่หลากหลายและซับซ้อนให้มีประสิทธิภาพสูงสุด"
                }
            },
            {
                "category": "คุณสมบัติของผู้เข้าศึกษา",
                "subcategories": {
                    "ข้อบังคับ": "คุณสมบัติของผู้มีสิทธิสมัครเข้าเป็นนักศึกษาต้องเป็นไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาระดับบัณฑิตศึกษา พ.ศ. 2561 ข้อ 22 – 23 (แก้ไขเพิ่มเติมถึงฉบับปัจจุบัน)",
                    "คุณสมบัติทั่วไป": {
                        "1": "ส าเร็จการศึกษาขั้นต่ าตามที่ก าหนดไว้ในข้อก าหนดหลักสูตร",
                        "2": "ไม่เป็นผู้ป่วย หรืออยู่ในสภาวะที่จะเป็นอุปสรรคร้ายแรงต่อการศึกษา",
                        "3": "ไม่เป็นผู้ประพฤติผิดศีลธรรมอันดี หรือมีพฤติกรรมเสื่อเสียอย่างร้ายแรง",
                        "4": "ต้องไม่เคยถูกคัดชื่อออกจากมหาวิทยาลัยหรือสถาบันอุดมศึกษาอื่น"
                    }
                }
            },
            {
                "category": "การเปลี่ยนแปลง",
                "subcategories": {
                    "คุณสมบัติผู้เข้าศึกษา": "ปรับคุณสมบัติผู้เข้าศึกษาตามข้อบังคับฯ พ.ศ.2561",
                    "ผลสอบภาษาอังกฤษ": "น าเงื่อนไขการส่งผลสอบภาษาอังกฤษจากหัวข้อการคัดเลือกผู้เข้าศึกษาเดิม ใส่ในหัวข้อคุณสมบัติผู้เข้าศึกษา"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 38,
        "details": [
            {
                "category": "อาจารย์",
                "subcategories": {
                    "ผู้ทรงคุณวุฒิภายนอก": "ต้องมีคุณวุฒิปริญญาเอกหรือเทียบเท่า และมีผลงานทางวิชาการที่ได้รับการตีพิมพ์เผยแพร่ในวารสารที่มีชื่ออยู่ในฐานข้อมูลที่เป็นที่ยอมรับในระดับนานาชาติ ซึ่งตรงหรือสัมพันธ์กับหัวข้อวิทยานิพนธ์ ไม่น้อยกว่า 5 เรื่อง",
                    "อาจารย์ผู้สอน": "ต้องเป็นอาจารย์ประจาหรืออาจารย์พิเศษ ที่มีคุณวุฒิปริญญาเอกหรือเทียบเท่า หรือขั้นต่ำปริญญาโทหรือเทียบเท่าที่มีตำแหน่งรองศาสตราจารย์ ในสาขาวิชานั้นหรือสาขาวิชาที่สัมพันธ์กัน หรือในสาขาวิชาของรายวิชาที่สอน และต้องมีประสบการณ์ด้านการสอนและมีผลงานทางวิชาการที่ไม่ใช่ส่วนหนึ่งของการศึกษาเพื่อรับปริญญา และเป็นผลงานทางวิชาการที่ได้รับการเผยแพร่ตามหลักเกณฑ์ที่กำหนดในการพิจารณาแต่งตั้งให้บุคคลดำรงตำแหน่งทางวิชาการอย่างน้อย 1 รายการ ในรอบ 5 ปีย้อนหลัง",
                    "อาจารย์ผู้รับผิดชอบหลักสูตร": "จะวางแผนการจัดการเรียนการสอนร่วมกับผู้บริหารของคณะและอาจารย์ผู้สอน ติดตามและรวบรวมข้อมูล สำหรับใช้ในการปรับปรุงและพัฒนาหลักสูตรโดยกระทำทุกปีอย่างต่อเนื่อง และมีการประเมินและทบทวนเพื่อปรับปรุงให้หลักสูตรมีการพัฒนาอย่างต่อเนื่องในทุก 5 ปี เพื่อให้ทันต่อการเปลี่ยนแปลงของเทคโนโลยี และสอดคล้องความต้องการของสังคมและผู้ใช้บัณฑิต"
                }
            },
            {
                "category": "บัณฑิต",
                "subcategories": {
                    "การสำรวจคุณภาพบัณฑิต": "มีการสำรวจคุณภาพของบัณฑิตที่จบการศึกษาตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ 5 ด้าน คือ (1) ด้านคุณธรรมจริยธรรม (2) ด้านความรู้ (3) ด้านทักษะทางปัญญา (4) ด้านทักษะความสัมพันธ์ระหว่างบุคคล และ (5) ด้านทักษะการวิเคราะห์เชิงตัวเลข การสื่อสารและการใช้เทคโนโลยีสารสนเทศ",
                    "การติดตามข้อมูล": "ติดตามข้อมูลความรู้และทักษะที่เป็นที่ต้องการด้านพลังงานและสิ่งแวดล้อม ซึ่งเปลี่ยนแปลงความก้าวหน้าทางเทคโนโลยี ที่เกี่ยวข้อง"
                }
            },
            {
                "category": "นักศึกษา",
                "subcategories": {
                    "กระบวนการรับนักศึกษา": "คณะจะแต่งตั้งคณะกรรมการสอบข้อเขียนและสัมภาษณ์ จำนวน 3-5 ท่านต่อผู้เข้าสอบ 1 คน โดยจะมีการประชุมกรรมการเพื่อชี้แจงหลักเกณฑ์การพิจารณาก่อนสอบทุกครั้ง เพื่อคัดเลือกนักศึกษาที่มีคุณสมบัติเหมาะสมในการเรียนของหลักสูตร",
                    "การเตรียมความพร้อมก่อนเข้าศึกษา": "มีการปฐมนิเทศนักศึกษาเพื่อชี้แจงการเรียนการสอนในหลักสูตร การขึ้นทะเบียนการจดทะเบียน และอธิบายว่านักศึกษาต้องปฏิบัติตนอย่างไร และมีการแนะนำผู้บริหาร อาจารย์ผู้รับผิดชอบหลักสูตร อาจารย์ผู้สอน และเจ้าหน้าที่ที่คอยประสานงานแต่ละภาควิชา แนะนำสถานที่แหล่งข้อมูล ต่างๆ ในมหาวิทยาลัย เว็บไซต์ที่จำเป็นต่อการศึกษา และมีการแต่งตั้งอาจารย์ที่ปรึกษาด้านวิชาการหลังจากที่นักศึกษาได้กำหนดหัวข้อวิทยานิพนธ์แล้วเพื่อคอยให้คำแนะนำและปรึกษาในเรื่องต่างๆ",
                    "การควบคุมดูแล การให้คำปรึกษาวิชาการและแนะแนว": "รายละเอียดไม่ได้ระบุในเอกสารที่ให้มา",
                    "การคงอยู่ การสำเร็จการศึกษา": "รายละเอียดไม่ได้ระบุในเอกสารที่ให้มา",
                    "ความพึงพอใจและผลการจัดการข้อร้องเรียนของนักศึกษา": "รายละเอียดไม่ได้ระบุในเอกสารที่ให้มา"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 26,
        "details": [
            {
                "category": "คุณลักษณะพิเศษ",
                "subcategories": {
                    "การใช้บริการห้องสมุดและวารสารอิเล็กทรอนิกส์": "ผ่านระบบอินเทอร์เน็ต",
                    "ภาวะผู้นำ ความรับผิดชอบ และการมีวินัย": "สร้างภาวะความเป็นผู้นำในการทำวิจัยร่วมกับผู้อื่น มีความรับผิดชอบในการปฏิบัติงานหรือส่งงาน และมีกติกาในการสร้างวินัยในตนเอง เช่น การเข้าเรียนและส่งงานตรงตามเวลา",
                    "ด้านจริยธรรม และจรรยาบรรณวิชาชีพ": "การให้ความรู้ถึงผลกระทบต่อสังคม สิ่งแวดล้อม และข้อกฎหมายต่าง ๆ ที่เกี่ยวข้องกับการปฏิบัติงานในสาขาวิชาชีพ โดยการสอดแทรกในวิชาเรียน",
                    "ด้านศักยภาพในการปฏิบัติงานจริง": "การเรียนการสอนมุ่งเน้นให้นักศึกษามีความรู้ความเข้าใจในเชิงลึก สามารถผลิตงานวิจัยที่มีประโยชน์และนำไปประยุกต์ใช้งานในภาคอุตสาหกรรมได้จริงในเชิงปฏิบัติ"
                }
            },
            {
                "category": "การพัฒนาผลการเรียนรู้ในแต่ละด้าน",
                "subcategories": {
                    "คุณธรรม จริยธรรม": {
                        "ผลการเรียนรู้ด้านคุณธรรม จริยธรรม": [
                            "ตระหนักในคุณค่าและคุณธรรม จริยธรรม เสียสละและซื่อสัตย์สุจริต",
                            "มีวินัย ตรงต่อเวลา และความรับผิดชอบต่อตนเอง วิชาชีพและสังคม",
                            "มีภาวะความเป็นผู้นำและผู้ตาม สามารถทำงานเป็นทีมและสามารถแก้ไขข้อขัดแย้งและลำดับความสำคัญ",
                            "เคารพสิทธิและรับฟังความคิดเห็นของผู้อื่น รวมทั้งเคารพในคุณค่าและศักดิ์ศรีของความเป็นมนุษย์",
                            "เคารพกฎระเบียบและข้อบังคับต่าง ๆ ขององค์กรและสังคม",
                            "มีจรรยาบรรณทางวิชาการและการปฏิบัติงานวิจัยและวิชาชีพ"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 25,
        "details": [
            {
                "category": "การท าวิทยานิพนธ์",
                "subcategories": {
                    "การตีพิมพ์ผลงาน": "นักศึกษาด าเนินงานวิจัยและเขียนบทความวิจัยตีพิมพ์ในวารสารวิชาการระดับนานาชาติจ านวน อย่างน้อย 2 เรื่อง",
                    "กระบวนการประเมินผล": {
                        "ระดับการประเมิน": "แบ่งเป็น 2 ระดับ คือ ระดับ S (ใช้ได้) และ U (ใช้ไม่ได้)",
                        "ขั้นตอนการประเมิน": [
                            "ประเมินผลเค้าโครงวิทยานิพนธ์ จากการสอบเค้าโครงวิทยานิพนธ์โดยคณะกรรมการสอบวิทยานิพนธ์",
                            "ประเมินผลการสอบป้องกันวิทยานิพนธ์ โดยคณะกรรมการสอบวิทยานิพนธ์",
                            "คณะกรรมการสอบวิทยานิพนธ์ พิจารณาผลการสอบวิทยานิพนธ์อีกครั้งเพื่อเป็นการทวนสอบมาตรฐาน"
                        ],
                        "คณะกรรมการสอบวิทยานิพนธ์": "ประกอบด้วยอาจารย์ที่ปรึกษาวิทยานิพนธ์ อาจารย์ประจ าหลักสูตร และผู้ทรงคุณวุฒิภายนอก ที่มีคุณวุฒิตามเกณฑ์มาตรฐานหลักสูตร"
                    }
                }
            },
            {
                "category": "การพัฒนาคุณลักษณะพิเศษของนักศึกษา",
                "subcategories": {
                    "ความสามารถในการสื่อสาร": "ทั้งการพูด การน าเสนอผลของวิทยานิพนธ์ออกมาในรูปของการอ่าน การเขียน ในเชิงวิชาการ บทความทางวิชาการและน าเสนอในที่ประชุมวิชาการ",
                    "ความสามารถด้านการใช้ภาษาอังกฤษ": "ส่งเสริมทักษะทางภาษาอังกฤษ โดยการใช้ต าราภาษาอังกฤษในการเรียนการสอน การค้นคว้าวิจัย และใช้ภาษาอังกฤษในการเขียนและน าเสนอผลงานวิจัย",
                    "ความสามารถด้านเทคโนโลยีสารสนเทศ": "การใช้เทคโนโลยีสารสนเทศในกระบวนการเรียนรู้ ค้นคว้า และปฏิบัติงาน เช่น การใช้สื่ออิเล็กทรอนิกส์"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 61,
        "details": [
            {
                "category": "การรับเข้าศึกษา",
                "subcategories": {
                    "จำนวนรับ": "ในแต่ละปีการศึกษาจะรับนักศึกษาปีละ 3 คนต่อปีการศึกษา (ปรับลดจาก 5-10 คน)"
                }
            },
            {
                "category": "ระบบการศึกษา",
                "subcategories": {
                    "รูปแบบ": "ใช้ระบบการศึกษาแบบทวิภาค",
                    "ระยะเวลา": "1 ปีการศึกษาแบ่งออกเป็น 2 ภาคการศึกษา 1 ภาคการศึกษามีระยะเวลาศึกษาไม่น้อยกว่า 15 สัปดาห์"
                }
            },
            {
                "category": "ข้อกำหนดการสอบวัดคุณสมบัติ",
                "subcategories": {
                    "สิทธิในการสอบ": "นักศึกษามีสิทธิขอสอบวัดคุณสมบัติได้เมื่อจดทะเบียนรายวิชามาแล้วไม่น้อยกว่า 1 ภาคการศึกษา",
                    "รูปแบบการสอบ": "ประกอบด้วยการสอบข้อเขียนและสอบปากเปล่า",
                    "คณะกรรมการสอบ": "ดำเนินการโดยคณะกรรมการสอบวัดคุณสมบัติที่แต่งตั้งโดยคณบดีคณะวิศวกรรมศาสตร์ ซึ่งประกอบด้วยอาจารย์ประจำหลักสูตรหรือผู้ทรงคุณวุฒิภายนอกที่มีคุณสมบัติเป็นไปตามเกณฑ์อาจารย์ผู้สอบวิทยานิพนธ์ อย่างน้อย 3 คน"
                }
            },
            {
                "category": "การทำวิทยานิพนธ์และการสอบวิทยานิพนธ์",
                "subcategories": {
                    "การปรับปรุง": "ปรับรายละเอียดข้อกำหนดการทำวิทยานิพนธ์ให้สอดคล้องกับข้อบังคับฯ มธ. พ.ศ.2561 และเกณฑ์มาตรฐานหลักสูตรระดับบัณฑิตศึกษา",
                    "เงื่อนไขการสอบ": "ต้องสอบผ่านเค้าโครงวิทยานิพนธ์และเขียนวิทยานิพนธ์"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 42,
        "details": [
            {
                "category": "ทรัพยากรการเรียนการสอนที่มีอยู่เดิม",
                "subcategories": {
                    "หมวดวิชาวิศวกรรมศาสตร์": "3,919 6,213 10,132 เล่ม",
                    "วารสาร": "300 213 513 เล่ม",
                    "วารสารเย็บเล่ม": "1,785 1,574 3,359 เล่ม"
                }
            },
            {
                "category": "การจัดหาทรัพยากรการเรียนการสอนเพิ่มเติม",
                "subcategories": {
                    "การประสานงานกับห้องสมุดกลาง": "จัดซื้อหนังสือและตำราที่เกี่ยวข้อง",
                    "การมีส่วนร่วมของอาจารย์": "อาจารย์ผู้สอนและอาจารย์พิเศษมีส่วนร่วมในการเสนอแนะรายชื่อหนังสือและสื่อการสอน",
                    "ห้องสมุดย่อยคณะ": "จัดหาหนังสือ ตำรา หรือวารสารเฉพาะทาง"
                }
            },
            {
                "category": "การประเมินความเพียงพอของทรัพยากร",
                "subcategories": {
                    "เจ้าหน้าที่ประจำห้องสมุด": "ประสานงานการจัดซื้อหนังสือและประเมินความพอเพียง",
                    "เจ้าหน้าที่ด้านโสตทัศนูปกรณ์": "อำนวยความสะดวกในการใช้สื่อและประเมินความพอเพียง"
                }
            },
            {
                "category": "เป้าหมายและการดำเนินการ",
                "subcategories": {
                    "จัดหาฐานข้อมูลใหม่": {
                        "วิธีการ": "สืบค้นฐานข้อมูลใหม่ๆ จากตัวแทนจำหน่ายเพื่อให้อาจารย์/นักศึกษาทดลองใช้ก่อนการสั่งซื้อ",
                        "การประเมินผล": "สถิติ/จำนวนการเข้าทดลองใช้ฐานข้อมูลใหม่ๆ"
                    },
                    "เพิ่มจำนวนสิ่งพิมพ์ในรูปดิจิทัลหรือ Ebooks": {
                        "วิธีการ": "สอบถามความต้องการ/ความสนใจเกี่ยวกับฐานข้อมูลหรือสิ่งพิมพ์ต่างๆ จากคณาจารย์/นักศึกษา",
                        "การประเมินผล": [
                            "จำนวนการส่งคำอธิบายรายวิชาให้กับห้องสมุดตามระยะเวลาที่กำหนด",
                            "ผลสำรวจความพึงพอใจของนักศึกษาต่อการให้บริการทรัพยากรเพื่อการเรียนรู้และการปฏิบัติการ"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 36,
        "details": [
            {
                "category": "เกณฑ์การสำเร็จการศึกษาตามหลักสูตร",
                "subcategories": {
                    "หน่วยกิตสะสม": "ไม่น้อยกว่า 48 หน่วยกิต",
                    "วิชาบังคับ": "ได้ระดับ P (ผ่าน)",
                    "ภาษาต่างประเทศ": "ได้ค่าระดับ P (ผ่าน) ตามเกณฑ์ของมหาวิทยาลัย",
                    "การสอบวัดคุณสมบัติ": "ได้ค่าระดับ P (ผ่าน)",
                    "การสอบวิทยานิพนธ์": "ได้ระดับ S (ใช้ได้) โดยการสอบปากเปล่าขั้นสุดท้าย",
                    "การตีพิมพ์ผลงานวิทยานิพนธ์": "อย่างน้อย 2 เรื่องในวารสารวิชาการระดับนานาชาติ",
                    "เงื่อนไขอื่นๆ": "ต้องปฏิบัติตามเงื่อนไขที่คณะวิศวกรรมศาสตร์และมหาวิทยาลัยธรรมศาสตร์กำหนด"
                }
            },
            {
                "category": "การพัฒนาคณาจารย์",
                "subcategories": {
                    "การเตรียมการสำหรับอาจารย์ใหม่": {
                        "การปฐมนิเทศ": "ให้ความรู้เกี่ยวกับนโยบาย บทบาทหน้าที่ กฎระเบียบ และสิทธิประโยชน์",
                        "การพัฒนาความรู้": "เข้าร่วมอบรม ประชุมสัมมนา และประชุมวิชาการ",
                        "การศึกษาหลักสูตร": "ให้ศึกษาปรัชญาและเป้าประสงค์ของหลักสูตร"
                    },
                    "การพัฒนาความรู้และทักษะให้แก่คณาจารย์": {
                        "การพัฒนาทักษะการจัดการเรียนการสอน": "เข้าร่วมอบรมพัฒนาการสอน การวัดและประเมินผล",
                        "การพัฒนาวิชาการและวิชาชีพ": {
                            "การบริการวิชาการ": "มีส่วนร่วมในกิจกรรมบริการทางวิชาการแก่ชุมชน",
                            "การทำวิจัย": "ส่งเสริมการทำวิจัยสร้างองค์ความรู้ใหม่"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 56,
        "details": [
            {
                "category": "บรรณานุกรม",
                "subcategories": {
                    "ชื่อผู้แต่ง": "เดชศักดิ์ดา ศุภเวที, วรรัตน์ ปัตรประกรม, พรระพีพัฒน์ ภาสบุตร",
                    "ปีที่พิมพ์": "2018",
                    "ชื่อบทความ": "การศึกษากำลังผลิตติดตั้งสูงสุดของโรงไฟฟ้าพลังงานแสงอาทิตย์ในภาคตะวันออกเฉียงเหนือของประเทศไทย",
                    "ชื่อการประชุม": "การประชุมวิชาการระดับชาติ \"วลัยลักษณ์วิจัย\" ครั้งที่ 10",
                    "วันที่จัดประชุม": "27-28 มีนาคม 2561",
                    "หน้า": "229",
                    "สถานที่จัดประชุม": "มหาวิทยาลัยวลัยลักษณ์ จังหวัดนครศรีธรรมราช"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 63,
        "details": [
            {
                "category": "คุณสมบัติของอาจารย์ผู้สอบวิทยานิพนธ์",
                "subcategories": {
                    "ผลงานทางวิชาการ": "ต้องเป็นผลงานทางวิชาการที่ได้รับการเผยแพร่ตามหลักเกณฑ์ที่กำหนดในการพิจารณาแต่งตั้งให้บุคคลดำรงตำแหน่งทางวิชาการอย่างน้อย 3 รายการ ในรอบ 5 ปีย้อนหลัง โดยอย่างน้อย 1 รายการต้องเป็นผลงานวิจัย",
                    "การศึกษาเพื่อรับปริญญา": "เป็นส่วนหนึ่งของการศึกษาเพื่อรับปริญญา"
                }
            },
            {
                "category": "คุณสมบัติของผู้ทรงคุณวุฒิภายนอก",
                "subcategories": {
                    "คุณวุฒิ": "ต้องมีคุณวุฒิปริญญาเอกหรือเทียบเท่า",
                    "ผลงานทางวิชาการ": "มีผลงานทางวิชาการที่ได้รับการตีพิมพ์เผยแพร่ในวารสารที่มีชื่ออยู่ในฐานข้อมูลที่เป็นที่ยอมรับในระดับนานาชาติ ซึ่งตรงหรือสัมพันธ์กับหัวข้อวิทยานิพนธ์ ไม่น้อยกว่า 5 เรื่อง",
                    "กรณีไม่มีคุณวุฒิตามที่กำหนด": "ต้องเป็นผู้มีความรู้ความเชี่ยวชาญและประสบการณ์สูงมาก เป็นที่ยอมรับ ซึ่งตรงหรือสัมพันธ์กับหัวข้อวิทยานิพนธ์ โดยผ่านความเห็นชอบจากสภามหาวิทยาลัยธรรมศาสตร์ และแจ้งคณะกรรมการการอุดมศึกษารับทราบ"
                }
            },
            {
                "category": "เกณฑ์การพิจารณาผู้ทรงคุณวุฒิภายนอก",
                "subcategories": {
                    "ภาคอุตสาหกรรม": "พิจารณาจากภาคอุตสาหกรรมที่ดำเนินการทางสิ่งแวดล้อมและพลังงาน เช่น EGAT การปิโตรเลียมแหล่งประเทศไทย การไฟฟ้านครหลวง หรือบริษัทที่ได้รับความน่าเชื่อถือทางธุรกิจดีเด่น",
                    "ภาครัฐ": "พิจารณาจากภาครัฐที่ดำเนินการทางสิ่งแวดล้อมและพลังงาน เช่น กรมควบคุมมลพิษ กรมโรงงานอุตสาหกรรม กรมพลังงานทดแทน หน่วยงานวิจัย และมหาวิทยาลัยอื่นๆ"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 51,
        "details": [
            {
                "category": "ผลงานทางวิชาการ",
                "subcategories": {
                    "ผู้ช่วยศาสตราจารย์_ดร.ทิพบุษฏ์_เอกแสงศรี": {
                        "บทความวิจัย": [
                            {
                                "ชื่อบทความ": "ต่อกระบวนการให้ความร้อนที่อุณหภูมิต่ำของขยะชุมชนอัดแท่งที่มีความชื้นสูง",
                                "วารสาร": "Rajabhat J. Sci. Humanit. Soc. Sci.",
                                "ปีที่พิมพ์": "18(1), January – June",
                                "หน้า": "131-146",
                                "ประเภท": "บทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในวารสารวิชาการระดับชาติ",
                                "คะแนน": "0.4"
                            },
                            {
                                "ชื่อบทความ": "Effect of calcination temperature on photocatalytic activity of synthesized TiO2 Nanoparticles via wet ball milling solgel method",
                                "ผู้เขียน": "iripond Phromma, Tuksadon Wutikhun, Panita Kasamechonchung, Tippabust Eksangsri and Chaweewan Sapcharoenkun",
                                "วารสาร": "Appl. Sci.",
                                "ปีที่พิมพ์": "2020",
                                "เล่มที่": "Vol.10",
                                "หน้า": "993"
                            },
                            {
                                "ชื่อบทความ": "Synthesis of silver doped titanium dioxide by wet-ball milling sol-gel method for antibacterial application",
                                "การประชุม": "Proceeding of 18th asian pacific conference of chemical engineering congress 2019",
                                "วันที่": "23-27 September 2019",
                                "หน้า": "1-12"
                            },
                            {
                                "ชื่อบทความ": "Synthesis of TIO2 Nanoparticles with high Photocatalytic Activity by wet ball milling SOL-GEL Method",
                                "การประชุม": "The 7th International Thai Institute of Chemical of Chemical Engineering and Applied Chemistry Conference 2017 (TIChE 2017)",
                                "วันที่": "18-20 october 2017",
                                "หน้า": "211-214"
                            }
                        ]
                    },
                    "รองศาสตราจารย์_ดร.ไพรัช_อุศุภรัตน์": {
                        "งานสร้างสรรค์": [
                            {
                                "ชื่อผลงาน": "Environmental impact assessment of Thai minced fish paste (surimi)using life cycle assessment methodology",
                                "ผู้เขียน": "Phairat Usubharatana and Harnpon Phungrassami",
                                "วารสาร": "Environmental Research, Engineering and Management",
                                "ปีที่พิมพ์": "2020",
                                "เล่มที่": "76(3)",
                                "หน้า": "137-153",
                                "ระดับ": "นานาชาติ",
                                "คะแนน": "1"
                            },
                            {
                                "ชื่อบทความ": "Fossil Fuel Carbon Taxation Policy Effect on Thai Household Expenditure Using Input–Output Price Structural Path Model",
                                "ผู้เขียน": "Harnpon Phungrassami, Phairat Usubharatana",
                                "วารสาร": "Environmental Progress & Sustainable Energy",
                                "วันที่": "03 March 2019",
                                "หน้า": "1-13"
                            },
                            {
                                "ชื่อบทความ": "LIFE CYCLE ASSESSMENT OF BIO-BASED THERMAL INSULATION MATERIALS FORMED BY DIFFERENT METHODS",
                                "ผู้เขียน": "Phairat Usubharatana, Harnpon Phungrassami",
                                "วารสาร": "Environmental Engineering and Management Journal",
                                "ปีที่พิมพ์": "July 2019",
                                "เล่มที่": "Vol. 18, No. 7",
                                "หน้า": "1471-1486"
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 4,
        "details": [
            {
                "category": "อาจารย์ผู้รับผิดชอบหลักสูตร",
                "subcategories": [
                    {
                        "ลำดับ": "1",
                        "ชื่อ-นามสกุล": "นายหาญพล พึ่งรัศมี",
                        "เลขประจำตัวประชาชน": "3909800880xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "คุณวุฒิการศึกษา": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขา": "Environmental Engineering",
                                "สถาบัน": "Ajou University",
                                "ประเทศ": "South Korea",
                                "ปีที่จบ": "2550"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขา": "Environmental Technology and Management-Cleaner Production",
                                "สถาบัน": "สถาบันเทคโนโลยีแห่งเอเชีย",
                                "ปีที่จบ": "2544"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขา": "วิศวกรรมเคมี",
                                "เกียรตินิยม": "อันดับ 1",
                                "สถาบัน": "มหาวิทยาลัยธรรมศาสตร์",
                                "ปีที่จบ": "2540"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "2",
                        "ชื่อ-นามสกุล": "นายสาธก ไชยกุลชื่นสกุล",
                        "เลขประจำตัวประชาชน": "3100900248xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "คุณวุฒิการศึกษา": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขา": "Chemical Engineering",
                                "สถาบัน": "Polytechnic University",
                                "ปีที่จบ": "2543"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขา": "Chemical Engineering",
                                "สถาบัน": "Stevens Institute of Technology",
                                "ปีที่จบ": "2537"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปีที่จบ": "2535"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "3",
                        "ชื่อ-นามสกุล": "นางสาววรณี มังคละศิริ",
                        "เลขประจำตัวประชาชน": "3302000235xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "คุณวุฒิการศึกษา": [
                            {
                                "ระดับ": "วศ.ด.",
                                "สาขา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปีที่จบ": "2551"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขา": "วิศวกรรมเคมี",
                                "เกียรตินิยม": "อันดับ 1",
                                "สถาบัน": "มหาวิทยาลัยขอนแก่น",
                                "ปีที่จบ": "2547"
                            }
                        ]
                    }
                ]
            },
            {
                "category": "สถานที่จัดการเรียนการสอน",
                "subcategories": {
                    "คณะ": "คณะวิศวกรรมศาสตร์",
                    "มหาวิทยาลัย": "มหาวิทยาลัยธรรมศาสตร์",
                    "ศูนย์": "ศูนย์รังสิต",
                    "จังหวัด": "ปทุมธานี"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 15,
        "details": [
            {
                "category": "Dissertation Requirements",
                "subcategories": {
                    "Topic": "Energy and/or environmental technology management",
                    "Research_Contribution": "Must contribute new findings in the related field",
                    "Supervision": "Conducted under supervision of at least one thesis advisor who is a permanent faculty member of the Faculty of Engineering, Thammasat University",
                    "Presentation": "Student must present the dissertation and allow general public to attend the dissertation defense",
                    "Publication": "Dissertation must be published as public knowledge",
                    "Ethics": "Student must have research and publication ethics",
                    "Format": "Dissertation must be written and published in a bound hardcopy"
                }
            },
            {
                "category": "Thesis Proposal",
                "subcategories": {
                    "Formulation": "Formulate thesis proposal related to energy and/or environmental technology management"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 66,
        "details": [
            {
                "category": "วิทยานิพนธ์ สารนิพนธ์และการค้นคว้าอิสระ",
                "subcategories": {
                    "ผลงานวิทยานิพนธ์": "ต้องได้รับการตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่มีคุณภาพตามประกาศคณะกรรมการการอุดมศึกษา เรื่องหลักเกณฑ์การพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการอย่างน้อย 2 เรื่อง",
                    "กระบวนการตีพิมพ์": "มีคณะกรรมการภายนอกมาร่วมกลั่นกรอง (Peer review) ก่อนการตีพิมพ์",
                    "การรับรองผลงาน": "ผลงานต้องได้รับการรับรองจากคณะกรรมการสอบวิทยานิพนธ์",
                    "เงื่อนไขเพิ่มเติม": "ต้องปฏิบัติตามเงื่อนไขอื่นๆ ที่คณะวิศวกรรมศาสตร์ และมหาวิทยาลัยธรรมศาสตร์กำหนด"
                }
            },
            {
                "category": "จำนวนหน่วยกิตรวมและระยะเวลาศึกษา",
                "subcategories": {
                    "จำนวนหน่วยกิตรวม": "48 หน่วยกิต",
                    "ระยะเวลาการศึกษา": "หลักสูตรแบบไม่เต็มเวลา นักศึกษาต้องใช้ระยะเวลาการศึกษาตลอดหลักสูตรอย่างน้อย 6 ภาคการศึกษาปกติ และอย่างมากไม่เกิน 12 ภาคการศึกษาปกติ"
                }
            },
            {
                "category": "โครงสร้างและองค์ประกอบหลักสูตร",
                "subcategories": {
                    "แบบ_1.1": "ทำวิทยานิพนธ์เดียว",
                    "วิชาบังคับ": "ไม่น้อยกว่า 4 หน่วยกิต (ไม่นับหน่วยกิตรวม)",
                    "วิทยานิพนธ์": "ไม่น้อยกว่า 48 หน่วยกิต"
                }
            },
            {
                "category": "รายวิชาในหลักสูตร",
                "subcategories": {
                    "วิชาบังคับ": "นักศึกษาต้องศึกษาวิชาบังคับไม่น้อยกว่า 4 หน่วยกิต (ไม่นับหน่วยกิตรวม)",
                    "กพ._891": "ระเบียบวิธีวิจัยขั้นสูง 1 หน่วยกิต",
                    "กพ._892": "สัมมนา 1 1 หน่วยกิต"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 7,
        "details": [
            {
                "category": "หมวดที่ 2 ข้อมูลเฉพาะของหลักสูตร",
                "subcategories": {
                    "1. ปรัชญา ความสำคัญ และวัตถุประสงค์ของหลักสูตร": {
                        "1.1 ปรัชญา": "หลักสูตรมุ่งเน้นงานวิจัยเชิงลึกเพื่อค้นคว้าเทคโนโลยีใหม่ๆในด้านพลังงานและสิ่งแวดล้อม รวมถึงการจัดการพลังงานและสิ่งแวดล้อมที่ทันต่อการเปลี่ยนแปลงของโลก ส่งเสริมการคิดวิเคราะห์อย่างมีเหตุผล มีความสามารถด้านการคิดค้นวิจัยอย่างเป็นระบบรองรับการพัฒนางานวิจัยในภาคอุตสาหกรรมและเทคโนโลยีสมัยใหม่ ส่งเสริมการแลกเปลี่ยนประสบการณ์ทางวิชาชีพระหว่างผู้เรียน ซึ่งนำไปสู่การแก้ปัญหาพลังงานและสิ่งแวดล้อมของประเทศ และพัฒนาองค์ความรู้ด้านการจัดการพลังงานและสิ่งแวดล้อมของประเทศให้มีความกว้างขวางยิ่งขึ้น",
                        "1.2 ความสำคัญ": "จากการที่ทั่วโลกได้มีการตื่นตัวในเรื่องวิกฤติการณ์ด้านพลังงาน ปัญหาผลกระทบทางสิ่งแวดล้อมในแง่มุมต่าง ๆ รวมไปถึงปัญหาที่เกี่ยวข้องกับสภาวะโลกร้อน และการเกิดภัยธรรมชาติต่างๆ ที่นับวันจะทวีความรุนแรงเพิ่มมากขึ้น ทำให้ทุกวงการเห็นความสำคัญในด้านการใช้และการจัดการพลังงานและการจัดการสิ่งแวดล้อมที่มีประสิทธิภาพ ซึ่งปัจจุบันเทคโนโลยีและองค์ความรู้ที่มีอยู่ยังต้องมีการพัฒนาเพื่อให้สามารถแก้ปัญหาดังกล่าวซึ่งเปลี่ยนแปลงไปอย่างรวดเร็ว ดังนั้นการจัดการที่มีประสิทธิภาพต่อสภาวการณ์ปัจจุบันจะเกิดขึ้นได้จึงต้องอาศัยนวัตกรรมใหม่ ๆ ที่ได้จากการวิจัยในเชิงลึก",
                        "1.3 วัตถุประสงค์ของหลักสูตร": {
                            "1)": "เพื่อผลิตนักวิจัยระดับสูงในสาขาวิชาการจัดการพลังงานและสิ่งแวดล้อมที่มีความรู้ ควบคู่กับคุณธรรม และมีความสามารถในการพัฒนาเทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อมในภาครัฐบาลและภาคอุตสาหกรรม",
                            "2)": "เพื่อผลิตบัณฑิตที่มีความรู้ความสามารถในด้านการจัดการพลังงานและการจัดการสิ่งแวดล้อม เพื่อวางแผนจัดการและพัฒนากระบวนการหรือเทคโนโลยีรวมทั้งการแก้ไขวิกฤตด้านพลังงานและสิ่งแวดล้อมในระดับนานาชาติที่หลากหลายและซับซ้อนให้มีประสิทธิภาพสูงสุด",
                            "3)": "เพื่อผลิตบัณฑิตที่สามารถสร้างองค์ความรู้และความเป็นเลิศทางวิชาการและวิจัยในสาขาต่าง ๆ ทางวิศวกรรมศาสตร์และเทคโนโลยีในระดับนานาชาติ"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 31,
        "details": [
            {
                "category": "คุณธรรม จริยธรรม",
                "subcategories": {
                    "ศักดิ์ศรีของความเป็นมนุษย์": "เคารพในศักดิ์ศรีของความเป็นมนุษย์",
                    "การเคารพกฎระเบียบ": "เคารพกฎระเบียบและข้อบังคับต่าง ๆ ขององค์กรและสังคม",
                    "จรรยาบรรณ": "มีจรรยาบรรณทางวิชาการและการปฏิบัติงานวิจัยและวิชาชีพ"
                }
            },
            {
                "category": "ความรู้",
                "subcategories": {
                    "ความรู้และความเข้าใจ": "มีความรู้และความเข้าใจเกี่ยวกับหลักการและทฤษฎีที่สำคัญในเนื้อหาสาขาวิชาชีพที่ศึกษา",
                    "การวิเคราะห์และประยุกต์": "สามารถวิเคราะห์ปัญหา เข้าใจ รวมทั้งประยุกต์ความรู้ ทักษะ และการใช้เครื่องมือที่เหมาะสมกับการแก้ไขปัญหา",
                    "การออกแบบระบบ": "สามารถวิเคราะห์ ออกแบบ ติดตั้ง ปรับปรุงระบบ ตรงตามข้อกำหนดของวิชาชีพ",
                    "การติดตามความก้าวหน้า": "สามารถติดตามความก้าวหน้าทางวิชาการในวิชาชีพ รวมทั้งการนำไปประยุกต์",
                    "การพัฒนาความรู้": "รู้ เข้าใจและสนใจพัฒนาความรู้ ความชำนาญทางวิชาชีพอย่างต่อเนื่อง",
                    "ความรู้กว้าง": "มีความรู้ในแนวกว้างของสาขาวิชาที่ศึกษาเพื่อให้เล็งเห็นการเปลี่ยนแปลง และเข้าใจผลกระทบของเทคโนโลยีใหม่ๆ"
                }
            },
            {
                "category": "ทักษะทางปัญญา",
                "subcategories": {
                    "การคิดวิเคราะห์": "คิดอย่างมีวิจารณญาณและอย่างเป็นระบบ",
                    "การสืบค้นและประเมิน": "สามารถสืบค้น ตีความ และประเมินข้อมูลต่างๆ เพื่อใช้ในการแก้ไขปัญหาอย่างสร้างสรรค์",
                    "การวิเคราะห์ปัญหา": "สามารถรวบรวม ศึกษา วิเคราะห์ และสรุปประเด็นปัญหาและความต้องการ",
                    "การแก้ปัญหาและวิจัย": "มีการแก้ไขปัญหาและการค้นคว้าวิจัยจนประสบความสำเร็จในงานวิจัยได้อย่างถูกต้องและเหมาะสม"
                }
            },
            {
                "category": "ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ",
                "subcategories": {
                    "การสื่อสาร": "สามารถสื่อสารกับกลุ่มคนหลากหลายและสามารถสนทนาทั้งภาษาไทยและภาษาต่างประเทศอย่างมีประสิทธิภาพ",
                    "การทำงานเป็นทีม": "สามารถให้ความช่วยเหลือและอำนวยความสะดวกแก่การแก้ปัญหาสถานการณ์ต่าง ๆ ในกลุ่มทั้งในบทบาทของผู้นำ หรือในบทบาทของผู้ร่วมทีมทำงาน",
                    "การใช้ความรู้เพื่อสังคม": "สามารถใช้ความรู้ในศาสตร์มาชี้นำสังคมในประเด็นที่เหมาะสม",
                    "ความรับผิดชอบ": "มีความรับผิดชอบในการกระทำของตนเองและรับผิดชอบงานในกลุ่ม"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 34,
        "details": [
            {
                "category": "ความคาดหวังของผลลัพธ์การเรียนรู้เมื่อสิ้นปีการศึกษา",
                "subcategories": {
                    "ปีที่_1": "เรียนรู้หลักการของการวิจัยทางด้านวิทยาศาสตร์และเทคโนโลยี สถิติศาสตร์ การวางแผนการวิจัย การเก็บข้อมูล การวิเคราะห์ สรุปและข้อเสนอแนะผลวิจัย จริยธรรมในการศึกษาหรือค้นคว้าในคนและสัตร์ กฏหมายข้อกำหนดเกี่ยวกับจริยธรรม และการสัมมนาทางวิศวกรรมศาสตร์ และรายวิชาชีพทางด้านวิศวกรรมศาสตร์ และมีทักษะ GREATS",
                    "ปีที่_2": "มีความรู้เกี่ยวกับสาขาวิชาที่ศึกษา สามารถประยุกต์ความรู้ วิเคราะห์ และแก้ปัญหาทางด้านวิศวกรรมไฟฟ้า, วิศวกรรมคอมพิวเตอร์, วิศวกรรมอุตสาหการ, วิศวกรรมเคมีและวิศวกรรมเครื่องกล รวมทั้งสามารถสื่อสารกับผู้อื่นได้อย่างมีประสิทธิภาพ",
                    "ปีที่_3": "มีคุณธรรมและจริยธรรมในตนเองและวิชาชีพ มีทักษะสามารถวางแผนและพัฒนางานด้านวิศวกรรมศาสตร์ สามารถบูรณาการความรู้ที่ศึกษากับความรู้ในศาสตร์อื่น ๆ ตลอดจนมีทักษะด้านการเป็นผู้นำและผู้ตามในการทำงานร่วมกับผู้อื่นได้อย่างมีประสิทธิภาพ"
                }
            },
            {
                "category": "หลักเกณฑ์ในการประเมินผลนักศึกษา",
                "subcategories": {
                    "กฎระเบียบหรือหลักเกณฑ์ในการให้ระดับคะแนน_(เกรด)": {
                        "การวัดผลรายวิชาบังคับ_(ไม่นับหน่วยกิตรวม)": "แบ่งเป็น 2 ระดับ คือ ระดับ P (ผ่าน) และระดับ N (ไม่ผ่าน)",
                        "การวัดผลวิทยานิพนธ์": "แบ่งเป็น 2 ระดับ คือ ระดับ S (ใช้ได้) และระดับ U (ใช้ไม่ได้) โดยวิทยานิพนธ์ที่ได้ระดับ S จะต้องได้มติเป็นเอกฉันท์จากคณะกรรมการสอบวิทยานิพนธ์ หน่วยกิตที่ได้จะไม่นำมาคำนวณค่าระดับเฉลี่ย",
                        "การสอบวัดคุณสมบัติ_และการสอบภาษาต่างประเทศ": "แบ่งเป็น 2 ระดับ คือ ระดับ P (ผ่าน) และระดับ N (ไม่ผ่าน) และไม่นับหน่วยกิต",
                        "เงื่อนไขอื่นๆ": "ให้เป็นไปตามข้อบังคับของมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาระดับบัณฑิตศึกษา พ.ศ. 2561"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 37,
        "details": [
            {
                "category": "หมวดที่ 7 การประกันคุณภาพหลักสูตร",
                "subcategories": {
                    "1. การกำกับมาตรฐาน": {
                        "1.1": "ดำเนินการประกันคุณภาพหลักสูตรให้มีประสิทธิภาพและสอดคล้องตามมาตรฐานคุณภาพของคณะกรรมการการอุดมศึกษาและของมหาวิทยาลัยและประเมินคุณภาพการศึกษา",
                        "1.2": "อาจารย์ประจำหลักสูตร มีคุณวุฒิปริญญาเอกหรือเทียบเท่า หรือขั้นต่ำปริญญาโทหรือเทียบเท่าที่มีตำแหน่งรองศาสตราจารย์ และมีผลงานทางวิชาการที่ไม่ใช่ส่วนหนึ่งของการศึกษาเพื่อรับปริญญา และเป็นผลงานทางวิชาการที่ได้รับการเผยแพร่ตามหลักเกณฑ์ที่กำหนดในการพิจารณาแต่งตั้ง ให้บุคคลดำรงตำแหน่งทางวิชาการอย่างน้อย 3 รายการ ในรอบ 5 ปีย้อนหลัง โดยอย่างน้อย 1 รายการต้องเป็นผลงานวิจัย",
                        "1.3": "อาจารย์ผู้รับผิดชอบหลักสูตร จำนวนอย่างน้อย 3 คน มีคุณวุฒิปริญญาเอกหรือเทียบเท่า หรือขั้นต่ำปริญญาโทหรือเทียบเท่าที่มีตำแหน่งศาสตราจารย์ และมีผลงานทางวิชาการที่ไม่ใช่ส่วนหนึ่งของการศึกษาเพื่อรับปริญญา และเป็นผลงานทางวิชาการที่ได้รับการเผยแพร่ตามหลักเกณฑ์ที่กำหนดในการพิจารณาแต่งตั้งให้บุคคลดำรงตำแหน่งทางวิชาการอย่างน้อย 3 รายการ ในรอบ 5 ปีย้อนหลัง โดยอย่างน้อย 1 รายการต้องเป็นผลงานวิจัย",
                        "1.4": "อาจารย์ที่ปรึกษาวิทยานิพนธ์หลัก ต้องเป็นอาจารย์ประจำหลักสูตร มีคุณวุฒิปริญญาเอกหรือเทียบเท่า หรือขั้นต่ำปริญญาโทหรือเทียบเท่าที่มีตำแหน่งรองศาสตราจารย์ และมีผลงานทางวิชาการที่ไม่ใช่ส่วนหนึ่งของการศึกษาเพื่อรับปริญญา และเป็นผลงานทางวิชาการที่ได้รับการเผยแพร่ตามหลักเกณฑ์ที่กำหนดในการพิจารณาแต่งตั้งให้บุคคลดำรงตำแหน่งทางวิชาการอย่างน้อย 3 รายการ ในรอบ 5 ปีย้อนหลัง โดยอย่างน้อย 1 รายการต้องเป็นผลงานวิจัย",
                        "1.5": {
                            "อาจารย์ที่ปรึกษาวิทยานิพนธ์ร่วม (ถ้ามี) ต้องมีคุณวุฒิและคุณสมบัติดังนี้": {
                                "อาจารย์ที่ปรึกษาวิทยานิพนธ์ร่วมที่เป็นอาจารย์ประจำ": "ต้องมีคุณวุฒิและผลงานทางวิชาการเช่นเดียวกับอาจารย์ที่ปรึกษาวิทยานิพนธ์หลัก",
                                "อาจารย์ที่ปรึกษาวิทยานิพนธ์ร่วมที่เป็นผู้ทรงคุณวุฒิภายนอก": "ต้องมีคุณวุฒิปริญญาเอกหรือเทียบเท่า และมีผลงานทางวิชาการที่ได้รับการตีพิมพ์เผยแพร่ในวารสารที่มีชื่ออยู่ในฐานข้อมูลที่เป็นที่ยอมรับในระดับนานาชาติ ซึ่งตรงหรือสัมพันธ์กับหัวข้อวิทยานิพนธ์ ไม่น้อยกว่า 5 เรื่อง"
                            }
                        },
                        "1.6": {
                            "อาจารย์ผู้สอบวิทยานิพนธ์": {
                                "องค์ประกอบ": "ต้องประกอบด้วยอาจารย์ที่ปรึกษาวิทยานิพนธ์ อาจารย์ประจำหลักสูตรที่เป็นอาจารย์ประจำมหาวิทยาลัยและผู้ทรงคุณวุฒิภายนอกสถาบัน รวมไม่น้อยกว่า 5 คน ทั้งนี้ประธานกรรมการสอบต้องเป็นผู้ทรงคุณวุฒิภายนอก",
                                "คุณสมบัติ": {
                                    "กรณีอาจารย์ประจำหลักสูตร": "ต้องมีคุณวุฒิปริญญาเอกหรือเทียบเท่า หรือขั้นต่ำปริญญาโทหรือเทียบเท่าที่มีตำแหน่งรองศาสตราจารย์ และมีผลงานทางวิชาการที่ไม่ใช่ส่วนหนึ่งของการศึกษาเพื่อรับปริญญา และเป็นผลงานทางวิชาการที่ได้รับการเผยแพร่ตามหลักเกณฑ์ที่กำหนดในการพิจารณาแต่งตั้งให้บุคคลดำรงตำแหน่งทางวิชาการอย่างน้อย 3 รายการ ในรอบ 5 ปีย้อนหลัง โดยอย่างน้อย 1 รายการต้องเป็นผลงานวิจัย"
                                }
                            }
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 46,
        "details": [
            {
                "category": "กระบวนการวางแผนปรับปรุงหลักสูตร",
                "subcategories": {
                    "ขั้นตอนที่_1": "ศึกษาผลการประเมินคุณภาพการศึกษาข้างต้น",
                    "ขั้นตอนที่_2": "วิเคราะห์หากลยุทธ์เพื่อให้ได้ตามคุณภาพการศึกษาที่กำหนด",
                    "ขั้นตอนที่_3": "ปรับปรุงเนื้อหาของแต่ละรายวิชาให้เหมาะสมและทันกับวิทยาการปัจจุบัน",
                    "ขั้นตอนที่_4": "ปรับปรุงหลักสูตรให้มีความทันสมัยและสอดคล้องกับความต้องการของผู้ใช้บัณฑิตยิ่งขึ้น",
                    "ระยะเวลาการปรับปรุง": "การปรับปรุงหลักสูตรจะดำเนินการทุก 5 ปี"
                }
            },
            {
                "category": "การประเมินผล",
                "subcategories": {
                    "วิธีการประเมิน": "ประเมินผลงานวิชาการของบัณฑิต"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 23,
        "details": [
            {
                "category": "ข้อกำหนดเกี่ยวกับวิทยานิพนธ์",
                "subcategories": {
                    "ภาษาที่ใช้": "นักศึกษาต้องทำวิทยานิพนธ์เป็นภาษาอังกฤษ",
                    "ขั้นตอนการทำวิทยานิพนธ์": {
                        "การเสนอเค้าโครง": "หลังจากจดทะเบียนทำวิทยานิพนธ์และสอบวัดคุณสมบัติผ่านแล้ว นักศึกษาต้องเสนอเค้าโครงวิทยานิพนธ์ต่อคณะกรรมการสอบวิทยานิพนธ์",
                        "การแต่งตั้งคณะกรรมการ": "ยื่นเรื่องให้คณบดีคณะวิศวกรรมศาสตร์แต่งตั้งอาจารย์ที่ปรึกษาวิทยานิพนธ์และคณะกรรมการสอบวิทยานิพนธ์",
                        "องค์ประกอบคณะกรรมการ": "ประกอบด้วยอาจารย์ที่ปรึกษาวิทยานิพนธ์ อาจารย์ประจำหลักสูตร และผู้ทรงคุณวุฒิภายนอกสถาบัน รวมไม่น้อยกว่า 5 คน โดยประธานกรรมการสอบต้องเป็นผู้ทรงคุณวุฒิภายนอก"
                    },
                    "คุณสมบัติของอาจารย์ผู้สอบวิทยานิพนธ์": {
                        "อาจารย์ประจำหลักสูตร": {
                            "คุณวุฒิ": "ปริญญาเอกหรือเทียบเท่า หรือขั้นต่ำปริญญาโทหรือเทียบเท่าที่มีตำแหน่งรองศาสตราจารย์",
                            "ผลงานทางวิชาการ": "มีผลงานทางวิชาการที่ไม่ใช่ส่วนหนึ่งของการศึกษาเพื่อรับปริญญา และเป็นผลงานที่ได้รับการเผยแพร่ตามหลักเกณฑ์ อย่างน้อย 3 รายการในรอบ 5 ปีย้อนหลัง โดยอย่างน้อย 1 รายการต้องเป็นผลงานวิจัย"
                        },
                        "ผู้ทรงคุณวุฒิภายนอก": {
                            "คุณวุฒิ": "ปริญญาเอกหรือเทียบเท่า",
                            "ผลงานทางวิชาการ": "มีผลงานทางวิชาการที่ได้รับการตีพิมพ์เผยแพร่ในวารสารที่มีชื่ออยู่ในฐานข้อมูลที่เป็นที่ยอมรับในระดับนานาชาติ ซึ่งตรงหรือสัมพันธ์กับหัวข้อวิทยานิพนธ์ ไม่น้อยกว่า 5 เรื่อง",
                            "กรณีพิเศษ": "ผู้ทรงคุณวุฒิที่ไม่มีคุณวุฒิและผลงานตามที่กำหนด ต้องเป็นผู้มีความรู้ความเชี่ยวชาญและประสบการณ์สูงมาก เป็นที่ยอมรับ ซึ่งตรงหรือสัมพันธ์กับหัวข้อวิทยานิพนธ์ โดยผ่านความเห็นชอบจากสภามหาวิทยาลัยธรรมศาสตร์"
                        }
                    },
                    "การประเมินความก้าวหน้า": "ทุกภาคการศึกษาที่มีการลงทะเบียนวิทยานิพนธ์ จะต้องมีการประเมินความก้าวหน้าวิทยานิพนธ์โดยอาจารย์ที่ปรึกษาวิทยานิพนธ์ และ/หรือแต่งตั้งกรรมการร่วมประเมิน"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 60,
        "details": [
            {
                "category": "คุณสมบัติผู้เข้าศึกษา",
                "subcategories": {
                    "คุณสมบัติทั่วไป": "เป็นผู้สำเร็จการศึกษาชั้นปริญญาโท สาขาวิชาเทคโนโลยีการจัดการพลังงาน และ/หรือเทคโนโลยีการจัดการสิ่งแวดล้อม หรือ สาขาอื่นที่เกี่ยวข้องทั้งในหรือต่างประเทศจากสถาบันการศึกษาที่สภามหาวิทยาลัยรับรองวิทยฐานะ หรือ ผ่านความเห็นชอบจากคณะกรรมการหลักสูตรปรัชญาดุษฏีบัณฑิต สาขาวิชาเทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อม",
                    "เกรดเฉลี่ย": "มีค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 3.50 จากระบบ 4.00 หรือกรณีของผู้สมัครมีค่าระดับเฉลี่ยสะสมต่ำกว่า 3.50 ในระดับปริญญาโทจะต้องมีผลงานทางวิชาการที่เป็นที่ยอมรับ",
                    "ผลงานทางวิชาการ": "บทความในวารสารทางวิชาการ หรือ บทความในที่ประชุมวิชาการที่มีคณะกรรมการกลั่นกรองในระดับชาติหรือ ระดับนานาชาติ",
                    "ผลทดสอบภาษาอังกฤษ": "ผู้เข้าศึกษาต้องส่งผลทดสอบภาษาอังกฤษ TU-GET ไม่ต่ำกว่า 500 คะแนน หรือ TOEFL สำหรับข้อสอบแบบ Paper-based ไม่ต่ำกว่า 500 คะแนน หรือ Internet based ไม่ต่ำกว่า 61 คะแนน หรือได้ผลสอบ IELTS ไม่ต่ำกว่าระดับ 6.0 (ผลสอบต้องไม่เกิน 2 ปี นับถึงวันสมัคร)"
                }
            },
            {
                "category": "การคัดเลือกผู้เข้าศึกษา",
                "subcategories": {
                    "วิธีการคัดเลือก": "ผู้เข้าศึกษาต้องผ่านการสอบข้อเขียนและการสอบสัมภาษณ์",
                    "เงื่อนไขอื่นๆ": "ให้เป็นไปตามประกาศรับสมัครบุคคลเข้าศึกษาในระดับบัณฑิตศึกษา ของมหาวิทยาลัยธรรมศาสตร์"
                }
            },
            {
                "category": "การเปลี่ยนแปลง",
                "subcategories": {
                    "การย้ายเงื่อนไข": "นำเงื่อนไขการส่งผลสอบภาษาอังกฤษจากหัวข้อการคัดเลือกผู้เข้าศึกษาเดิม ใส่ในหัวข้อคุณสมบัติผู้เข้าศึกษา"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 6,
        "details": [
            {
                "category": "ด้านการเปลี่ยนแปลงสภาพภูมิอากาศ",
                "subcategories": {
                    "ปัญหาพลังงาน": "นำเข้าพลังงานจากต่างประเทศเนื่องจากการผลิตพลังงานภายในประเทศไม่เพียงพอต่อความต้องการ",
                    "ปัญหาสิ่งแวดล้อม": {
                        "ขยะมูลฝอย": "การแก้ไขปัญหาขยะมูลฝอย",
                        "มลพิษทางอากาศ": "ปัญหามลพิษทางอากาศที่เกินมาตรฐาน",
                        "ก๊าซเรือนกระจก": "การปล่อยก๊าซเรือนกระจกที่มีอัตราเพิ่มมากขึ้น"
                    },
                    "แนวทางแก้ไข": {
                        "เป้าหมายการพัฒนาที่ยั่งยืน": [
                            "รูปแบบการผลิตและการบริโภคแบบยั่งยืน",
                            "เตรียมความพร้อมในการรับมือการเปลี่ยนแปลงสภาพภูมิอากาศ",
                            "สงวนรักษาทรัพยากรธรรมชาติและความหลากหลายทางชีวภาพ",
                            "การจัดการทรัพยากรอย่างยั่งยืน"
                        ]
                    }
                }
            },
            {
                "category": "ความต้องการทางวิชาชีพ",
                "subcategories": {
                    "คุณสมบัติบุคลากร": [
                        "มีความพร้อมที่จะปฏิบัติงานได้ทันที",
                        "มีศักยภาพสูงในการพัฒนาตนเอง",
                        "มีความเข้าใจในผลกระทบของเทคโนโลยีที่มีต่อสังคม",
                        "ปฏิบัติตนอย่างมืออาชีพ",
                        "มีคุณธรรม จริยธรรม"
                    ],
                    "หลักสูตรที่ตอบสนอง": "หลักสูตรปริญญาเอก ด้านเทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อม (หลักสูตรนานาชาติ) ของคณะวิศวกรรมศาสตร์ มหาวิทยาลัยธรรมศาสตร์"
                }
            },
            {
                "category": "ความเกี่ยวข้องกับพันธกิจของสถาบัน",
                "subcategories": {
                    "วัตถุประสงค์": [
                        "ให้การศึกษาส่งเสริมวิชาการและวิชาชีพชั้นสูง",
                        "ทำการสอน",
                        "ทำการวิจัย",
                        "ให้บริการทางวิชาการแก่สังคม",
                        "ส่งเสริมและพัฒนาประชาธิปไตย ศีลธรรม ศิลปะและวัฒนธรรม",
                        "ส่งเสริมภูมิปัญญาไทย วิทยาศาสตร์ เทคโนโลยี และสิ่งแวดล้อม"
                    ]
                }
            },
            {
                "category": "ความสัมพันธ์กับหลักสูตรอื่น",
                "subcategories": {
                    "รายวิชาที่เปิดสอนโดยหลักสูตรอื่น": "ไม่มี",
                    "รายวิชาที่เปิดสอนให้หลักสูตรอื่น": "ไม่มี",
                    "การบริหารจัดการ": "ไม่มี"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 32,
        "details": [
            {
                "category": "ทักษะการวิเคราะห์เชิงตัวเลข การสื่อสาร และการใช้เทคโนโลยีสารสนเทศ",
                "subcategories": {
                    "ทักษะการใช้เครื่องมือ": "มีทักษะในการใช้เครื่องมือที่จำเป็นที่มีอยู่ในปัจจุบันต่อการทำงานที่เกี่ยวกับคอมพิวเตอร์",
                    "การแก้ปัญหาด้วยสารสนเทศ": "สามารถแนะนำประเด็นการแก้ไขปัญหาโดยใช้สารสนเทศทางคณิตศาสตร์หรือการแสดงสถิติประยุกต์ต่อปัญหาที่เกี่ยวข้องอย่างสร้างสรรค์",
                    "ทักษะการสื่อสาร": "สามารถสื่อสารอย่างมีประสิทธิภาพทั้งปากเปล่าและการเขียน เลือกใช้รูปแบบของสื่อการนำเสนออย่างเหมาะสม",
                    "การใช้เทคโนโลยีสารสนเทศ": "สามารถใช้สารสนเทศและเทคโนโลยีสื่อสารอย่างเหมาะสม"
                }
            },
            {
                "category": "ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ",
                "subcategories": {
                    "ภาวะผู้นำและการแก้ปัญหา": "สามารถเป็นผู้ริเริ่มแสดงประเด็นในการแก้ไขสถานการณ์ทั้งส่วนตัวและส่วนรวม พร้อมทั้งแสดงจุดยืนอย่างพอเหมาะทั้งของตนเองและของกลุ่ม"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 13,
        "details": [
            {
                "category": "แผนการศึกษา",
                "subcategories": {
                    "ปีการศึกษาที่_2": {
                        "ภาคการศึกษาที่_2": [
                            {
                                "รหัสวิชา": "กพ. 893",
                                "ชื่อวิชา": "สัมมนา 2",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "กพ. 901",
                                "ชื่อวิชา": "วิทยานิพนธ์",
                                "หน่วยกิต": 8
                            },
                            {
                                "รวม": "9 หน่วยกิต"
                            }
                        ]
                    },
                    "ปีการศึกษาที่_3": {
                        "ภาคการศึกษาที่_1": [
                            {
                                "รหัสวิชา": "กพ. 901",
                                "ชื่อวิชา": "วิทยานิพนธ์",
                                "หน่วยกิต": 9
                            },
                            {
                                "รวม": "9 หน่วยกิต"
                            }
                        ],
                        "ภาคการศึกษาที่_2": [
                            {
                                "รหัสวิชา": "กพ. 894",
                                "ชื่อวิชา": "สัมมนา 3",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "กพ. 901",
                                "ชื่อวิชา": "วิทยานิพนธ์",
                                "หน่วยกิต": 6
                            },
                            {
                                "รวม": "7 หน่วยกิต"
                            }
                        ]
                    }
                }
            },
            {
                "category": "คำอธิบายรายวิชา",
                "subcategories": {
                    "กพ._891": {
                        "ชื่อวิชา": "ระเบียบวิธีวิจัยขั้นสูง",
                        "หน่วยกิต": "1 (1-0-3)",
                        "ชื่อภาษาอังกฤษ": "Advanced Research Methodology",
                        "คำอธิบายภาษาไทย": "แนวทางในการทำวิจัยระดับปริญญาเอกการวิเคราะห์ผล การเรียบเรียง และเขียนบทความทางวิชาการระดับนานาชาติ และการนำเสนอ การอภิปรายผลงานวิจัย แนวทางในการตีพิมพ์ผลงานวิจัยในวารสารระดับนานาชาติ โดยมีการวัดผลเป็น 2 ระดับ คือ ระดับผ่าน (P) และไม่ผ่าน (N)",
                        "คำอธิบายภาษาอังกฤษ": "Methodology and protocol for conducting Ph.D. dissertation and writing up dissertation in English. Techniques for data analysis, technical writing and writing of research articles. Technique for technical presentation, research discussion and method for publication of research works in international journal (The evaluation of this course will be in 2 levels, Pass (P) and Not pass (N))"
                    },
                    "กพ._892": {
                        "ชื่อวิชา": "สัมมนา 1",
                        "หน่วยกิต": "1 (0-2-2)"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 8,
        "details": [
            {
                "category": "แผนพัฒนาปรับปรุง",
                "subcategories": {
                    "ระยะเวลา": "คาดว่าจะดำเนินการแล้วเสร็จครบถ้วน ภายใน 5 ปี"
                }
            },
            {
                "category": "การพัฒนา/เปลี่ยนแปลง",
                "subcategories": {
                    "1": "จัดทำและปรับปรุงหลักสูตรให้มีมาตรฐานไม่ต่ำกว่าเกณฑ์ที่ สป.อว. กำหนด",
                    "2": "ปรับปรุงหลักสูตรให้สอดคล้องกับความต้องการของตลาดและความก้าวหน้าของเทคโนโลยี",
                    "3": "พัฒนาบุคลากรด้านการเรียนการสอนและบริการวิชาการ"
                }
            },
            {
                "category": "กลยุทธ์",
                "subcategories": {
                    "1": [
                        "ติดตามการประเมินหลักสูตรอย่างสม่ำเสมอและต่อเนื่อง",
                        "พัฒนาหลักสูตรโดยมีพื้นฐานจากหลักสูตรในระดับสากลและผลจากการประเมินหลักสูตร"
                    ],
                    "2": [
                        "ติดตามการเปลี่ยนแปลงในความต้องการของภาคอุตสาหกรรม",
                        "นำเทคโนโลยีใหม่ ๆ มาใช้ในการเรียนการสอนเพื่อเพิ่มศักยภาพของหลักสูตร",
                        "ติดตามความพึงพอใจของผู้ใช้ดุษฎีบัณฑิตหรือนายจ้างอย่างสม่ำเสมอ"
                    ],
                    "3": [
                        "ส่งเสริมให้อาจารย์ทุกคนโดยเฉพาะอาจารย์ใหม่เข้าอบรมเกี่ยวกับหลักสูตรการสอนรูปแบบต่าง ๆ และการวัดผลและประเมินผล",
                        "สนับสนุนให้มีการบริการวิชาการแก่องค์กรภายนอก",
                        "ส่งเสริมให้มีการนำความรู้ทั้งจากภาคทฤษฎีและปฏิบัติ และงานวิจัยไปใช้จริงเพื่อทำประโยชน์ให้แก่ชุมชน"
                    ]
                }
            },
            {
                "category": "หลักฐาน/ตัวบ่งชี้",
                "subcategories": {
                    "1": [
                        "รายงานผลการประเมินหลักสูตร",
                        "เอกสารปรับปรุงหลักสูตร"
                    ],
                    "2": [
                        "รายงานผลประเมินความพึงพอใจของผู้เรียนต่อความรู้และความทันสมัยของหลักสูตร",
                        "รายงานผลการประเมินความพึงพอใจของผู้ใช้ดุษฎีบัณฑิตหรือนายจ้าง"
                    ],
                    "3": [
                        "ความสามารถในการวัดและประเมินผลของหลักสูตร",
                        "ปริมาณงานบริการวิชาการต่ออาจารย์ในหลักสูตร",
                        "รายงานผลประเมินความพึงพอใจของผู้ใช้บริการวิชาการ",
                        "จำนวนโครงการ/กิจกรรมที่เป็นประโยชน์ต่อชุมชนและความบรรลุผลสำเร็จ"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 65,
        "details": [
            {
                "category": "การสอบวิทยานิพนธ์",
                "subcategories": {
                    "เงื่อนไขการยื่นขอสอบ": "นักศึกษาสามารถยื่นขอสอบวิทยานิพนธ์ได้เมื่อสอบภาษาต่างประเทศผ่านแล้วและส่งบทความเพื่อพิจารณาตีพิมพ์ในวารสารวิชาการระดับนานาชาติ ครบ 2 เรื่องแล้วโดยไม่จำเป็นต้องรอผลการตอบรับ",
                    "กฎระเบียบการสอบ": "การสอบวิทยานิพนธ์ให้เป็นไปตามระเบียบและข้อบังคับของมหาวิทยาลัยธรรมศาสตร์",
                    "เกณฑ์การผ่าน": "การสอบวิทยานิพนธ์ที่จะได้ผลระดับ S ต้องได้มติเอกฉันท์จากคณะกรรมการสอบวิทยานิพนธ์",
                    "ลักษณะการสอบ": "การสอบวิทยานิพนธ์ต้องเป็นระบบเปิดให้ผู้สนใจเข้ารับฟังได้"
                }
            },
            {
                "category": "เกณฑ์การสำเร็จการศึกษา",
                "subcategories": {
                    "หน่วยกิต": "ได้ศึกษาลักษณะวิชาต่างๆ ครบตามโครงสร้างหลักสูตร และมีหน่วยกิตสะสมไม่น้อยกว่า 48 หน่วยกิต",
                    "ผลการศึกษาวิชาบังคับ": "ได้ระดับ P (ผ่าน) ในการศึกษาวิชาบังคับ",
                    "การสอบภาษาต่างประเทศ": "ได้ค่าระดับ P (ผ่าน) ในการสอบภาษาต่างประเทศตามเกณฑ์ของมหาวิทยาลัย",
                    "การสอบวัดคุณสมบัติ": "ได้ค่าระดับ P (ผ่าน) ในการสอบวัดคุณสมบัติ",
                    "การสอบวิทยานิพนธ์": "ได้ระดับ S (ใช้ได้) ในการสอบวิทยานิพนธ์โดยการสอบปากเปล่าขั้นสุดท้ายโดยคณะกรรมการที่คณะวิศวกรรมศาสตร์แต่งตั้ง ต้องเป็นระบบเปิดให้ผู้สนใจเข้ารับฟังได้",
                    "การจัดทำและส่งวิทยานิพนธ์": "จัดทำวิทยานิพนธ์ตามรูปแบบที่หอสมุดแห่งมหาวิทยาลัยธรรมศาสตร์กำหนดและนำส่งวิทยานิพนธ์เข้าระบบบริหารจัดการวิทยานิพนธ์ให้มหาวิทยาลัยตามระเบียบมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยวิทยานิพนธ์ สารนิพนธ์และการค้นคว้าอิสระ พ.ศ.2559"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 55,
        "details": [
            {
                "category": "อาจารย์",
                "subcategories": {
                    "รองศาสตราจารย์_ดร.ชาญณรงค์_อัศวเทศานุภาพ": {
                        "ตำราหรือหนังสือ": [
                            "เธอร์โมไดนามิคส์เบื้องต้น ส านักพิมพ์มหาวิทยาลัยธรรมศาสตร์ (ISBN 978-616-314-2481), 270 หน้า"
                        ],
                        "บทความวิจัยหรือบทความวิชาการ": [
                            "Evaluation methodology for energy efficiency of air conditioner in Thailand, The 7th International Conference on Energyand Sustainability, 20-22 September 2017, 8 Pages.",
                            "Kinetic modeling of 1- decene oligomerization to synthetic fuels and base oil over tungstated-zirconia catalyst. Reaction Kinetics Mechanisms and Catalysis, Vol 126, No1, 26 October 2018, pp529-546."
                        ]
                    },
                    "อาจารย์_ดร.พรระพีพัฒน์_ภาสบุตร": {
                        "บทความวิจัยหรือบทความวิชาการ": [
                            "กำลังผลิตติดตั้งสูงสุดที่เหมาะสมของโรงไฟฟ้าพลังงานแสงอาทิตย์ในภาคกลางของประเทศไทย. ในการประชุมวิชาการระดับชาติ วลัยลักษณ์วิจัย ครั้งที่ 10. 27-28 มีนาคม 2561.",
                            "กำลังผลิตติดตั้งสูงสุดที่เหมาะสมของโรงไฟฟ้าพลังงานแสงอาทิตย์ในเขตภาคตะวันออกของประเทศไทย. ใน การประชุมวิชาการระดับชาติ วลัยลักษณ์วิจัย ครั้งที่ 10. 27-28 มีนาคม 2561."
                        ]
                    }
                }
            },
            {
                "category": "ผลงานวิชาการอื่นๆ",
                "subcategories": {
                    "Proceedings": [
                        "Pornthep Pattanavanitkul and Watit Pakdee, Parametric study of flow and heat transfer of fluid with temperature-dependent properties subjected to the magnetic field in a porous media, Proceedings of the 22nd Conference of the Mechanical Engineering Network of Thailand (ME-NETT 31). 4-7 July 2017, Nakornnayok, Paper no. TSF20.",
                        "Watit Pakdee and Ponthep Pattanavanitkul, Numerical study of MHD flow through porous media of fluid with temperature-dependent properties, The 6th International Conference on Engineering and Innovative Materials (ICEIM 2017), September 3-5, 2017, Tokyo, Japan, Paper no. IM062-A."
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 28,
        "details": [
            {
                "category": "กลยุทธ์การสอนและการประเมินผลการเรียนรู้",
                "subcategories": {
                    "ด้านความรู้": {
                        "กลยุทธ์การสอน": [
                            "ใช้การเรียนการสอนในหลากหลายรูปแบบ",
                            "เน้นหลักการทางทฤษฎี",
                            "การใช้โปรแกรมสำเร็จรูปและประยุกต์ทางปฎิบัติในสภาพแวดล้อมจริง",
                            "งานค้นคว้าวิจัยเทคโนโลยีใหม่ ๆ",
                            "การสัมมนา",
                            "การเรียนรู้จากสถานการณ์จริงโดยการศึกษาดูงาน",
                            "เชิญผู้เชี่ยวชาญที่มีประสบการณ์ตรงมาเป็นวิทยากรพิเศษเฉพาะ"
                        ],
                        "กลยุทธ์การประเมินผล": [
                            "การสอบหัวข้อวิทยานิพนธ์",
                            "การสอบกลางภาคเรียนและปลายภาคเรียน",
                            "ประเมินจากการนำเสนอรายงานในชั้นเรียนและในวิชาสัมมนา"
                        ]
                    },
                    "ด้านทักษะทางปัญญา": {
                        "ผลการเรียนรู้": [
                            "คิดอย่างมีวิจารณญาณและอย่างเป็นระบบ",
                            "สามารถสืบค้น ตีความ และประเมินเอกสารงานวิจัยต่าง ๆ เพื่อใช้ในการแก้ไขปัญหาอย่างสร้างสรรค์",
                            "สามารถรวบรวม ศึกษา วิเคราะห์ และสรุปประเด็นปัญหาและความต้องการ",
                            "มีการแก้ไขปัญหาและการค้นคว้าวิจัยจนประสบความสำเร็จในงานวิจัยได้อย่างถูกต้องและเหมาะสม"
                        ],
                        "กลยุทธ์การสอน": [
                            "การทำงานวิจัยในวิชาวิทยานิพนธ์",
                            "การออกข้อสอบที่ให้นักศึกษาแก้ปัญหา อธิบายแนวคิดการแก้ปัญหาและวิธีการแก้ปัญหาโดยการประยุกต์ความรู้ที่เรียนมา",
                            "มีวิชาที่ให้นักศึกษามีโอกาสปฏิบัติจริง"
                        ],
                        "กลยุทธ์การประเมินผล": [
                            "ไม่มีข้อมูลระบุในเอกสารอ้างอิง"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 64,
        "details": [
            {
                "category": "การประเมินความก้าวหน้าวิทยานิพนธ์",
                "subcategories": {
                    "ความถี่": "ทุกภาคการศึกษาที่มีการลงทะเบียนวิทยานิพนธ์",
                    "ผู้ประเมิน": "อาจารย์ที่ปรึกษาวิทยานิพนธ์เป็นผู้ทำหน้าที่ประเมินความก้าวหน้า",
                    "กรรมการร่วมประเมิน": "อาจแต่งตั้งกรรมการร่วมประเมินกับอาจารย์ที่ปรึกษาวิทยานิพนธ์",
                    "ข้อบังคับ": "ให้เป็นไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาระดับบัณฑิตศึกษา พ.ศ.2553 (แก้ไขเพิ่มเติมถึงฉบับปัจจุบัน)"
                }
            },
            {
                "category": "อาจารย์ที่ปรึกษาวิทยานิพนธ์",
                "subcategories": {
                    "องค์ประกอบ": "อาจารย์ที่ปรึกษาวิทยานิพนธ์หลัก และ/หรือ อาจารย์ที่ปรึกษาวิทยานิพนธ์ร่วม",
                    "เกณฑ์": "ให้เป็นไปตามเกณฑ์มาตรฐานหลักสูตรระดับบัณฑิตศึกษา ของสำนักงานคณะกรรมการการอุดมศึกษา พ.ศ.2558"
                }
            },
            {
                "category": "การสอบวิทยานิพนธ์",
                "subcategories": {
                    "คุณสมบัติผู้สอบ": "อาจารย์ผู้สอบวิทยานิพนธ์ให้เป็นไปตามเกณฑ์มาตรฐานหลักสูตรระดับบัณฑิตศึกษาของสำนักงานคณะกรรมการการอุดมศึกษา พ.ศ.2558"
                }
            },
            {
                "category": "ขั้นตอนการทำวิทยานิพนธ์",
                "subcategories": {
                    "การสอบเค้าโครง": "นักศึกษาต้องได้รับอนุมัติข้อเสนอสอบเค้าโครงวิทยานิพนธ์ก่อน",
                    "ระยะเวลาทำวิทยานิพนธ์": "ไม่น้อยกว่า 2 เดือน นับจากวันที่สอบเค้าโครงวิทยานิพนธ์ผ่าน",
                    "การปรึกษา": "นักศึกษาต้องค้นคว้าและเขียนวิทยานิพนธ์โดยปรึกษากับอาจารย์ที่ปรึกษาวิทยานิพนธ์โดยสม่ำเสมอ",
                    "การขอสอบ": "มีสิทธิเสนอขอสอบวิทยานิพนธ์ต่อคณะกรรมการสอบวิทยานิพนธ์หลังจากทำวิทยานิพนธ์ครบระยะเวลาที่กำหนด"
                }
            },
            {
                "category": "คุณสมบัติอาจารย์และกรรมการสอบ",
                "subcategories": {
                    "เกณฑ์": "ให้เป็นไปตามเกณฑ์มาตรฐานหลักสูตรระดับบัณฑิตศึกษา ของสำนักงานปลัดกระทรวงการอุดมศึกษา วิทยาศาสตร์ วิจัยและนวัตกรรม"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 52,
        "details": [
            {
                "category": "รองศาสตราจารย์ ดร.พัชราภรณ์ วุฒิเจริญมงคล",
                "subcategories": {
                    "บทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติ": [
                        {
                            "ชื่อบทความ": "Gallic acid- Loaded Electrospun Cellulose Acetate Nanofibers as Potential Wound Dressing Materials",
                            "ผู้แต่ง": "Patcharaporn Wutticharoenmongkol, Pornchita Hannirojram, Pimchanok Nuthong",
                            "วารสาร": "Polymers for Advanced Technologies",
                            "ปีที่พิมพ์": "2019",
                            "รายละเอียดการตีพิมพ์": "Volume 30, Issue 4, April 2019, Pages 1135-1147"
                        },
                        {
                            "ชื่อบทความ": "Release of Sodium Salicylate from Hydrogels Prepared from Wheat and Arrowroot Starches",
                            "ผู้แต่ง": "Patcharaporn Thitiwongsawet, Choolchinda Chandratat, Sutee Boonnoppornkul",
                            "วารสาร": "Key Engineering Materials",
                            "ปีที่พิมพ์": "2018",
                            "รายละเอียดการตีพิมพ์": "ISSN: 1662-9795, Vol. 765, 26-Mar-2018, p124-130"
                        },
                        {
                            "ชื่อบทความ": "Properties of composite films from sugarcane bagasse, coconut coir, and water hyacinth fibers/poly (Vinyl chloride)",
                            "ผู้แต่ง": "Patcharaporn Thitiwongsawet, Supattra Saetan, Paponsan Siangsanoh",
                            "วารสาร": "Materials Science Forum",
                            "ปีที่พิมพ์": "2017",
                            "รายละเอียดการตีพิมพ์": "Vol.890, pp.196-203, 20-Mar-2017"
                        }
                    ]
                }
            },
            {
                "category": "รองศาสตราจารย์ ดร.ภณิดา ซ้ายขวัญ",
                "subcategories": {
                    "งานสร้างสรรค์ที่ได้รับการเผยแพร่ในระดับนานาชาติ": [
                        {
                            "ชื่อผลงาน": "Optimization of Cellulase-Assisted Extraction of Polysaccharide From Coconut Residue",
                            "ผู้นำเสนอ": "N. DAO, P Saikhwan",
                            "การประชุม": "191st The IIER International Conference",
                            "สถานที่": "Tokyo, Japan",
                            "วันที่": "26-27 Sep 2018",
                            "หน้า": "38-43"
                        },
                        {
                            "ชื่อผลงาน": "Enzyme-Based Cleaning of Coconut Milk Foulants",
                            "ผู้นำเสนอ": "T. Chutrakul, N. Rangton, R. Daochot, N. Sattayathitikul, P. Saikhwan",
                            "การประชุม": "Fouling and cleaning in food processing",
                            "สถานที่": "Lund, Sweden",
                            "วันที่": "April 17 – 20, 2018",
                            "หน้า": "93-100"
                        }
                    ],
                    "บทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติ": [
                        {
                            "ชื่อบทความ": "Development of low saturated fat chocolate cakes by replacing butter with soybean oil",
                            "ผู้แต่ง": "Saikhwan, P., Sukvisit, N. and Luengaramkul, N.",
                            "วารสาร": "Journal of Science and Technology, Ubon Ratchathani University",
                            "ฉบับ": "Special issue September 2017",
                            "หน้า": "280-292"
                        }
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 17,
        "details": [
            {
                "category": "อาจารย์ประจำหลักสูตร",
                "subcategories": [
                    {
                        "ลำดับที่": "4",
                        "ชื่อ-สกุล": "แคทลียา ปัทมพรหม",
                        "เลขประจำตัวประชาชน": "4100600053xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Michigan, USA",
                                "ปี": "2544"
                            },
                            {
                                "ระดับ": "M.S.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Michigan, USA",
                                "ปี": "2540"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2537"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "5",
                        "ชื่อ-สกุล": "วันวิสาข์ สกลภาพ",
                        "เลขประจำตัวประชาชน": "3100501910xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Waterloo, Canada",
                                "ปี": "2546"
                            },
                            {
                                "ระดับ": "M.S.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "Colorado State University, USA",
                                "ปี": "2538"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "มหาวิทยาลัยขอนแก่น",
                                "ปี": "2536"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "6",
                        "ชื่อ-สกุล": "นุรักษ์ กฤษดานุรักษ์",
                        "เลขประจำตัวประชาชน": "3559900130xxx",
                        "ตำแหน่งทางวิชาการ": "ศาสตราจารย์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical and Petroleum",
                                "สถาบัน": "Colorado School of Mines, USA",
                                "ปี": "2541",
                                "หมายเหตุ": "(หลักสูตรปริญญาโทควบเอก)"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "สถาบันเทคโนโลยีพระจอมเกล้าธนบุรี",
                                "ปี": "2539"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "7",
                        "ชื่อ-สกุล": "หาญพล พึ่งรัศมี",
                        "เลขประจำตัวประชาชน": "3909800880xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Environmental Engineering",
                                "สถาบัน": "Ajou University, Korea",
                                "ปี": "2550"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Environmental Technology and Management",
                                "สถาบัน": "สถาบันเทคโนโลยีแห่งเอเชีย",
                                "ปี": "2544"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "มหาวิทยาลัยธรรมศาสตร์",
                                "ปี": "2540"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 24,
        "details": [
            {
                "category": "อาจารย์ที่ปรึกษาวิทยานิพนธ์",
                "subcategories": {
                    "คุณสมบัติ": "เป็นอาจารย์ประจำมหาวิทยาลัยและผู้ทรงคุณวุฒิจากภายนอกมหาวิทยาลัย โดยมีคุณสมบัติเป็นไปตามเกณฑ์มาตรฐานหลักสูตรระดับบัณฑิตศึกษาของสำนักงานปลัดกระทรวงการอุดมศึกษา วิทยาศาสตร์ วิจัยและนวัตกรรม (สป.อว)",
                    "หน้าที่": "ให้คำแนะนำนักศึกษา สอบเค้าโครงวิทยานิพนธ์และสอบวิทยานิพนธ์"
                }
            },
            {
                "category": "การดำเนินการวิทยานิพนธ์",
                "subcategories": {
                    "ระยะเวลา": "นักศึกษาต้องค้นคว้าและเขียนวิทยานิพนธ์โดยปรึกษากับอาจารย์ที่ปรึกษาเป็นเวลาไม่น้อยกว่า 2 เดือนนับจากวันที่สอบเค้าโครงวิทยานิพนธ์ผ่าน",
                    "การขอสอบวิทยานิพนธ์": "นักศึกษามีสิทธิเสนอขอสอบวิทยานิพนธ์ต่อคณะกรรมการสอบวิทยานิพนธ์หลังจากผ่านระยะเวลาที่กำหนด"
                }
            },
            {
                "category": "การสอบวิทยานิพนธ์",
                "subcategories": {
                    "คณะกรรมการสอบ": "ประกอบด้วยอาจารย์ที่ปรึกษาวิทยานิพนธ์ อาจารย์ประจำหลักสูตร และผู้ทรงคุณวุฒิภายนอกสถาบัน รวมไม่น้อยกว่า 5 ท่าน โดยประธานกรรมการสอบต้องเป็นผู้ทรงคุณวุฒิภายนอก",
                    "คุณสมบัติกรรมการสอบ": "ต้องมีคุณวุฒิ คุณสมบัติ และผลงานทางวิชาการตามเกณฑ์มาตรฐานหลักสูตรระดับบัณฑิตศึกษา",
                    "เงื่อนไขการสอบ": "นักศึกษาต้องส่งบทความเพื่อพิจารณาตีพิมพ์ในวารสารวิชาการระดับนานาชาติ ครบ 2 เรื่องก่อนยื่นขอสอบ",
                    "การตัดสินผล": "การสอบวิทยานิพนธ์ที่จะได้ผลระดับ S (ใช้ได้) ต้องได้มติเอกฉันท์จากคณะกรรมการสอบ",
                    "ลักษณะการสอบ": "ต้องเป็นระบบเปิดให้ผู้สนใจเข้ารับฟังได้"
                }
            },
            {
                "category": "การเตรียมการ",
                "subcategories": {
                    "การเลือกหัวข้อ": "นักศึกษาเลือกหัวข้อวิจัยที่สนใจและปรึกษากับอาจารย์ที่ปรึกษา",
                    "การแต่งตั้งที่ปรึกษา": "คณบดีแต่งตั้งอาจารย์ที่ปรึกษาวิทยานิพนธ์เพื่อแนะนำการเขียนวิทยานิพนธ์",
                    "การแต่งตั้งคณะกรรมการสอบ": "คณบดีแต่งตั้งคณะกรรมการสอบวิทยานิพนธ์เพื่อประเมินคุณภาพของหัวข้อและเนื้อหาวิทยานิพนธ์"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 12,
        "details": [
            {
                "category": "โครงสร้างหลักสูตร",
                "subcategories": {
                    "วิชาบังคับ": "นักศึกษาต้องศึกษาวิชาบังคับ ไม่น้อยกว่า 4 หน่วยกิต (ไม่นับหน่วยกิตรวม)",
                    "รายวิชาบังคับ": {
                        "กพ. 891": {
                            "ชื่อวิชา": "ระเบียบวิธีวิจัยขั้นสูง",
                            "หน่วยกิต": "1 (1-0-3)"
                        },
                        "กพ. 892": {
                            "ชื่อวิชา": "สัมมนา 1",
                            "หน่วยกิต": "1 (0-2-2)"
                        },
                        "กพ. 893": {
                            "ชื่อวิชา": "สัมมนา 2",
                            "หน่วยกิต": "1 (0-2-2)"
                        },
                        "กพ. 894": {
                            "ชื่อวิชา": "สัมมนา 3",
                            "หน่วยกิต": "1 (0-2-2)"
                        }
                    },
                    "วิทยานิพนธ์": {
                        "กพ. 901": {
                            "ชื่อวิชา": "วิทยานิพนธ์",
                            "หน่วยกิต": "48 หน่วยกิต"
                        }
                    }
                }
            },
            {
                "category": "แผนการศึกษา",
                "subcategories": {
                    "ปีการศึกษาที่ 1": {
                        "ภาคการศึกษาที่ 1": {
                            "รายวิชา": [
                                {
                                    "รหัสวิชา": "กพ. 891",
                                    "ชื่อวิชา": "ระเบียบวิธีวิจัยขั้นสูง",
                                    "หน่วยกิต": "1 หน่วยกิต"
                                },
                                {
                                    "รหัสวิชา": "กพ. 901",
                                    "ชื่อวิชา": "วิทยานิพนธ์",
                                    "หน่วยกิต": "8 หน่วยกิต"
                                }
                            ],
                            "รวมหน่วยกิต": "9 หน่วยกิต"
                        },
                        "ภาคการศึกษาที่ 2": {
                            "หมายเหตุ": "นักศึกษาสามารถยื่นขอสอบวัดคุณสมบัติได้ตั้งแต่ภาคการศึกษาที่ 2 เป็นต้นไป",
                            "รายวิชา": [
                                {
                                    "รหัสวิชา": "กพ. 892",
                                    "ชื่อวิชา": "สัมมนา 1",
                                    "หน่วยกิต": "1 หน่วยกิต"
                                },
                                {
                                    "รหัสวิชา": "กพ. 901",
                                    "ชื่อวิชา": "วิทยานิพนธ์",
                                    "หน่วยกิต": "8 หน่วยกิต"
                                }
                            ],
                            "รวมหน่วยกิต": "9 หน่วยกิต"
                        }
                    },
                    "ปีการศึกษาที่ 2": {
                        "ภาคการศึกษาที่ 1": {
                            "รายวิชา": [
                                {
                                    "รหัสวิชา": "กพ. 901",
                                    "ชื่อวิชา": "วิทยานิพนธ์",
                                    "หน่วยกิต": "9 หน่วยกิต"
                                }
                            ]
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 30,
        "details": [
            {
                "category": "ทักษะในการวิเคราะห์เชิงตัวเลข การสื่อสาร และการใช้เทคโนโลยีสารสนเทศ",
                "subcategories": {
                    "ความคาดหวัง": {
                        "1": "สามารถแนะนำประเด็นการแก้ไขปัญหาโดยใช้สารสนเทศทางคณิตศาสตร์หรือการแสดงสถิติประยุกต์ต่อปัญหาที่เกี่ยวข้องอย่างสร้างสรรค์",
                        "2": "สามารถสื่อสารอย่างมีประสิทธิภาพทั้งปากเปล่าและการเขียน เลือกใช้รูปแบบของสื่อการนำเสนออย่างเหมาะสม",
                        "3": "สามารถใช้สารสนเทศและเทคโนโลยีสื่อสารอย่างเหมาะสม"
                    },
                    "การวัดมาตรฐาน": "ทำได้ในระหว่างการสอน โดยอาจให้นักศึกษาแก้ปัญหา วิเคราะห์ประสิทธิภาพของวิธีแก้ปัญหา และให้นำเสนอแนวคิดของการแก้ปัญหา ผลการวิเคราะห์ประสิทธิภาพ ต่อนักศึกษาในชั้นเรียน อาจมีการวิจารณ์ในเชิงวิชาการระหว่างอาจารย์และกลุ่มนักศึกษา",
                    "กลยุทธ์การสอน": {
                        "1": "มีการใช้โปรแกรมคอมพิวเตอร์สำเร็จรูปในการเรียนการสอนและการออกแบบกระบวนการผลิตในรายวิชาต่าง ๆ",
                        "2": "มีการนำเสนอ / สื่อสารในวิชาสัมมนา และการสอบวิทยานิพนธ์รวมทั้งการนำเสนอผลงานวิจัยโดยใช้สื่อคอมพิวเตอร์ร่วมกับการนำเสนอปากเปล่า",
                        "3": "ฝึกฝนการเขียนวิทยานิพนธ์และผลงานวิจัยรวมถึงรายงานต่าง ๆ"
                    },
                    "กลยุทธ์การประเมินผล": {
                        "1": "การประเมินจากผลการประเมินวิชาสัมมนา",
                        "2": "ประเมินจากการสอบหัวข้อวิทยานิพนธ์ และการสอบวิทยานิพนธ์และการผ่านข้อกำหนดต่าง ๆ ในการจบการศึกษา"
                    }
                }
            },
            {
                "category": "คุณธรรม จริยธรรม",
                "subcategories": {
                    "ผลการเรียนรู้": {
                        "1": "ตระหนักในคุณค่าและคุณธรรม จริยธรรม เสียสละ และซื่อสัตย์สุจริต",
                        "2": "มีวินัย ตรงต่อเวลา และความรับผิดชอบต่อตนเอง วิชาชีพและสังคม",
                        "3": "มีภาวะความเป็นผู้นำและผู้ตาม สามารถทำงานเป็นทีมและสามารถแก้ไขข้อขัดแย้งและลำดับความสำคัญ",
                        "4": "เคารพสิทธิและรับฟังความคิดเห็นของผู้อื่น รวมทั้งเคารพในคุณค่าและศักดิ์ศรีของความเป็นมนุษย์"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 3,
        "details": [
            {
                "category": "การรับเข้าศึกษาและความร่วมมือ",
                "subcategories": {
                    "การรับเข้าศึกษา": "รับทั้งนักศึกษาไทย และนักศึกษาต่างชาติที่สามารถใช้ภาษาอังกฤษได้เป็นอย่างดี",
                    "ความร่วมมือกับสถาบันอื่น": "เป็นหลักสูตรที่ของสถาบันโดยเฉพาะ",
                    "การให้ปริญญาแก่ผู้สำเร็จการศึกษา": "ให้ปริญญาเพียงสาขาวิชาเดียว"
                }
            },
            {
                "category": "สถานภาพของหลักสูตรและการพิจารณาอนุมัติ",
                "subcategories": {
                    "ประเภทหลักสูตร": "หลักสูตรปรับปรุง พ.ศ. 2565 ปรับปรุงจากหลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาเทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อม พ.ศ. 2560",
                    "กำหนดเปิดสอน": "ภาคการศึกษาที่ 1 ปีการศึกษา 2565",
                    "การพิจารณากลั่นกรอง": "โดยคณะกรรมการนโยบายวิชาการ ในการประชุมครั้งที่ ........... เมื่อวันที่ ......... เดือน ................ พ.ศ. ...........",
                    "การอนุมัติ/เห็นชอบหลักสูตร": "จากสภามหาวิทยาลัย ในการประชุมครั้งที่ ........... เมื่อวันที่ ......... เดือน ................ พ.ศ. ..........."
                }
            },
            {
                "category": "ความพร้อมในการเผยแพร่หลักสูตร",
                "subcategories": {
                    "ความพร้อม": "หลักสูตรมีความพร้อมเผยแพร่มีคุณภาพและมาตรฐานตามกรอบมาตรฐานคุณวุฒิระดับอุดมศึกษาแห่งชาติ",
                    "ปีการศึกษาที่พร้อมเผยแพร่": "ปีการศึกษา 2566"
                }
            },
            {
                "category": "อาชีพที่สามารถประกอบได้หลังสำเร็จการศึกษา",
                "subcategories": {
                    "อาชีพ_1": "วิศวกรกระบวนการผลิต (Production Engineer) และพลังงาน",
                    "อาชีพ_2": "วิศวกรออกแบบกระบวนการผลิต (Design Engineer)",
                    "อาชีพ_3": "นักวิจัยและพัฒนาในองค์กรราชการและเอกชน",
                    "อาชีพ_4": "นักวิเคราะห์โครงการ",
                    "อาชีพ_5": "ผู้ประกอบการธุรกิจที่เกี่ยวข้องกับเทคโนโลยีพลังงาน การอนุรักษ์พลังงานและสิ่งแวดล้อม",
                    "อาชีพ_6": "วิศวกรความปลอดภัยกับงานสิ่งแวดล้อม",
                    "อาชีพ_7": "นักเทคโนโลยีพลังงานและสิ่งแวดล้อม",
                    "อาชีพ_8": "วิศวกรแผนกควบคุมคุณภาพ",
                    "อาชีพ_9": "นักวิชาชีพในสถานประกอบการที่มีการใช้เทคโนโลยีที่เกี่ยวข้องกับกระบวนการทางเคมีและเครื่องมือวิเคราะห์ต่าง ๆ"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 11,
        "details": [
            {
                "category": "ค่าใช้จ่าย",
                "subcategories": {
                    "อื่น_ๆ": "25,000 บาท",
                    "รวมทั้งสิ้น": "200,000 บาท",
                    "ค่าใช้จ่ายต่อหัวนักศึกษา": "80,967 บาทต่อปี",
                    "การบริหารจัดการ": "โครงการบริการการศึกษา (เพื่อรับปริญญา) (โครงการพิเศษ)"
                }
            },
            {
                "category": "ระบบการศึกษา",
                "subcategories": {
                    "แบบชั้นเรียน": true,
                    "แบบทางไกลผ่านสื่อสิ่งพิมพ์เป็นหลัก": false,
                    "แบบทางไกลผ่านสื่อแพร่ภาพและเสียงเป็นสื่อหลัก": false,
                    "แบบทางไกลทางอิเล็กทรอนิกส์เป็นสื่อหลัก_(E-learning)": false,
                    "แบบทางไกลทางอินเตอร์เน็ต": false,
                    "อื่นๆ": "ไม่ระบุ"
                }
            },
            {
                "category": "การเทียบโอนหน่วยกิต_รายวิชาและการลงทะเบียนเรียนข้ามมหาวิทยาลัย",
                "subcategories": {
                    "ข้อบังคับ": "เป็นไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาระดับบัณฑิตศึกษา พ.ศ. 2561 ข้อ 42, 43 และข้อ 44"
                }
            },
            {
                "category": "หลักสูตร",
                "subcategories": {
                    "จำนวนหน่วยกิตรวม": "48 หน่วยกิต",
                    "ระยะเวลาศึกษา": {
                        "ประเภท": "หลักสูตรแบบศึกษาไม่เต็มเวลา",
                        "ระยะเวลาขั้นต่ำ": "6 ภาคการศึกษาปกติ",
                        "ระยะเวลาสูงสุด": "12 ภาคการศึกษาปกติ"
                    },
                    "โครงสร้างหลักสูตร": {
                        "แบบ_1.1": {
                            "วิชาบังคับ": "ไม่น้อยกว่า 4 หน่วยกิต (ไม่นับหน่วยกิตรวม)",
                            "วิทยานิพนธ์": "ไม่น้อยกว่า 48 หน่วยกิต"
                        }
                    },
                    "รหัสวิชา": {
                        "อักษรย่อ": "กพ. (EM)",
                        "ความหมาย": "อักษรย่อของสาขาวิชา เทคโนโลยีจัดการการพลังงานและสิ่งแวดล้อม"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 50,
        "details": [
            {
                "category": "มคอ.2",
                "subcategories": {
                    "เอกสารอ้างอิง": "Production from Waste Cooling Oil in a Continuous Mesoscale Oscillatory Baffled Reactor. Engineering Journal. Vol. 24: Issue 2, 2020 pp. 19–28"
                }
            },
            {
                "category": "ผลงานทางวิชาการ",
                "subcategories": {
                    "รองศาสตราจารย์ ดร.ภาณุ ด่านวานิชกุล": {
                        "บทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุมวิชาการระดับนานาชาติ": [
                            {
                                "ชื่อบทความ": "Synthesis of gold nanoparticles by using skim natural rubber latex",
                                "ผู้เขียน": "P. Pongsanon, P. Khonglek, P. Danwanichakul",
                                "วารสาร": "Thammasat Engineering Journal",
                                "ปีที่พิมพ์": 2018,
                                "ค่าน้ำหนัก": 0.4
                            }
                        ],
                        "บทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติ": [
                            {
                                "ชื่อบทความ": "Silver nanoparticle synthesis using the serum obtained after rubber coagulation of skim natural rubber latex with chitosan solution",
                                "ผู้เขียน": "Thanaporn Jullabuth and Panu Danwanichakul",
                                "วารสาร": "Engineering and Applied Science Research",
                                "ปีที่พิมพ์": 2021,
                                "ค่าน้ำหนัก": 1
                            },
                            {
                                "ชื่อบทความ": "Permeation of salicylic acid through skim natural rubber films",
                                "ผู้เขียน": "Panu Danwanichakul, Bhumin Than-ardna",
                                "วารสาร": "Industrial Crops & Products",
                                "ปีที่พิมพ์": 2018,
                                "ค่าน้ำหนัก": 1
                            }
                        ]
                    },
                    "ผู้ช่วยศาสตราจารย์ ดร.พงศ์ธร ธูปะเตมีย์": {
                        "บทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุมวิชาการระดับชาติ": [
                            {
                                "ชื่อบทความ": "การล้างขุยมะพร้าวเพื่อให้เหมาะสมกับการนำไปทำเป็นวัสดุเพาะกล้า",
                                "ผู้เขียน": "พิมพ์ชนก บุญวัฒน์, ชุติกาญจน์ องอาจโอฬาร, พงศ์ธร ธูปะเตมีย์, ชิดพงศ์ ประดิษฐสุวรรณ",
                                "การประชุม": "การประชุมวิชาการเพื่อนำเสนอผลงานวิจัยระดับชาติ",
                                "วันที่": "18 มิ.ย.64",
                                "ค่าน้ำหนัก": 0.2
                            },
                            {
                                "ชื่อบทความ": "การเก็บรักษาพริกแห้งจะทำให้มันบดง่ายขึ้นหรือยากขึ้น",
                                "ผู้เขียน": "ชลิตา อุ่นเรืองเกียรติ, พงศ์ธร ธูปเตมีย์",
                                "การประชุม": "การประชุมวิชาการระดับชาติและนานาชาติ ครั้งที่ 5, มหาวิทยาลัยภาคตะวันออกเฉียงเหนือ NEUNIC 2018",
                                "วันที่": "21 กรกฎาคม 2561",
                                "ค่าน้ำหนัก": 0.2
                            },
                            {
                                "ชื่อบทความ": "ผลกระทบของสารดูดกลืนคลื่นไมโครเวฟ",
                                "ผู้เขียน": "พิชญานันท์ ไวยเนตร, พงศ์ธร ธูปเตมีย์ และโปรดปราน สิริธีรศาสน์",
                                "ปีที่พิมพ์": 2017,
                                "ค่าน้ำหนัก": 0.2
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 49,
        "details": [
            {
                "category": "อาจารย์ประจำหลักสูตร",
                "subcategories": {
                    "รองศาสตราจารย์ ดร.วันวิสาข์ สกลภาพ": {
                        "ผลงาน": [
                            {
                                "ประเภท": "งานสร้างสรรค์ที่ได้รับการเผยแพร่ในระดับนานาชาติ",
                                "จำนวน": 1,
                                "รายการ": [
                                    "Nanta, P., W. Skolpap, and K. Kasemwong. Influence of hydrocolloids on the rheological and textural attributes of a gluten-free meat analogbased on soy protein isolate. Journal of Food Processing and Preservation, 2021, 45: e15244",
                                    "Srichainat, P., Skolpap W. (2019). The Influence of Extrusion Processing Parameters on The Textural Properties of soybean Meal-Based Meat Analogue. Proceedings of Researchfora 52 nd International Conference, Ottawa, Canada, 27-28 April 2019, 11-14.",
                                    "Tangsiriratana, E., Skolpap W. (2019). Thermal properties and behavior of microencapsulated sugarcane wax phase change material. Heliyon, Volume 5, Issue 8, August 2019, 1-12."
                                ]
                            }
                        ]
                    },
                    "ศาสตราจารย์ ดร.นุรักษ์ กฤษดานุรักษ์": {
                        "ผลงาน": [
                            {
                                "ประเภท": "บทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่มีอยู่ในฐานข้อมูล ตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ.2556",
                                "จำนวน": 1,
                                "รายการ": [
                                    "Rattabal Khunphonoi, Kitirote Wantala,Nurak Grisdanurak \"Hydrothermal synthesis of monocopper sulfide for hydrogen peroxide-assisted photodegradation of paraquat\" Environmental Engineering Research 2021;26(1):190484, March 2020",
                                    "Yan, M., Liu, J., Hantoko, D., Kanchanatip, E., Cai, Y., Gao, Z. Grisdanurak, N. (2019) Hydrogen-rich syngas production by catalytic cracking of tar in wastewater under supercritical condition, International Journal of Hydrogen Energy Volume 44, Issue 36, 26 July 2019, Pages 19908-19919. (Impact factor: 4.084)",
                                    "Kanchanatip, E., Tulaphol, S., Den, W., Grisdanurak, N., Miao, H.-Y., Yan, M. (2019) Sensing and adsorption study of gaseous phase chlorophenols on functionalized carbon nanotube membrane, Environmental Progress and Sustainable Energy Volume 38, Issue s1, March 2019, Pages S315-S322. (Impact factor: 1.596)"
                                ]
                            }
                        ]
                    },
                    "รองศาสตราจารย์ ดร.มาลี สันติคุณาภรณ์": {
                        "ผลงาน": [
                            {
                                "ประเภท": "บทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติที่มีอยู่ในฐานข้อมูล ตามประกาศ ก.พ.อ. หรือระเบียบคณะกรรมการการอุดมศึกษาว่าด้วย หลักเกณฑ์การพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ พ.ศ. 2556",
                                "จำนวน": 1,
                                "รายการ": [
                                    "Malee Santikunaporn1, Tattep Techopittayakul1, Snunkheam Echaroj2, Sumaeth Chavadej3, Yi-Hung Chen4, Min-Hao Yuan5, and Channarong Asavatesanupap2,\"Optimization of Biodiesel\""
                                ]
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 57,
        "details": [
            {
                "category": "ชื่อหลักสูตรและชื่อปริญญา",
                "subcategories": {
                    "ชื่อหลักสูตร": {
                        "ไทย": "ปรัชญาดุษฎีบัณฑิต สาขาวิชาเทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อม (หลักสูตรนานาชาติ)",
                        "อังกฤษ": "Doctor of Philosophy Program in Energy and Environmental Technology Management (International Program)"
                    },
                    "ชื่อปริญญา": {
                        "ไทย": {
                            "ชื่อเต็ม": "ปรัชญาดุษฎีบัณฑิต (เทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อม)",
                            "ชื่อย่อ": "ปร.ด. (เทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อม)"
                        },
                        "อังกฤษ": {
                            "ชื่อเต็ม": "Doctor of Philosophy (Energy and Environmental Technology Management)",
                            "ชื่อย่อ": "Ph.D. (Energy and Environmental Technology Management)"
                        }
                    },
                    "สรุปการเปลี่ยนแปลง": "คงเดิม"
                }
            },
            {
                "category": "ปรัชญา ความสำคัญ และวัตถุประสงค์ของหลักสูตร",
                "subcategories": {
                    "ปรัชญา": {
                        "ฉบับปรับปรุง พ.ศ. 2560": "หลักสูตรมุ่งเน้นงานวิจัยเชิงลึกเพื่อค้นคว้าเทคโนโลยีใหม่ๆในด้านพลังงานและสิ่งแวดล้อม รวมถึงการจัดการพลังงานและสิ่งแวดล้อมที่ทันต่อการเปลี่ยนแปลงของโลก ส่งเสริมการคิดวิเคราะห์อย่างมีเหตุผล มี",
                        "ฉบับปรับปรุง พ.ศ. 2565": "หลักสูตรมุ่งเน้นงานวิจัยเชิงลึกเพื่อค้นคว้าเทคโนโลยีใหม่ๆในด้านพลังงานและสิ่งแวดล้อม รวมถึงการจัดการพลังงานและสิ่งแวดล้อมที่ทันต่อการเปลี่ยนแปลงของโลก ส่งเสริมการคิดวิเคราะห์อย่างมีเหตุผล มี",
                        "สรุปการเปลี่ยนแปลง": "ปรับแก้ไขปรัชญาเพื่อนำไปสู่การแก้ไขปัญหาสิ่งแวดล้อมให้กว้างขึ้น"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 9,
        "details": [
            {
                "category": "ระบบการจัดการศึกษา",
                "subcategories": {
                    "ระบบ": "ใช้ระบบการศึกษาแบบทวิภาค โดย 1 ปีการศึกษาแบ่งออกเป็น 2 ภาคการศึกษาปกติ 1 ภาคการศึกษา มีระยะเวลาศึกษาไม่น้อยกว่า 15 สัปดาห์ ภาคการศึกษาที่บังคับ",
                    "การจัดการศึกษาภาคฤดูร้อน": "ไม่มี",
                    "การเทียบเคียงหน่วยกิตในระบบทวิภาค": "ไม่"
                }
            },
            {
                "category": "การดำเนินการหลักสูตร",
                "subcategories": {
                    "วัน-เวลาในการดำเนินการเรียนการสอน": {
                        "วันเรียน": "เรียนวันเสาร์ – อาทิตย์",
                        "เวลาเรียน": "เวลา 9.00 น. ถึง 16.00 น.",
                        "ภาคการศึกษาที่_1": "เดือนสิงหาคม – ธันวาคม",
                        "ภาคการศึกษาที่_2": "เดือนมกราคม – พฤษภาคม"
                    },
                    "คุณสมบัติของผู้เข้าศึกษา": {
                        "ข้อกำหนดทั่วไป": "คุณสมบัติของผู้มีสิทธิสมัครเข้าเป็นนักศึกษาต้องเป็นไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ว่าด้วยการศึกษาระดับบัณฑิตศึกษา พ.ศ. 2561 ข้อ 22 – 23",
                        "คุณสมบัติเฉพาะ": [
                            "สำเร็จการศึกษาขั้นต่ำตามที่กำหนดไว้ในข้อกำหนดหลักสูตร",
                            "ไม่เป็นผู้ป่วย หรืออยู่ในสภาวะที่จะเป็นอุปสรรคร้ายแรงต่อการศึกษา",
                            "ไม่เป็นผู้ประพฤติผิดศีลธรรมอันดี หรือมีพฤติกรรมเสื่อเสียอย่างร้ายแรง",
                            "ต้องไม่เคยถูกคัดชื่อออกจากมหาวิทยาลัยหรือสถาบันอุดมศึกษาอื่นเพราะมีความผิดทางวินัย ภายในระยะเวลา 10 ปี ก่อนการสมัครเข้าเป็นนักศึกษา",
                            "เป็นผู้สำเร็จการศึกษาชั้นปริญญาโท สาขาวิชาเทคโนโลยีการจัดการพลังงาน และ/หรือเทคโนโลยีการจัดการสิ่งแวดล้อม หรือ สาขาอื่นที่เกี่ยวข้องทั้งในหรือต่างประเทศจากสถาบันการศึกษาที่สภามหาวิทยาลัยรับรองวิทยฐานะ หรือ ผ่านความเห็นชอบจากคณะกรรมการหลักสูตรปรัชญาดุษฏีบัณฑิต สาขาวิชาเทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อม",
                            "มีค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 3.50 จากระดับ 4.00 หรือกรณีของผู้สมัครมีค่าระดับเฉลี่ยสะสมต่ำกว่า 3.50 ในระดับปริญญาโทจะต้องมีผลงานทางวิชาการที่เป็นที่ยอมรับ"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 21,
        "details": [
            {
                "category": "อาจารย์ประจำหลักสูตร",
                "subcategories": [
                    {
                        "ลำดับ": "20",
                        "เลขประจำตัวประชาชน": "3100600082xxx",
                        "ตำแหน่งทางวิชาการ": "อาจารย์",
                        "ชื่อ-สกุล": "เวโรนิก้า วิโนโต้",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Integrated Chemical Engineering",
                                "สถาบัน": "Mahidol University",
                                "ปี": "2562"
                            },
                            {
                                "ระดับ": "วศ.ม.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2558"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "มหาวิทยาลัยธรรมศาสตร์",
                                "ปี": "2556"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "21",
                        "เลขประจำตัวประชาชน": "3100601993xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "วาทิต ภักดี",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Mechanical Engineering",
                                "สถาบัน": "University of Colorado, USA",
                                "ปี": "2546"
                            },
                            {
                                "ระดับ": "M.S.",
                                "สาขาวิชา": "Mechanical Engineering",
                                "สถาบัน": "University of Southern California, USA",
                                "ปี": "2537"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมอุตสาหการ",
                                "สถาบัน": "มหาวิทยาลัยเกษตรศาสตร์",
                                "ปี": "2534"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "22",
                        "เลขประจำตัวประชาชน": "3102002252xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "ชาญณรงค์ อัศวเทศานุภาพ",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Mechanical Engineering",
                                "สถาบัน": "University of Southern California, USA",
                                "ปี": "2550"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Aerospace engineering",
                                "สถาบัน": "University of Southern California, USA",
                                "ปี": "2548"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเครื่องกล",
                                "สถาบัน": "สถาบันเทคโนโลยีพระจอมเกล้าพระนครเหนือ",
                                "ปี": "2538"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "23",
                        "เลขประจำตัวประชาชน": "3130200158xxx",
                        "ตำแหน่งทางวิชาการ": "อาจารย์",
                        "ชื่อ-สกุล": "พรระพีพัฒน์ ภาสบุตร",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "D.Eng.",
                                "สาขาวิชา": "Electrical Engineering",
                                "สถาบัน": "สถาบันเทคโนโลยีแห่งเอเชีย",
                                "ปี": "2550"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Electrical Engineering",
                                "สถาบัน": "สถาบันเทคโนโลยีแห่งเอเชีย",
                                "ปี": "2544"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "Electrical Engineering (Power Systems, Energy Management)",
                                "สถาบัน": "มหาวิทยาลัยธรรมศาสตร์",
                                "ปี": "2539"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 40,
        "details": [
            {
                "category": "การมีส่วนร่วมของคณาจารย์",
                "subcategories": {
                    "การวางแผน": "คณาจารย์ผู้รับผิดชอบหลักสูตรและผู้สอนมีการประชุมร่วมกันในการวางแผนจัดการเรียนการสอน",
                    "การติดตามและทบทวนหลักสูตร": "ประเมินผลและให้ความเห็นชอบการประเมินผลทุกรายวิชา เก็บรวบรวมข้อมูลเพื่อเตรียมไว้สำหรับการปรับปรุงหลักสูตร",
                    "การปรึกษาหารือ": "ปรึกษาหารือแนวทางที่จะทำให้บรรลุเป้าหมายตามหลักสูตร และได้บัณฑิตเป็นไปตามคุณลักษณะบัณฑิตที่พึงประสงค์"
                }
            },
            {
                "category": "การแต่งตั้งอาจารย์พิเศษ",
                "subcategories": {
                    "ความสำคัญ": "มีความสำคัญมาก เพราะจะเป็นผู้ถ่ายทอดประสบการณ์ตรงจากการปฏิบัติมาให้กับนักศึกษา",
                    "คุณสมบัติ": "ต้องเป็นผู้มีประสบการณ์ตรง หรือมีวุฒิการศึกษาอย่างต่ำปริญญาเอก และมีคุณสมบัติตามเกณฑ์มาตรฐานหลักสูตร ระดับบัณฑิตศึกษา พ.ศ. 2558"
                }
            },
            {
                "category": "หลักสูตร การเรียนการสอน การประเมินผู้เรียน",
                "subcategories": {
                    "การออกแบบหลักสูตร": "มีการออกแบบหลักสูตร ควบคุม กำกับการจัดทำรายวิชาต่างๆ ให้มีเนื้อหาที่ทันสมัย",
                    "การวางระบบผู้สอน": "มีการวางระบบผู้สอนและกระบวนการจัดการเรียนการสอน กำหนดคุณสมบัติผู้สอนในหลักสูตรปรัชญาดุษฎีบัณฑิต",
                    "การประเมินความพึงพอใจ": "มีการประเมินความพึงพอใจของหลักสูตรและการเรียนการสอน โดยผู้เรียนและผู้ที่สำเร็จการศึกษา",
                    "การจัดกิจกรรมการเรียนการสอน": "จัดกิจกรรมเพื่อส่งเสริมนักศึกษาให้มีวิสัยทัศน์กว้างไกล ได้รับความรู้ ทักษะและประสบการณ์ใหม่ๆ",
                    "การปรับปรุงหลักสูตร": "แต่งตั้งคณะกรรมการปรับปรุงหลักสูตร มีการปรับปรุงอย่างน้อยทุก 5 ปี โดยนำความคิดเห็นของผู้เกี่ยวข้องมาประกอบการพิจารณา"
                }
            },
            {
                "category": "เป้าหมายและการดำเนินการ",
                "subcategories": {
                    "พัฒนาหลักสูตรให้ทันสมัย": {
                        "การดำเนินการ": "จัดประชุม/สัมมนาหลักสูตรเป็นระยะ และมีการปรับปรุงหลักสูตรทุก 5 ปี",
                        "การประเมินผล": "ภาวะการได้งานทำของบัณฑิตที่สำเร็จการศึกษา, รายงานงานสัมมนาปรับปรุงหลักสูตร"
                    },
                    "ส่งเสริมนักศึกษาให้มีวิสัยทัศน์กว้างไกล": {
                        "การดำเนินการ": "เชิญอาจารย์ผู้เชี่ยวชาญเฉพาะสาขาจากสถาบันการศึกษาในต่างประเทศมาบรรยาย/สัมมนา/นำเสนอผลงานวิจัย",
                        "การประเมินผล": "จำนวนอาจารย์ต่างประเทศที่มาบรรยาย/ร่วมสัมมนา/นำเสนอผลงานวิจัย/Work Shop ฯลฯ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 54,
        "details": [
            {
                "category": "บทความวิจัยหรือบทความวิชาการ",
                "subcategories": {
                    "ระดับชาติ": {
                        "ค่าน้ำหนัก": 0.2,
                        "ผลงาน": [
                            {
                                "ผู้แต่ง": "Sirinutsomboon B.",
                                "ปี": 2019,
                                "ชื่อบทความ": "Electricity generation and growth of hydroponic Chinese kale in plant microbial fuel cell",
                                "ชื่อการประชุม": "The 6th International Conference on Engineering, Energy, and Environment (ICEEE2019)"
                            },
                            {
                                "ผู้แต่ง": "วนิดา โมกไธสงค์ และ บรรพต ศิริณัฏสมบูรณ์",
                                "ปี": 2564,
                                "ชื่อบทความ": "การวิเคราะห์พลังงานและผลกระทบต่อสิ่งแวดล้อมในกระบวนการสกัดสารต้านอนุมูลอิสระจากดอกทิวลิปด้วยตัวทำละลายและคลื่นไมโครเวฟร่วม",
                                "ชื่อการประชุม": "การประชุมวิชาการ IRD SSRU Conference (ครั้งที่ 9) สถาบันวิจัยและพัฒนา มหาวิทยาลัยราชภัฏสวนสุนันทา",
                                "วันที่": "11 มิ.ย.64"
                            }
                        ]
                    },
                    "ระดับนานาชาติหรือระดับชาติในฐานข้อมูล": {
                        "ค่าน้ำหนัก": 0.4,
                        "ผลงาน": [
                            {
                                "ผู้แต่ง": "Jirayu Insi and Veronica Winoto",
                                "ชื่อบทความ": "THE EFFECTS OF TEMPERATURE OF CO2 ADSORPTION IN MOF-177 AND MOF-199",
                                "ชื่อการประชุม": "The 27th PPC Symposium on Petroleum, Petrochemicals, and Polymers and The 12th Research Symposium on Petrochemical and Materials Technology (PPC & PETROMAT SYMPOSIUM 2020)"
                            }
                        ]
                    },
                    "ระดับนานาชาติในฐานข้อมูล Scopus": {
                        "ค่าน้ำหนัก": 1,
                        "ผลงาน": [
                            {
                                "ผู้แต่ง": "Winoto, V. and Keawsawasvong, S.",
                                "ปี": 2021,
                                "ชื่อบทความ": "Response Surface Methodology for Optimizing Stabilization of Clay Soils Using Bacterial Calcium Carbonate Precipitation",
                                "วารสาร": "Transportation Infrastructure Geotechnology",
                                "สถานะ": "Accepted"
                            },
                            {
                                "ผู้แต่ง": "Lertpocasombut, K., Sirimontree, S., Witchayangkoon, B., Thongchom, C., Winoto, V. and Keawsawasvong, S.",
                                "ปี": 2021,
                                "ชื่อบทความ": "The Renewable energy sources for municipal wastewater processes in Thailand: A case study of the Nonthaburi Wastewater Treatment Plant",
                                "วารสาร": "Civil and Environmental Engineering",
                                "สถานะ": "Accepted"
                            },
                            {
                                "ผู้แต่ง": "W. Pakdee, B. Yuvakanit, and A. K. Hussein",
                                "ปี": 2017,
                                "ชื่อบทความ": "Numerical Analysis on the Two-dimensional Unsteady Magnetohydrodynamic Compressible Flow through a Porous Medium",
                                "วารสาร": "Journal of Applied Fluid Mechanics",
                                "เล่มที่": 10,
                                "ฉบับที่": 4,
                                "หน้า": "1153-1159",
                                "วันที่": "March 8, 2017"
                            }
                        ]
                    }
                }
            },
            {
                "category": "อาจารย์",
                "subcategories": {
                    "อาจารย์ ดร.เวโรนิก้า วิโนโต้": {
                        "ตำแหน่ง": "อาจารย์",
                        "วุฒิการศึกษา": "ดร."
                    },
                    "รองศาสตราจารย์ ดร.วาทิต ภักดี": {
                        "ตำแหน่ง": "รองศาสตราจารย์",
                        "วุฒิการศึกษา": "ดร."
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 43,
        "details": [
            {
                "category": "การจัดการทรัพยากรการเรียนการสอน",
                "subcategories": {
                    "การจัดซื้อทรัพยากร": {
                        "เป้าหมาย": "จัดซื้อสิ่งพิมพ์ในรูปดิจิทัล หรือ Ebooks แทนการจัดซื้อหนังสือ/วารสาร หรือสิ่งพิมพ์ต่างๆ",
                        "การประเมินผล": [
                            "สถิติของจำนวนหนังสือ/ตำรา และสื่อดิจิทัลที่มีให้บริการ",
                            "สถิติการใช้งานหนังสือ/ตำรา สื่อดิจิทัล"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 27,
        "details": [
            {
                "category": "คุณธรรมและจริยธรรม",
                "subcategories": {
                    "การวัดมาตรฐาน": "อาจารย์ที่สอนต้องจัดให้มีการวัดมาตรฐานในด้านคุณธรรม จริยธรรมทุกภาคการศึกษา ซึ่งไม่จำเป็นต้องเป็นข้อสอบ อาจใช้การสังเกตพฤติกรรมระหว่างทำกิจกรรมที่กำหนด",
                    "กลยุทธ์การสอน": "กำหนดให้มีวัฒนธรรมองค์กร เพื่อปลูกฝังระเบียบวินัย, เน้นการเข้าชั้นเรียนตรงเวลา, การแต่งกายสุภาพ, ฝึกความรับผิดชอบในการทำงานกลุ่ม, ส่งเสริมความซื่อสัตย์, อบรมจรรยาบรรณในการทำวิจัย, สอดแทรกเรื่องคุณธรรม จริยธรรมในทุกรายวิชา",
                    "กลยุทธ์การประเมินผล": {
                        "1": "ประเมินจากการตรงเวลาในการเข้าชั้นเรียนและส่งงาน",
                        "2": "ประเมินจากการเขียนวิทยานิพนธ์ที่มีการอ้างอิงถูกต้อง",
                        "3": "ประเมินจากความรับผิดชอบในหน้าที่ที่ได้รับมอบหมาย",
                        "4": "ประเมินจากความรับผิดชอบในการทำงานวิจัยและการรายงานผลที่ถูกต้อง"
                    }
                }
            },
            {
                "category": "ความรู้",
                "subcategories": {
                    "ผลการเรียนรู้ด้านความรู้": {
                        "1": "มีความรู้และความเข้าใจเกี่ยวกับหลักการและทฤษฎีที่สำคัญในสาขาวิชาชีพ",
                        "2": "สามารถวิเคราะห์ปัญหา และประยุกต์ความรู้ ทักษะ และการใช้เครื่องมือที่เหมาะสม",
                        "3": "สามารถวิเคราะห์ ออกแบบ ติดตั้ง ปรับปรุงระบบ ตามข้อกำหนดของวิชาชีพ",
                        "4": "สามารถติดตามความก้าวหน้าทางวิชาการและประยุกต์ใช้",
                        "5": "รู้ เข้าใจและสนใจพัฒนาความรู้ ความชำนาญทางวิชาชีพอย่างต่อเนื่อง",
                        "6": "มีความรู้ในแนวกว้างของสาขาวิชา เข้าใจการเปลี่ยนแปลงและผลกระทบของเทคโนโลยีใหม่"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 10,
        "details": [
            {
                "category": "คุณสมบัติของผู้เข้าศึกษา",
                "subcategories": {
                    "ผลงานทางวิชาการ": "บทความในวารสารทางวิชาการ หรือ บทความในที่ประชุมวิชาการที่มีคณะกรรมการกลั่นกรองในระดับชาติ หรือ ระดับนานาชาติ",
                    "ผลทดสอบภาษาอังกฤษ": {
                        "TU-GET Paper-based": "ไม่ต่ำกว่า 500 คะแนน",
                        "TOEFL Paper-based": "ไม่ต่ำกว่า 500 คะแนน",
                        "TOEFL Internet-based": "ไม่ต่ำกว่า 61 คะแนน",
                        "IELTS": "ไม่ต่ำกว่าระดับ 6.0",
                        "อายุผลสอบ": "ไม่เกิน 2 ปี นับถึงวันสมัคร"
                    }
                }
            },
            {
                "category": "การคัดเลือกผู้เข้าศึกษา",
                "subcategories": {
                    "วิธีการคัดเลือก": [
                        "ผ่านการสอบข้อเขียน",
                        "ผ่านการสอบสัมภาษณ์"
                    ],
                    "เงื่อนไขอื่นๆ": "ให้เป็นไปตามประกาศรับสมัครบุคคลเข้าศึกษาในระดับบัณฑิตศึกษา ของมหาวิทยาลัยธรรมศาสตร์"
                }
            },
            {
                "category": "ปัญหาของนักศึกษาแรกเข้า",
                "subcategories": {
                    "ทักษะการวิจัย": "นักศึกษาขาดทักษะในการทำวิจัย",
                    "ทักษะภาษาอังกฤษ": "นักศึกษาขาดทักษะการใช้ภาษาอังกฤษเพื่อเขียนและอภิปรายผลการวิจัย"
                }
            },
            {
                "category": "กลยุทธ์ในการดำเนินการเพื่อแก้ไขปัญหา",
                "subcategories": {
                    "การกำหนดเกณฑ์": "กำหนดหลักเกณฑ์การผ่านภาษาอังกฤษแรกเข้า",
                    "การเรียนการสอน": "ให้นักศึกษาศึกษาวิชา กพ. 891 ระเบียบวิธีวิจัยขั้นสูง เพื่อฝึกทักษะการสื่อสารเชิงเทคนิค ทั้งด้านการอ่าน เขียน นำเสนอ และอภิปราย"
                }
            },
            {
                "category": "แผนการรับนักศึกษาและผู้สำเร็จการศึกษาในระยะ 5 ปี",
                "subcategories": {
                    "จำนวนรับต่อปี": "3 คน",
                    "จำนวนนักศึกษาแต่ละปีการศึกษา": {
                        "2565": {
                            "ชั้นปีที่ 1": 3,
                            "รวม": 3
                        },
                        "2566": {
                            "ชั้นปีที่ 1": 3,
                            "ชั้นปีที่ 2": 3,
                            "รวม": 6
                        },
                        "2567": {
                            "ชั้นปีที่ 1": 3,
                            "ชั้นปีที่ 2": 3,
                            "ชั้นปีที่ 3": 3,
                            "รวม": 9,
                            "คาดว่าจะจบการศึกษา": 1
                        },
                        "2568": {
                            "ชั้นปีที่ 1": 3,
                            "ชั้นปีที่ 2": 3,
                            "ชั้นปีที่ 3": 3,
                            "รวม": 9,
                            "คาดว่าจะจบการศึกษา": 2
                        },
                        "2569": {
                            "ชั้นปีที่ 1": 3,
                            "ชั้นปีที่ 2": 3,
                            "ชั้นปีที่ 3": 3,
                            "รวม": 9,
                            "คาดว่าจะจบการศึกษา": 3
                        }
                    }
                }
            },
            {
                "category": "งบประมาณตามแผน",
                "subcategories": {
                    "งบดำเนินการ": "200,000 บาท",
                    "หมวดค่าตอบแทน": "110,000 บาท",
                    "หมวดค่าใช้สอย": "40,000 บาท",
                    "หมวดวัสดุ": "25,000 บาท"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 14,
        "details": [
            {
                "category": "Seminar Courses",
                "subcategories": {
                    "EM_892_Seminar_1": {
                        "course_code": "กพ. 892",
                        "course_name": "สัมมนา 1",
                        "credits": "1 (0-2-2)",
                        "description": "การนำเสนอและอภิปรายหัวข้อที่น่าสนใจด้านเทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อมในระดับปริญญาเอก",
                        "evaluation": "โดยมีการวัดผลเป็น 2 ระดับ คือ ระดับผ่าน (P) และไม่ผ่าน (N)",
                        "english_description": "Oral presentation and advanced discussion of interesting topics relevant to energy and environmental technology management for Ph.D. candidates.",
                        "english_evaluation": "The evaluation of this course will be in 2 levels, Pass (P) and Not pass (N)"
                    },
                    "EM_893_Seminar_2": {
                        "course_code": "กพ. 893",
                        "course_name": "สัมมนา 2",
                        "credits": "1 (0-2-2)",
                        "description": "การนำเสนอและอภิปรายหัวข้อที่น่าสนใจด้านเทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อมในระดับปริญญาเอก",
                        "evaluation": "โดยมีการวัดผลเป็น 2 ระดับ คือ ระดับผ่าน (P) และไม่ผ่าน (N)",
                        "english_description": "Oral presentation and advanced discussion of interesting topics relevant to energy and environmental technology management for Ph.D. candidates.",
                        "english_evaluation": "The evaluation of this course will be in 2 levels, Pass (P) and Not pass (N)"
                    },
                    "EM_894_Seminar_3": {
                        "course_code": "กพ. 894",
                        "course_name": "สัมมนา 3",
                        "credits": "1 (0-2-2)",
                        "description": "การนำเสนอและอภิปรายหัวข้อที่น่าสนใจด้านเทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อมในระดับปริญญาเอก",
                        "evaluation": "โดยมีการวัดผลเป็น 2 ระดับ คือ ระดับผ่าน (P) และไม่ผ่าน (N)",
                        "english_description": "Oral presentation and advanced discussion of interesting topics relevant to energy and environmental technology management for Ph.D. candidates.",
                        "english_evaluation": "The evaluation of this course will be in 2 levels, Pass (P) and Not pass (N)"
                    }
                }
            },
            {
                "category": "Dissertation",
                "subcategories": {
                    "EM_901_Dissertation": {
                        "course_code": "กพ. 901",
                        "course_name": "วิทยานิพนธ์",
                        "credits": "48 หน่วยกิต",
                        "description": "การสร้างโครงการวิจัย และการดำเนินการวิจัย โดยเนื้อหาของงานวิจัยเกี่ยวข้องกับหัวข้อหรือปัญหาทางด้านเทคโนโลยีการจัดการพลังงานและ และ/หรือสิ่งแวดล้อม",
                        "requirements": [
                            "การทำวิจัยจะต้องก่อให้เกิดองค์ความรู้ใหม่ในสาขาวิชาดังกล่าว",
                            "เป็นการดำเนินงานภายใต้การแนะนำของอาจารย์ที่ปรึกษา ซึ่งเป็นอาจารย์ประจำของคณะวิศวกรรมศาสตร์",
                            "ผู้ทำการวิจัยจะต้องเสนอผลงานวิจัยนี้อย่างเป็นทางการโดยเปิดโอกาสให้ผู้สนใจเข้าฟัง",
                            "มีการเขียนรายงานการวิจัยเพื่อเผยแพร่",
                            "มีจริยธรรมในการทำวิจัย และจริยธรรมในการเผยแพร่ผลงานทางวิชาการ",
                            "การจัดทำผลงานวิจัยเป็นรูปเล่ม"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 5,
        "details": [
            {
                "category": "สถานการณ์ภายนอกหรือการพัฒนาที่จำเป็นต้องนำมาพิจารณาในการวางแผนหลักสูตร",
                "subcategories": {
                    "สถานการณ์หรือการพัฒนาทางเศรษฐกิจ": {
                        "แผนพัฒนาเศรษฐกิจและสังคมแห่งชาติ": "ฉบับที่ 13 (พ.ศ. 2566-2570)",
                        "ประเด็นสำคัญ": [
                            "การพัฒนาเทคโนโลยีและนวัตกรรม",
                            "การสร้างโอกาสและลดความเสี่ยงจากเทคโนโลยี",
                            "การลดผลกระทบด้านสิ่งแวดล้อม",
                            "การเปลี่ยนแปลงสภาพภูมิอากาศ"
                        ],
                        "แนวทางการพัฒนาประเทศ": [
                            "เศรษฐกิจสร้างคุณค่าที่เป็นมิตรต่อสิ่งแวดล้อม",
                            "การเพิ่มประสิทธิภาพของการผลิตในภาคการเกษตร",
                            "การท่องเที่ยวเน้นคุณค่าและความยั่งยืน",
                            "การพัฒนายานยนต์ไฟฟ้า",
                            "การมุ่งสู่เศรษฐกิจหมุนเวียนและสังคมคาร์บอนต่ำ"
                        ],
                        "สถานการณ์ปัจจุบัน": [
                            "ความต้องการพลังงานเพิ่มขึ้น",
                            "ปัญหาสิ่งแวดล้อมเพิ่มสูงขึ้น",
                            "การปล่อยก๊าซเรือนกระจกเพิ่มขึ้น"
                        ]
                    },
                    "สถานการณ์หรือการพัฒนาทางสังคมและวัฒนธรรม": {
                        "เป้าหมายการพัฒนา": [
                            "การสร้างวัฒนธรรมการเรียนรู้",
                            "การปรับใช้ให้เข้ากับการเปลี่ยนแปลงด้านสังคมยุคพัฒนาอุตสาหกรรมและเทคโนโลยี",
                            "การสร้างโอกาสและลดความเสี่ยงจากเทคโนโลยี",
                            "การพัฒนาอย่างเท่าทัน"
                        ],
                        "การผลิตบัณฑิต": [
                            "มุ่งเน้นการสร้างวัฒนธรรมด้านการวิเคราะห์อย่างมีเหตุผล",
                            "ผลิตปรัชญาดุษฎีบัณฑิตที่มีความเป็นมืออาชีพ",
                            "มีความเข้าใจในผลกระทบทางสังคมและวัฒนธรรม",
                            "มีคุณธรรม จริยธรรม"
                        ]
                    }
                }
            },
            {
                "category": "ผลกระทบต่อการพัฒนาหลักสูตรและความเกี่ยวข้องกับพันธกิจของสถาบัน",
                "subcategories": {
                    "การพัฒนาหลักสูตร": {
                        "ประเด็นสำคัญ": [
                            "การสร้างโอกาสและลดความเสี่ยงจากเทคโนโลยี",
                            "การรับมือกับ Technological Disruption",
                            "การพัฒนาด้านการผลิตที่แสวงหาเทคโนโลยีและนวัตกรรม",
                            "การคำนึงถึงสังคมสูงวัย",
                            "การลดผลกระทบด้านสิ่งแวดล้อม"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 33,
        "details": [
            {
                "category": "แผนที่แสดงการกระจายความรับผิดชอบมาตรฐานผลการเรียนรู้จากหลักสูตรสู่รายวิชา (Curriculum Mapping)",
                "subcategories": {
                    "ความรับผิดชอบหลัก": "⚫",
                    "ความรับผิดชอบรอง": ""
                }
            },
            {
                "category": "มาตรฐานผลการเรียนรู้",
                "subcategories": {
                    "1_คุณธรรม_จริยธรรม": {
                        "จำนวนข้อย่อย": 6
                    },
                    "2_ความรู้": {
                        "จำนวนข้อย่อย": 6
                    },
                    "3_ทักษะทางปัญญา": {
                        "จำนวนข้อย่อย": 4
                    },
                    "4_ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": {
                        "จำนวนข้อย่อย": 5
                    },
                    "5_ทักษะการวิเคราะห์เชิงตัวเลข_การสื่อสาร_และเทคโนโลยีสารสนเทศ": {
                        "จำนวนข้อย่อย": 4
                    }
                }
            },
            {
                "category": "รายวิชา",
                "subcategories": {
                    "กพ.891_ระเบียบวิธีวิจัยขั้นสูง": {
                        "1_คุณธรรม_จริยธรรม": [
                            1,
                            0,
                            1,
                            0,
                            0,
                            0
                        ],
                        "2_ความรู้": [
                            0,
                            0,
                            0,
                            0,
                            0,
                            1
                        ],
                        "3_ทักษะทางปัญญา": [
                            1,
                            1,
                            1,
                            1
                        ],
                        "4_ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": [
                            0,
                            0,
                            0,
                            0,
                            1
                        ],
                        "5_ทักษะการวิเคราะห์เชิงตัวเลข_การสื่อสาร_และเทคโนโลยีสารสนเทศ": [
                            0,
                            0,
                            1,
                            1
                        ]
                    },
                    "กพ.892_สัมมนา_1": {
                        "1_คุณธรรม_จริยธรรม": [
                            1,
                            0,
                            1,
                            0,
                            0,
                            0
                        ],
                        "2_ความรู้": [
                            1,
                            1,
                            0,
                            0,
                            0,
                            1
                        ],
                        "3_ทักษะทางปัญญา": [
                            1,
                            1,
                            1,
                            1
                        ],
                        "4_ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": [
                            0,
                            0,
                            0,
                            0,
                            1
                        ],
                        "5_ทักษะการวิเคราะห์เชิงตัวเลข_การสื่อสาร_และเทคโนโลยีสารสนเทศ": [
                            0,
                            0,
                            1,
                            1
                        ]
                    },
                    "กพ.893_สัมมนา_2": {
                        "1_คุณธรรม_จริยธรรม": [
                            1,
                            0,
                            1,
                            0,
                            0,
                            0
                        ],
                        "2_ความรู้": [
                            1,
                            1,
                            0,
                            0,
                            0,
                            1
                        ],
                        "3_ทักษะทางปัญญา": [
                            1,
                            1,
                            1,
                            1
                        ],
                        "4_ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": [
                            0,
                            0,
                            0,
                            0,
                            1
                        ],
                        "5_ทักษะการวิเคราะห์เชิงตัวเลข_การสื่อสาร_และเทคโนโลยีสารสนเทศ": [
                            0,
                            0,
                            1,
                            1
                        ]
                    },
                    "กพ.894_สัมมนา_3": {
                        "1_คุณธรรม_จริยธรรม": [
                            1,
                            0,
                            1,
                            0,
                            0,
                            0
                        ],
                        "2_ความรู้": [
                            1,
                            1,
                            0,
                            0,
                            0,
                            1
                        ],
                        "3_ทักษะทางปัญญา": [
                            1,
                            1,
                            1,
                            1
                        ],
                        "4_ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": [
                            0,
                            0,
                            0,
                            0,
                            1
                        ],
                        "5_ทักษะการวิเคราะห์เชิงตัวเลข_การสื่อสาร_และเทคโนโลยีสารสนเทศ": [
                            0,
                            0,
                            1,
                            1
                        ]
                    },
                    "กพ.900_วิทยานิพนธ์": {
                        "1_คุณธรรม_จริยธรรม": [
                            1,
                            1,
                            1,
                            1,
                            1,
                            1
                        ],
                        "2_ความรู้": [
                            1,
                            1,
                            1,
                            1,
                            1,
                            1
                        ],
                        "3_ทักษะทางปัญญา": [
                            1,
                            1,
                            1,
                            1
                        ],
                        "4_ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": [
                            1,
                            1,
                            1,
                            1,
                            1
                        ],
                        "5_ทักษะการวิเคราะห์เชิงตัวเลข_การสื่อสาร_และเทคโนโลยีสารสนเทศ": [
                            0,
                            1,
                            1,
                            1
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 48,
        "details": [
            {
                "category": "รายละเอียดอาจารย์",
                "subcategories": {
                    "ชื่อ": "รองศาสตราจารย์ ดร.วรณี มังคละศิริ",
                    "ผลงานทางวิชาการ": {
                        "บทความวิจัยระดับนานาชาติ": [
                            {
                                "ชื่อบทความ": "Optimization of Bioethanol Production from Raw Sugar in Thailand",
                                "ผู้เขียน": "W. Mungkalasiri, B. Pan-in, J. Mungkalasiri",
                                "วารสาร": "Science & Technology Asia, Thammasat University",
                                "ปีที่พิมพ์": "2018",
                                "รายละเอียด": "Vol.23, No.1 (January-March 2018), PP 57-66",
                                "คะแนน": 1
                            }
                        ],
                        "บทความวิจัยระดับชาติ": [
                            {
                                "ชื่อบทความ": "การเพิ่มประสิทธิภาพการผลิตไฟฟ้าโดยการปรับปรุงชุดกรองอากาศขาเข้า",
                                "ผู้เขียน": "วรณี แพ่งจันทึก, จิตติ มังคละศิริ, อำนวย มณีทะ",
                                "วารสาร": "วารสารวิทยาศาสตร์และเทคโนโลยี",
                                "ปีที่พิมพ์": "2561",
                                "รายละเอียด": "ปีที่ 26 ฉบับที่ 6 พฤศจิกายน-ธันวาคม",
                                "คะแนน": 0.8
                            },
                            {
                                "ชื่อบทความ": "การจำลองกระบวนการผลิตไฟฟ้าคาร์บอนต่ำด้วยระบบเซลล์ออกไซด์แข็งที่ผันกลับได้",
                                "ผู้เขียน": "ฐิติมาภรณ์ คำภีระ, อภิชญา เกษสุวรรณ, วรณี มังคละศิริ, จิตติ มังคละศิริ",
                                "วารสาร": "วารสารวิทยาศาสตร์และเทคโนโลยี",
                                "ปีที่พิมพ์": "2563",
                                "รายละเอียด": "ปีที่ 28 ฉบับที่ 11 พฤศจิกายน",
                                "คะแนน": 0.8
                            }
                        ]
                    }
                }
            },
            {
                "category": "รายละเอียดอาจารย์",
                "subcategories": {
                    "ชื่อ": "รองศาสตราจารย์ ดร.แคทลียา ปัทมพรหม",
                    "ผลงานทางวิชาการ": {
                        "บทความวิจัยระดับนานาชาติ": [
                            {
                                "ชื่อบทความ": "Comparative performance of functional rubbers on toughness and thermal property improvement of polylactic acid",
                                "ผู้เขียน": "Phattarateerai, S., Pattamaprom, C.",
                                "วารสาร": "Materials Today Communications",
                                "ปีที่พิมพ์": "2019",
                                "รายละเอียด": "Volume 19, June 2019, Pages 374-382",
                                "คะแนน": 1
                            },
                            {
                                "ชื่อบทความ": "Alternative Methods for Accelerating Mechanical Stability of Concentrated Natural Rubber Latex",
                                "ผู้เขียน": "Pimalai, D., Wongngam, Y. & Pattamaprom, C.",
                                "วารสาร": "Defect and Diffusion Forum",
                                "ปีที่พิมพ์": "2018",
                                "รายละเอียด": "Vol. 382, 10-Jan-2018, 26-30",
                                "คะแนน": 1
                            },
                            {
                                "ชื่อบทความ": "Synthesis and Characterization of Poly (Lactic Acid) - Grafted Natural Rubber by Reactive Melt-Blending Technique",
                                "ผู้เขียน": "Wongngam, Y., Pattamaprom, C.",
                                "วารสาร": "Defect and Diffusion Forum",
                                "ปีที่พิมพ์": "2018",
                                "รายละเอียด": "Vol. 382, 10-Jan-2018, 7-11",
                                "คะแนน": 1
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 1,
        "details": [
            {
                "category": "หลักสูตร",
                "subcategories": {
                    "ชื่อหลักสูตร": "หลักสูตรปรัชญาดุษฎีบัณฑิต",
                    "สาขาวิชา": "เทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อม",
                    "ประเภทหลักสูตร": "หลักสูตรนานาชาติ",
                    "สถานะหลักสูตร": "หลักสูตรปรับปรุง พ.ศ. 2565"
                }
            },
            {
                "category": "หน่วยงานที่รับผิดชอบ",
                "subcategories": {
                    "คณะ": "คณะวิศวกรรมศาสตร์",
                    "มหาวิทยาลัย": "มหาวิทยาลัยธรรมศาสตร์"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 47,
        "details": [
            {
                "category": "ภาคผนวก",
                "subcategories": {
                    "ภาคผนวก_1": "ผลงานทางวิชาการ (ย้อนหลัง 5 ปี) ของอาจารย์ผู้รับผิดชอบหลักสูตรและอาจารย์ประจำหลักสูตร"
                }
            },
            {
                "category": "รองศาสตราจารย์ ดร.หาญพล พึ่งรัศมี",
                "subcategories": {
                    "งานสร้างสรรค์ที่ได้รับการเผยแพร่ในระดับนานาชาติ": [
                        "Phairat Usubharatana and Harnpon Phungrassami, Environmental impact assessment of Thai minced fish paste (surimi)using life cycle assessment methodology, Environmental Research, Engineering and Management, 2020, 76(3), 137-153.",
                        "Harnpon Phungrassami, Phairat Usubharatana. (2019). Fossil Fuel Carbon Taxation Policy Effect on Thai Household Expenditure Using Input–Output Price Structural Path Model. Environmental Progress & Sustainable Energy, 03 March 2019, 1-13.",
                        "Phairat Usubharatana, Harnpon Phungrassami. (2019). LIFE CYCLE ASSESSMENT OF BIO-BASED THERMAL INSULATION MATERIALS FORMED BY DIFFERENT METHODS. Environmental Engineering and Management Journal, July 2019, Vol. 18, No. 7, 1471-1486"
                    ]
                }
            },
            {
                "category": "รองศาสตราจารย์ ดร. สาธก ไชยกุลชื่นสกุล",
                "subcategories": {
                    "บทความวิจัยหรือบทความวิชาการที่ตีพิมพ์ในวารสารวิชาการระดับนานาชาติ": [
                        "S. Chaikunchuensakun, \"The Mattedi-Tavares-Castier Equation of State using the Surface Charge Density (COSMO)\" ICEEE5 2017, 1-3 November 2017 Thammasat University, Rangsit Campus."
                    ],
                    "บทความวิจัยหรือบทความวิชาการฉบับสมบูรณ์ที่ตีพิมพ์ในรายงานสืบเนื่องจากการประชุมวิชาการระดับนานาชาติหรือในวารสารวิชาการระดับชาติ": [
                        "สาธก ไชยกุลชื่นสกุล, ภาณุรุจ อัศวเลิศพลากร, ศศิพงษ์ สมศรี. (2561). การเขียนโปรแกรมทำนายค่าความดันไอของสารอินทรีย์ประเภทนอนอิเล็กโตรไลต์โดยวิธี Group contribution. การประชุมวิชาการและนำเสนอผลงานทางวิศวกรรมและการจัดการอุตสาหกรรมอย่างยั่งยืน ครั้งที่ 7, 28 กันยายน 2561, ณ ศูนย์นิทรรศการและการประชุมไบเทค บางนา กทม, 89-94.",
                        "สาธก ไชยกุลชื่นสกุล, กรรณิการ์ กรมถิน. การคำนวณจุดเดือดของสารประกอบระเบิดด้วยวิธี Group Contribution. การประชุมวิชาการและนำเสนอผลงานวิจัยระดับชาติ ครั้งที่ 15, ประจำปี 2562, ณ มหาวิทยาลัยเวสเทิร์น ปทุมธานี"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 62,
        "details": [
            {
                "category": "การสอบวัดคุณสมบัติ",
                "subcategories": {
                    "เงื่อนไขการสอบ": "นักศึกษาต้องสอบวัดคุณสมบัติให้ได้ระดับ P (ผ่าน) ภายใน 3 ครั้ง",
                    "ผลกระทบหากไม่ผ่าน": "มิฉะนั้นจะถูกถอนชื่อออกจากทะเบียนนักศึกษา",
                    "ข้อกำหนดเพิ่มเติม": "ต้องสอบผ่านก่อนขอสอบวิทยานิพนธ์ไม่น้อยกว่า 2 เดือน"
                }
            },
            {
                "category": "การทำวิทยานิพนธ์",
                "subcategories": {
                    "การจดทะเบียน": "นักศึกษาสามารถจดทะเบียนวิทยานิพนธ์ได้ตั้งแต่ภาคการศึกษาแรกที่เข้าศึกษา",
                    "ภาษาที่ใช้": "นักศึกษาต้องทำวิทยานิพนธ์เป็นภาษาอังกฤษ",
                    "ขั้นตอนหลังจดทะเบียน": "หลังจากจดทะเบียนทำวิทยานิพนธ์และสอบวัดคุณสมบัติผ่านแล้ว นักศึกษาต้องเสนอเค้าโครงวิทยานิพนธ์ต่อคณะวิศวกรรมศาสตร์",
                    "การแต่งตั้งอาจารย์ที่ปรึกษา": "ยื่นเรื่องให้คณบดีคณะวิศวกรรมศาสตร์แต่งตั้งอาจารย์ที่ปรึกษาวิทยานิพนธ์และคณะกรรมการสอบวิทยานิพนธ์"
                }
            },
            {
                "category": "คณะกรรมการสอบวิทยานิพนธ์",
                "subcategories": {
                    "องค์ประกอบ": "ประกอบด้วยอาจารย์ที่ปรึกษาวิทยานิพนธ์ อาจารย์ประจำหลักสูตร และผู้ทรงคุณวุฒิภายนอกสถาบัน",
                    "จำนวนกรรมการ": "รวมไม่น้อยกว่า 5 คน",
                    "ประธานกรรมการ": "ประธานกรรมการสอบต้องเป็นผู้ทรงคุณวุฒิภายนอก"
                }
            },
            {
                "category": "คุณสมบัติอาจารย์ผู้สอบวิทยานิพนธ์",
                "subcategories": {
                    "อาจารย์ประจำหลักสูตร": "ต้องมีคุณวุฒิปริญญาเอกหรือเทียบเท่า หรือขั้นต่ำปริญญาโทหรือเทียบเท่าที่มีตำแหน่งรองศาสตราจารย์ และมีผลงานทางวิชาการที่ไม่ใช่ส่วนหนึ่งของการศึกษาเพื่อรับปริญญา"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 22,
        "details": [
            {
                "category": "องค์ประกอบเกี่ยวกับประสบการณ์ภาคสนาม",
                "subcategories": {
                    "การฝึกงาน_หรือการฝึกปฏิบัติ": "ไม่มี"
                }
            },
            {
                "category": "ข้อกำหนดเกี่ยวกับการทำวิทยานิพนธ์",
                "subcategories": {
                    "คำอธิบายโดยย่อ": "การสร้างโครงการวิจัยหรือการวิจัยเชิงปฏิบัติการในสาขาวิชาเทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อม เขียนและนำเสนอวิทยานิพนธ์ การเขียนรายงานวิจัยเพื่อเผยแพร่ และจริยธรรมในการทำวิจัยและในการเผยแพร่ผลงานทางวิชาการ ภายใต้การดูแลปรึกษาของอาจารย์ผู้ควบคุม",
                    "มาตรฐานผลการเรียนรู้": "นักศึกษามีทักษะในการดำเนินการวิจัย วิเคราะห์ และแก้ไขปัญหาที่เกิดขึ้นในกระบวนการดังกล่าว ทั้งนี้นักศึกษาสามารถทำตามข้อบังคับที่กำหนดในหลักสูตร โดยผลงานวิทยานิพนธ์หรือส่วนหนึ่งของวิทยานิพนธ์จะต้องได้รับการตีพิมพ์ หรืออย่างน้อยได้รับการยอมรับให้ตีพิมพ์ ในวารสารระดับนานาชาติที่มีคุณภาพตามประกาศ คณะกรรมการการอุดมศึกษา เรื่อง หลักเกณฑ์การพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ ผลงานทางวิชาการ อย่างน้อย 2 เรื่อง",
                    "ช่วงเวลา": "นักศึกษาสามารถจดทะเบียนวิทยานิพนธ์ได้ ตั้งแต่ภาคการศึกษาปกติของปีการศึกษาที่ 1 จนกระทั่งงานวิจัยเสร็จสมบูรณ์ แต่ไม่เกินระยะเวลาการศึกษารวม 12 ภาคการศึกษาปกติ",
                    "จำนวนหน่วยกิต": "48 หน่วยกิต",
                    "ข้อกำหนดการสอบวัดคุณสมบัติ_การทำวิทยานิพนธ์_และการสอบวิทยานิพนธ์": {
                        "การสอบวัดคุณสมบัติ": [
                            "นักศึกษามีสิทธิขอสอบวัดคุณสมบัติได้เมื่อจดทะเบียนรายวิชามาแล้วไม่น้อยกว่า 1 ภาคการศึกษา",
                            "การสอบวัดคุณสมบัติประกอบด้วยการสอบข้อเขียนและสอบปากเปล่า ดำเนินการโดยคณะกรรมการสอบวัดคุณสมบัติที่แต่งตั้งโดยคณบดีคณะวิศวกรรมศาสตร์ ซึ่งประกอบด้วยอาจารย์ประจำหลักสูตรหรือผู้ทรงคุณวุฒิภายนอกที่มีคุณสมบัติเป็นไปตามเกณฑ์อาจารย์ผู้สอบวิทยานิพนธ์ อย่างน้อย 3 ท่าน นักศึกษาต้องสอบวัดคุณสมบัติให้ได้ระดับ P (ผ่าน) ภายใน 3 ครั้ง มิฉะนั้นจะถูกถอนชื่อออกจากทะเบียนนักศึกษา ทั้งนี้เงื่อนไขอื่น ๆ ให้เป็นไปตามข้อบังคับของมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาระดับบัณฑิตศึกษา พ.ศ.2561"
                        ],
                        "การทำวิทยานิพนธ์": [
                            "นักศึกษาสามารถจดทะเบียนวิทยานิพนธ์ได้ตั้งแต่ภาคการศึกษาแรกที่เข้าศึกษา",
                            "นักศึกษาต้องสอบวัดคุณสมบัติให้ผ่านก่อนการสอบเค้าโครงวิทยานิพนธ์"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 20,
        "details": [
            {
                "category": "อาจารย์ประจำหลักสูตร",
                "subcategories": [
                    {
                        "ลำดับที่": "16",
                        "เลขประจำตัวประชาชน": "3909900753xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "ภณิดา ซ้ายขวัญ",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Cambridge, UK",
                                "ปี": "2549"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Cambridge, UK",
                                "ปี": "2547"
                            },
                            {
                                "ระดับ": "B.Eng.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Cambridge, UK",
                                "ปี": "2545"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "17",
                        "เลขประจำตัวประชาชน": "3101400826xxx",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "ชื่อ-สกุล": "วรรัตน์ ปัตรประกร",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "D.Eng.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "Tokyo Institute of Technology, Japan",
                                "ปี": "2548"
                            },
                            {
                                "ระดับ": "วศ.ม.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2539"
                            },
                            {
                                "ระดับ": "วท.บ.",
                                "สาขาวิชา": "เคมีวิศวกรรม/เคมีเทคนิค",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2537"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "18",
                        "เลขประจำตัวประชาชน": "3100502911xxx",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "ชื่อ-สกุล": "นางสุพิชชา รุ่งโรจน์นิมิตชัย",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Material and Life Science Engineering",
                                "สถาบัน": "Osaka University, Japan",
                                "ปี": "2546"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Material and Life Science",
                                "สถาบัน": "Osaka University, Japan",
                                "ปี": "2544"
                            },
                            {
                                "ระดับ": "B.Eng.",
                                "สาขาวิชา": "Applied Chemistry",
                                "สถาบัน": "Osaka University, Japan",
                                "ปี": "2542"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "19",
                        "เลขประจำตัวประชาชน": "3100501086xxx",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "ชื่อ-สกุล": "นายบรรพต ศิริณัฐสมบูรณ์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Biological Systems Engineering",
                                "สถาบัน": "University of California-Davis, U.S.A.",
                                "ปี": "2554"
                            },
                            {
                                "ระดับ": "B.S.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Michigan – Ann Arbor, U.S.A.",
                                "ปี": "2548"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 16,
        "details": [
            {
                "category": "อาจารย์ประจำหลักสูตร",
                "subcategories": [
                    {
                        "ลำดับ": "1",
                        "เลขประจำตัวประชาชน": "3909800880xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "หาญพล พึ่งรัศมี",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Environmental Engineering",
                                "สถาบัน": "Ajou University, Korea",
                                "ปี": "2550"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Environmental Technology and Management",
                                "สถาบัน": "สถาบันเทคโนโลยีแห่งเอเชีย",
                                "ปี": "2544"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "มหาวิทยาลัยธรรมศาสตร์",
                                "ปี": "2540"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "2",
                        "เลขประจำตัวประชาชน": "3100900248xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "สาธก ไชยกุลชื่นสกุล",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "Polytechnic University, USA",
                                "ปี": "2543"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "Stevens Institute of Technology, USA",
                                "ปี": "2537"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2537"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "3",
                        "เลขประจำตัวประชาชน": "3302000235xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "วรณี มังคละศิริ",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "วศ.ด.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2551",
                                "หมายเหตุ": "(หลักสูตรปริญญาโทควบเอก)"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "มหาวิทยาลัยขอนแก่น",
                                "ปี": "2547"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 18,
        "details": [
            {
                "category": "อาจารย์ประจำหลักสูตร",
                "subcategories": [
                    {
                        "ลำดับที่": "8",
                        "เลขประจำตัวประชาชน": "3120100583xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "มาลี สันติคุณาภรณ์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "The University of Oklahoma, USA",
                                "ปี": "2544"
                            },
                            {
                                "ระดับ": "วท.ม.",
                                "สาขาวิชา": "เทคโนโลยีปิโตรเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2541"
                            },
                            {
                                "ระดับ": "วท.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2539"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "9",
                        "เลขประจำตัวประชาชน": "3100900248xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "สาธก ไชยกุลชื่นสกุล",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "Polytechnic University, USA",
                                "ปี": "2543"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "Stevens Institute of Technology, USA",
                                "ปี": "2537"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2535"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "10",
                        "เลขประจำตัวประชาชน": "3100100768xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "ภาณุ ด่านวานิชกุล",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Pennsylvania, U.S.A.",
                                "ปี": "2546"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Delaware, U.S.A.",
                                "ปี": "2541"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2537"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "11",
                        "เลขประจำตัวประชาชน": "3302000235xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "วรณี มังคละศิริ",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "วศ.ด.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2551",
                                "หมายเหตุ": "(หลักสูตรปริญญาโทควบเอก)"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "มหาวิทยาลัยขอนแก่น",
                                "ปี": "2547"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 2,
        "details": [
            {
                "category": "รายละเอียดของหลักสูตร",
                "subcategories": {
                    "ชื่อหลักสูตร": "หลักสูตรปรัชญาดุษฎีบัณฑิต",
                    "สาขาวิชา": "เทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อม",
                    "ประเภทหลักสูตร": "หลักสูตรนานาชาติ/หลักสูตรปรับปรุง พ.ศ. 2565",
                    "สถาบันการศึกษา": "มหาวิทยาลัยธรรมศาสตร์",
                    "วิทยาเขต/คณะ/ภาควิชา": "ศูนย์รังสิต คณะวิศวกรรมศาสตร์ ภาควิชาวิศวกรรมเคมี"
                }
            },
            {
                "category": "หมวดที่ 1 ข้อมูลทั่วไป",
                "subcategories": {
                    "1_ชื่อหลักสูตร": {
                        "รหัสหลักสูตร": "25500051104304",
                        "ภาษาไทย": "หลักสูตรปรัชญาดุษฎีบัณฑิต สาขาวิชาเทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อม (หลักสูตรนานาชาติ)",
                        "ภาษาอังกฤษ": "Doctor of Philosophy Program in Energy and Environmental Technology Management (International Program)"
                    },
                    "2_ชื่อปริญญาและสาขาวิชา": {
                        "ภาษาไทย": {
                            "ชื่อเต็ม": "ปรัชญาดุษฎีบัณฑิต (เทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อม)",
                            "ชื่อย่อ": "ปร.ด.(เทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อม)"
                        },
                        "ภาษาอังกฤษ": {
                            "ชื่อเต็ม": "Doctor of Philosophy (Energy and Environmental Technology Management)",
                            "ชื่อย่อ": "Ph.D. (Energy and Environmental Technology Management)"
                        }
                    },
                    "3_วิชาเอก": "ไม่มี",
                    "4_จำนวนหน่วยกิตที่เรียนตลอดหลักสูตร": "48 หน่วยกิต",
                    "5_รูปแบบของหลักสูตร": {
                        "5.1_รูปแบบ": "หลักสูตรระดับปริญญาเอก ศึกษา 3 ปี",
                        "5.2_ภาษาที่ใช้": "หลักสูตรจัดการศึกษาเป็นภาษาอังกฤษ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-41",
        "document": "file-che20231021-41",
        "page": 58,
        "details": [
            {
                "category": "มคอ.2",
                "subcategories": {
                    "ฉบับปรับปรุง_พ.ศ._2560": {
                        "ความสามารถ": "ความสามารถด้านการคิดค้นวิจัยอย่างเป็นระบบรองรับการพัฒนางานวิจัยในภาคอุตสาหกรรม และเทคโนโลยีสมัยใหม่",
                        "การส่งเสริม": "ส่งเสริมการแลกเปลี่ยนประสบการณ์ทางวิชาชีพระหว่างผู้เรียน และเปิดโอกาสทางการศึกษาระดับสูงด้านเทคโนโลยีการจัดการพลังงานและสิ่งแวดล้อมให้แก่นักศึกษาจากประเทศเพื่อนบ้านต่างๆในภูมิภาคอาเซียน รวมถึงนักศึกษาจากนานาประเทศ",
                        "ผลลัพธ์": "ซึ่งน าไปสู่การแก้ปัญหาพลังงานและสิ่งแวดล้อมของประเทศ และพัฒนาองค์ความรู้ด้านการจัดการพลังงานและสิ่งแวดล้อมของประเทศให้มีความกว้างขวางยิ่งขึ้นต่อไป"
                    },
                    "ฉบับปรับปรุง_พ.ศ._2565": {
                        "ความสามารถ": "ความสามารถด้านการคิดค้นวิจัยอย่างเป็นระบบรองรับการพัฒนางานวิจัยในภาคอุตสาหกรรม และเทคโนโลยีสมัยใหม่",
                        "การส่งเสริม": "ส่งเสริมการแลกเปลี่ยนประสบการณ์ทางวิชาชีพระหว่างผู้เรียน",
                        "ผลลัพธ์": "ซึ่งน าไปสู่การแก้ปัญหาพลังงานและสิ่งแวดล้อมของประเทศ และพัฒนาองค์ความรู้ด้านการจัดการพลังงานและสิ่งแวดล้อมของประเทศให้มีความกว้างขวางยิ่งขึ้น"
                    },
                    "สรุปการเปลี่ยนแปลง": "ตัดข้อความเกี่ยวกับการเปิดโอกาสทางการศึกษาให้แก่นักศึกษาจากประเทศเพื่อนบ้านและนานาประเทศออก"
                }
            },
            {
                "category": "ความสำคัญ",
                "subcategories": {
                    "สถานการณ์": "จากการที่ทั่วโลกได้มีการตื่นตัวในเรื่องวิกฤติการณ์ด้านพลังงาน ปัญหาผลกระทบทางสิ่งแวดล้อมในแง่มุมต่าง ๆ รวมไปถึงปัญหาที่เกี่ยวข้องกับสภาวะโลกร้อน และการเกิดภัยธรรมชาติต่างๆ ที่นับวันจะทวีความรุนแรงเพิ่มมากขึ้น",
                    "ความต้องการ": "ทุกวงการเห็นความสำคัญในด้านการใช้และการจัดการพลังงานและการจัดการสิ่งแวดล้อมที่มีประสิทธิภาพ",
                    "สถานะปัจจุบัน": "ซึ่งปัจจุบันเทคโนโลยีและองค์ความรู้ที่มีอยู่ยังต้องมีการพัฒนาเพื่อให้สามารถแก้ปัญหาดังกล่าวซึ่งเปลี่ยนแปลงไปอย่างรวดเร็ว",
                    "แนวทางแก้ไข": "การจัดการที่มีประสิทธิภาพต่อสภาวการณ์ปัจจุบันจะเกิดขึ้นได้จึงต้องอาศัยนวัตกรรมใหม่ ๆ ที่ได้จากการวิจัยในเชิงลึก"
                }
            },
            {
                "category": "วัตถุประสงค์",
                "subcategories": {
                    "เป้าหมาย": "เพื่อให้บัณฑิตที่สำเร็จการศึกษาในหลักสูตรมีลักษณะดังนี้",
                    "สถานะการเปลี่ยนแปลง": "คงเดิม"
                }
            }
        ]
    }
]