[
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 41,
        "details": [
            {
                "category": "คุณธรรมและจริยธรรม",
                "subcategories": {
                    "ผลการเรียนรู้": {
                        "1": "เคารพสิทธิและรับฟังความคิดเห็นของผู้อื่น รวมทั้งเคารพในคุณค่าและศักดิ์ศรีของความเป็นมนุษย์",
                        "2": "เคารพกฎระเบียบและข้อบังคับต่าง ๆ ขององค์กรและสังคม",
                        "3": "มีจรรยาบรรณทางวิชาการและทางการปฏิบัติงานวิจัยและวิชาชีพ"
                    },
                    "การวัดมาตรฐาน": "อาจารย์ที่สอนต้องจัดให้มีการวัดมาตรฐานในด้านคุณธรรม จริยธรรมทุกภาคการศึกษา ซึ่งไม่จำเป็นต้องเป็นข้อสอบ อาจใช้การสังเกตพฤติกรรมระหว่างทำกิจกรรมที่กำหนด",
                    "กลยุทธ์การสอน": {
                        "1": "กำหนดให้มีวัฒนธรรมองค์กร เพื่อปลูกฝังระเบียบวินัย",
                        "2": "เน้นการเข้าชั้นเรียนให้ตรงเวลาและการแต่งกายที่สุภาพ",
                        "3": "ฝึกความรับผิดชอบในการทำงานกลุ่ม",
                        "4": "สอนความซื่อสัตย์ ไม่ทุจริตในการสอบหรือลอกการบ้าน",
                        "5": "อบรมจรรยาบรรณในการทำวิจัย",
                        "6": "สอดแทรกเรื่องคุณธรรม จริยธรรมในการสอนทุกรายวิชา"
                    },
                    "กลยุทธ์การประเมินผล": {
                        "1": "ประเมินจากการเข้าชั้นเรียนตรงเวลาและการส่งงานตามกำหนด",
                        "2": "ประเมินจากการเขียนวิทยานิพนธ์ที่มีการอ้างอิงที่ถูกต้อง",
                        "3": "ปริมาณการกระทำทุจริตในการสอบ",
                        "4": "ประเมินจากความรับผิดชอบในหน้าที่ที่ได้รับมอบหมาย",
                        "5": "ประเมินจากความรับผิดชอบในการทำงานวิจัย"
                    }
                }
            },
            {
                "category": "ความรู้",
                "subcategories": {
                    "ผลการเรียนรู้": {
                        "1": "มีความรู้และความเข้าใจเกี่ยวกับหลักการและทฤษฎีที่สำคัญในเนื้อหาสาขาวิศวกรรมเคมี",
                        "2": "สามารถปฏิบัติงานวิจัยเทคโนโลยีใหม่ ๆ ที่เกี่ยวข้อง",
                        "3": "สามารถวิเคราะห์ปัญหา รวมทั้งประยุกต์ความรู้ ทักษะ และการใช้เครื่องมือเหมาะสมกับการแก้ไขปัญหาในโรงงานที่เกี่ยวข้อง",
                        "4": "สามารถใช้โปรแกรมสำเร็จรูปในการวิเคราะห์ ออกแบบ ปรับปรุงกระบวนการผลิตของโรงงาน",
                        "5": "สามารถติดตามความก้าวหน้าและวิวัฒนาการของเทคโนโลยีที่เกี่ยวข้อง รวมทั้งการนำไปประยุกต์"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 19,
        "details": [
            {
                "category": "วิชาวิศวกรรมเคมี",
                "subcategories": {
                    "วค_616_การอนุรักษ์พลังงานและเทคโนโลยีพลังงาน": {
                        "รหัสวิชา": "วค 616",
                        "ชื่อวิชาภาษาอังกฤษ": "Energy Conservation and Energy Technology",
                        "หน่วยกิต": "3(3-0-9)",
                        "เนื้อหา": [
                            "เทคโนโลยีการใช้พลังงานที่มีอยู่ในปัจจุบันอย่างประหยัดและไม่ส่งผลกระทบต่อสิ่งแวดล้อม",
                            "เทคโนโลยีการใช้ประโยชน์จากพลังงานทางเลือกและพลังงานหมุนเวียน",
                            "การวิเคราะห์การจัดการพลังงานด้วยเทคนิคพินช์",
                            "การออกแบบสิ่งปลูกสร้างเพื่อการประหยัดพลังงาน",
                            "การวิเคราะห์การถ่ายเทความร้อนของผนังอาคาร (OTTV) และหลังคา (RTTV)"
                        ]
                    },
                    "วค_617_เชื้อเพลิงสะอาด": {
                        "รหัสวิชา": "วค 617",
                        "ชื่อวิชาภาษาอังกฤษ": "Clean Fuels",
                        "หน่วยกิต": "3(3-0-9)",
                        "เนื้อหา": [
                            "สถานการณ์ปัจจุบันด้านการใช้พลังงาน และความจำเป็นของเชื้อเพลิง",
                            "เชื้อเพลิงกับการเปลี่ยนแปลงสภาวะทางภูมิอากาศ",
                            "ชนิด องค์ประกอบ คุณสมบัติ และมาตรฐานที่เกี่ยวข้องของเชื้อเพลิงสะอาด",
                            "การผลิตเชื้อเพลิงสะอาดด้วยเทคโนโลยีต่างๆ",
                            "ผลกระทบจากเชื้อเพลิงสะอาดที่มีต่อการใช้พลังงานและสิ่งแวดล้อม"
                        ]
                    },
                    "วค_621_ปรากฏการณ์การถ่ายโอนขั้นกลาง": {
                        "รหัสวิชา": "วค 621",
                        "ชื่อวิชาภาษาอังกฤษ": "Intermediate Transport Phenomena",
                        "หน่วยกิต": "3(3-0-9)",
                        "เนื้อหา": [
                            "ทบทวนพื้นฐานการถ่ายโอนโมเมนตัม พลังงาน และมวลสารของระบบที่ควบคุมปริมาตร",
                            "การถ่ายโอนในภาวะคงตัวและภาวะไม่คงตัว",
                            "การถ่ายโอนในแกนเดียวและหลายแกน",
                            "ความสัมพันธ์ระหว่างสมบัติระดับจุลภาคกับสมบัติระดับมหภาค",
                            "การแก้ปัญหาการถ่ายโอนแบบปัญหาค่าขอบเขตและปัญหาค่าเริ่มต้น"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 74,
        "details": [
            {
                "category": "บทความวิจัย",
                "subcategories": {
                    "บทความที่_1": {
                        "ชื่อเรื่อง": "Mathematical Model in the Form of Vorticity-Stream Function for Porous Premixed Combustion",
                        "ผู้แต่ง": "Pakdee W., Utaivorawit N.",
                        "แหล่งตีพิมพ์": "Songklanakarin Journal of Science and Technology",
                        "ปีที่พิมพ์": "2015",
                        "รายละเอียดการตีพิมพ์": "Vol.37, No.5, pp. 595-600"
                    },
                    "บทความที่_2": {
                        "ชื่อเรื่อง": "ผลของระยะห่างระหว่างขั้วอิเล็คโทรดที่มีต่อประสิทธิภาพของกระบวนการรวมอนุภาคด้วยไฟฟ้าในการบำบัดน้ำเสียที่ไหลต่อเนื่อง",
                        "ผู้แต่ง": "วาทิต ภักดี, กิตติพล รัตนพงศ์",
                        "แหล่งตีพิมพ์": "วิศวสารลาดกระบัง",
                        "ปีที่พิมพ์": "2016",
                        "รายละเอียดการตีพิมพ์": "Vol.3, No.2, pp. 36-41"
                    },
                    "บทความที่_3": {
                        "ชื่อเรื่อง": "Numerical Analysis on the Two-dimensional Unsteady Magnetohydrodynamic Compressible Flow through a Porous Medium",
                        "ผู้แต่ง": "Pakdee W., Yuvakanit B., Hussein A.K.",
                        "แหล่งตีพิมพ์": "Journal of Applied Fluid Mechanics",
                        "ปีที่พิมพ์": "2017",
                        "รายละเอียดการตีพิมพ์": "Vol.10, No.4, pp. 19-25"
                    },
                    "บทความที่_4": {
                        "ชื่อเรื่อง": "Numerical Study of Forced Air Cooling of Heated Porous Foam Pyramid Array",
                        "ผู้แต่ง": "Kevin R. Anderson, Maryam Shafahi, Alfredo Gutierrez and Watit Pakdee",
                        "แหล่งตีพิมพ์": "Proceedings of the 5th International Conference on Porous Media and its Applications in Science and Engineering ICPM5",
                        "วันที่นำเสนอ": "June 22-27, 2014",
                        "สถานที่": "Kona, Hawaii, US"
                    },
                    "บทความที่_5": {
                        "ผู้แต่ง": "Kevin R. Anderson, Matthew Devost, Watit Pakdee, Niveditha Krishnamoorthy",
                        "ปีที่พิมพ์": "2014",
                        "หมายเหตุ": "ข้อมูลไม่ครบถ้วน ไม่มีชื่อเรื่องและรายละเอียดการตีพิมพ์"
                    }
                }
            },
            {
                "category": "ข้อมูลส่วนบุคคล",
                "subcategories": {
                    "ชื่อ": "ผู้ช่วยศาสตราจารย์ ดร.วาทิต ภักดี"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 29,
        "details": [
            {
                "category": "อาจารย์ผู้รับผิดชอบหลักสูตร",
                "subcategories": [
                    {
                        "ลำดับที่": "1",
                        "เลขประจำตัวประชาชน": "3100501910xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "นางสาววันวิสาข์ สกลภาพ",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "The University of Waterloo, Canada",
                                "ปี": "2546"
                            },
                            {
                                "ระดับ": "M.S.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "The University, Colorado State, U.S.A.",
                                "ปี": "2538"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "มหาวิทยาลัยขอนแก่น",
                                "ปี": "2536"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "2",
                        "เลขประจำตัวประชาชน": "4100600053xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "นางแคทลียา ปัทมพรหม",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Michigan Ann Arbor, U.S.A.",
                                "ปี": "2544"
                            },
                            {
                                "ระดับ": "M.Sc.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Michigan Ann Arbor, U.S.A.",
                                "ปี": "2540"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2537"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "3",
                        "เลขประจำตัวประชาชน": "3959900235xxx",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "ชื่อ-สกุล": "นางสาวพัชราภรณ์ วุฒิเจริญมงคล",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "ปร.ด.",
                                "สาขาวิชา": "วิทยาศาสตร์พอลิเมอร์",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2550"
                            },
                            {
                                "ระดับ": "วท.บ.",
                                "สาขาวิชา": "เคมี",
                                "สถาบัน": "มหาวิทยาลัยสงขลานครินทร์",
                                "ปี": "2546"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 44,
        "details": [
            {
                "category": "ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ",
                "subcategories": {
                    "กลยุทธ์การประเมินผล": "ประเมินจากพฤติกรรมและการแสดงออกของนักศึกษาในการนำเสนอรายงานกลุ่มในชั้นเรียน การนำเสนอหัวข้อวิทยานิพนธ์ การประเมินจากโรงงานอุตสาหกรรม(ถ้ามี) และสังเกตจากพฤติกรรมที่แสดงออกในการร่วมกิจกรรมต่าง ๆ"
                }
            },
            {
                "category": "ทักษะการวิเคราะห์และการสื่อสาร และการใช้เทคโนโลยีสารสนเทศ",
                "subcategories": {
                    "ผลการเรียนรู้": {
                        "ทักษะการคำนวณและวิเคราะห์": "มีทักษะในการคำนวณและวิเคราะห์ผลโดยใช้เครื่องคำนวณและคอมพิวเตอร์",
                        "ทักษะการสื่อสาร": "สามารถสื่อสารอย่างมีประสิทธิภาพทั้งปากเปล่าและการเขียน พร้อมทั้งเลือกใช้รูปแบบของสื่อการนำเสนอได้อย่างเหมาะสม",
                        "ทักษะการใช้เทคโนโลยี": "สามารถใช้สารสนเทศและเทคโนโลยีสื่อสารอย่างเหมาะสม"
                    },
                    "กลยุทธ์การสอน": {
                        "การใช้โปรแกรมคอมพิวเตอร์": "มีการใช้โปรแกรมคอมพิวเตอร์สำเร็จรูปในการเรียนการสอนและการออกแบบกระบวนการผลิตในรายวิชาต่าง ๆ",
                        "การนำเสนอและสื่อสาร": "มีการนำเสนอ / สื่อสารในวิชาสัมมนาและการสอบวิทยานิพนธ์รวมทั้งการนำเสนอผลงานวิจัยโดยใช้สื่อคอมพิวเตอร์ร่วมกับการพูด",
                        "การเขียน": "ฝึกฝนการเขียนวิทยานิพนธ์และผลงานวิจัยรวมถึงรายงานต่าง ๆ"
                    },
                    "กลยุทธ์การประเมินผล": {
                        "การประเมินวิชาสัมมนา": "การประเมินจากผลการประเมินวิชาสัมมนา",
                        "การสอบวิทยานิพนธ์": "ประเมินจากการสอบหัวข้อวิทยานิพนธ์ และการสอบวิทยานิพนธ์และการผ่านข้อกำหนดต่าง ๆ ในการจบการศึกษา"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 73,
        "details": [
            {
                "category": "ผู้ช่วยศาสตราจารย์ ดร.ชาญณรงค์ อัศวเทศานุภาพ",
                "subcategories": {
                    "หนังสือและตำรา": [
                        "ชาญณรงค์ อัศวเทศานุภาพ (แปลและเรียบเรียง) ถ่าน: การผลิตที่ถูกวิธีและประโยชน์ สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ",
                        "ชาญณรงค์ อัศวเทศานุภาพ เธอร์โมไดนามิคส์เบื้องต้น"
                    ],
                    "บทความวิจัย": [
                        {
                            "ชื่อบทความ": "A feasibility study on production of solid fuel from glycerol and agricultural waste",
                            "ผู้แต่ง": "Asavatesanupap, C. and Santikunaporn, M.",
                            "ปีที่พิมพ์": "2010",
                            "แหล่งตีพิมพ์": "International Transaction Journal of Engineering, Management, & Applied Science & Technologies",
                            "รายละเอียด": "Vol. 1: 43-51"
                        },
                        {
                            "ชื่อบทความ": "Fluid dynamical analysis of a particle with large vapor transport in Poiseuille flow",
                            "ผู้แต่ง": "Asavatesanupap, C. and Sadhal, S.S.",
                            "ปีที่พิมพ์": "2009",
                            "แหล่งตีพิมพ์": "Interdisciplinary Transport Phenomena: Ann. N.Y. Acad. Sci.",
                            "รายละเอียด": "1161: 268-276"
                        },
                        {
                            "ชื่อบทความ": "Transient dynamics of a rotating spherical drop",
                            "ผู้แต่ง": "Asavatesanupap, C. and Sadhal, S.S.",
                            "ปีที่พิมพ์": "2008",
                            "แหล่งตีพิมพ์": "J. Eng. Math.",
                            "รายละเอียด": "doi 10.1007/s 10665-008-9262-y"
                        },
                        {
                            "ชื่อบทความ": "การผลิตไบโอดีเซลด้วยกระบวนการให้ความร้อนจากไมโครเวฟแบบการไหลต่อเนื่องและการทดสอบสมรรถนะของไบโอดีเซลในเครื่องยนต์ดีเซลสูบเดียว",
                            "ผู้แต่ง": "ชาญณรงค์ อัศวเทศานุภาพ และ ศิริพรรณ กลั่นศิริ",
                            "ปีที่พิมพ์": "2557",
                            "แหล่งตีพิมพ์": "วารสารวิทยาศาสตร์และเทคโนโลยี",
                            "รายละเอียด": "ปีที่ 22 ฉบับที่ 3"
                        },
                        {
                            "ชื่อบทความ": "การเปรียบเทียบผลประหยัดพลังงานสำหรับมาตรการติดตั้งเครื่องควบคุมความเร็วรอบมอเอตร์ในเครื่องอัดอากาศ",
                            "ผู้แต่ง": "อุทัย วงศ์เขื่อนแก้ว ชาญณงค์ อัศวเทศานุภาพ และ มาลีสันติคุณาภรณ์",
                            "ปีที่พิมพ์": "2559",
                            "แหล่งตีพิมพ์": "วารสารวิทยาศาสตร์และเทคโนโลยี",
                            "รายละเอียด": "ปีที่ 24 ฉบับที่ 6 (ฉบับพิเศษ)"
                        },
                        {
                            "ชื่อบทความ": "การสังเคราะห์เชื้อเพลิงเหลวจากน้ำมันหล่อลื่นที่ใช้แล้วโดยกระบวนการไฟโรไลซิส",
                            "ผู้แต่ง": "นีรา วงศ์ทยานุวัตร มาลี สันติคุณาภรณ์ และ ชาญณรงค์อัศวเทศานุภาพ",
                            "ปีที่พิมพ์": "2561",
                            "แหล่งตีพิมพ์": "วารสารวิทยาศาสตร์และเทคโนโลยี",
                            "รายละเอียด": "ปีที่ 26 ฉบับที่ 2"
                        },
                        {
                            "ชื่อบทความ": "การปรับปรุงค่าออกเทนของแก๊สโซลีน",
                            "ผู้แต่ง": "มาลี สันติคุณาภรณ์ และ ชาญณรงค์ อัศวเทศานุภาพ",
                            "แหล่งตีพิมพ์": "วารสารวิทยาศาสตร์และเทคโนโลยี",
                            "รายละเอียด": "ปีที่ 18 ฉบับที่ 4"
                        }
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 39,
        "details": [
            {
                "category": "อาจารย์ที่ปรึกษาวิทยานิพนธ์",
                "subcategories": {
                    "องค์ประกอบ": "ประกอบด้วย อาจารย์ที่ปรึกษาวิทยานิพนธ์หลัก และ/หรืออาจารย์ที่ปรึกษาวิทยานิพนธ์ร่วม",
                    "คุณสมบัติ": "ต้องมีคุณสมบัติเป็นไปตามเกณฑ์มาตรฐานหลักสูตรระดับบัณฑิตศึกษาของสำนักงานคณะกรรมการการอุดมศึกษา"
                }
            },
            {
                "category": "กระบวนการประเมินผล",
                "subcategories": {
                    "จำนวนครั้งการสอบ": "อย่างน้อย 2 ครั้ง",
                    "ประเภทการสอบ": "การสอบข้อเสนองานวิจัย และการสอบวิทยานิพนธ์",
                    "วิธีการประเมิน": "ประเมินผลตามความเห็นของอาจารย์ที่ปรึกษาและกรรมการสอบ",
                    "ระดับการวัดผล": "แบ่งเป็น 2 ระดับ คือ P (ผ่าน) และ N (ไม่ผ่าน)",
                    "เกณฑ์การผ่าน": "ในแต่ละครั้งของการสอบจะต้องได้ผลการประเมินคือใช้ได้"
                }
            },
            {
                "category": "การสอบวิทยานิพนธ์",
                "subcategories": {
                    "คณะกรรมการสอบ": {
                        "องค์ประกอบ": "อาจารย์ที่ปรึกษาวิทยานิพนธ์ อาจารย์ประจำหลักสูตร และผู้ทรงคุณวุฒิภายนอก",
                        "จำนวน": "อย่างน้อย 3 คน",
                        "คุณสมบัติ": "เป็นไปตามเกณฑ์มาตรฐานหลักสูตรระดับบัณฑิตศึกษาของสำนักงานคณะกรรมการการอุดมศึกษา และข้อบังคับมหาวิทยาลัยธรรมศาสตร์"
                    },
                    "เงื่อนไขการสอบ": "นักศึกษาจะสอบวิทยานิพนธ์ได้เมื่อสอบภาษาต่างประเทศผ่านแล้ว",
                    "ลักษณะการสอบ": "เป็นการสอบปากเปล่า และเป็นระบบเปิดให้ผู้สนใจเข้าร่วมฟังได้",
                    "เกณฑ์การผ่าน": "ต้องได้มติเป็นเอกฉันท์จากคณะกรรมการสอบวิทยานิพนธ์",
                    "การจัดทำวิทยานิพนธ์": "ให้เป็นไปตามรูปแบบที่ห้องสมุดแห่งมหาวิทยาลัยธรรมศาสตร์กำหนด",
                    "การส่งวิทยานิพนธ์": "นำส่งเข้าระบบบริหารจัดการวิทยานิพนธ์ให้มหาวิทยาลัยธรรมศาสตร์ตามระเบียบ"
                }
            },
            {
                "category": "การเผยแพร่ผลงานวิทยานิพนธ์",
                "subcategories": {
                    "แผน_ก_1": "ผลงานวิทยานิพนธ์หรือส่วนหนึ่งของวิทยานิพนธ์ต้องได้รับการตีพิมพ์ หรืออย่างน้อยได้รับการยอมรับให้ตีพิมพ์ในวารสารระดับชาติหรือระดับนานาชาติที่มีคุณภาพตามประกาศคณะกรรมการการอุดมศึกษา",
                    "แผน_อื่นๆ": {
                        "ทางเลือกที่_1": "ได้รับการตีพิมพ์ หรืออย่างน้อยได้รับการยอมรับให้ตีพิมพ์ในวารสารระดับชาติหรือระดับนานาชาติที่มีคุณภาพตามประกาศคณะกรรมการการอุดมศึกษา",
                        "ทางเลือกที่_2": "นำเสนอต่อที่ประชุมวิชาการโดยบทความที่นำเสนอฉบับสมบูรณ์ (Full Paper) ได้รับการตีพิมพ์ในรายงานสืบเนื่องจากการประชุมวิชาการ (Proceedings)"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 67,
        "details": [
            {
                "category": "Publications",
                "subcategories": {
                    "Conference_Proceedings": [
                        {
                            "title": "Synthesis of TiO2 Nanoparticles with High Photocatalytic Activity by Wet Ball Milling Sol-Gel Method",
                            "authors": "Kasamechonchung, and Tippabust Eksangsri",
                            "year": 2017,
                            "conference": "7th International TiChE Conference",
                            "pages": "211-214",
                            "location": "Bangkok",
                            "institution": "King Mongkut's University Of Technology Thonburi"
                        },
                        {
                            "title": "Modified Cellulose Acetate Membrane for RO Desalination",
                            "author": "Tippabust Eksangsri",
                            "year": 2017,
                            "conference": "Asian Conference on Engineering and Natural Sciences",
                            "pages": "122-125",
                            "location": "Sapporo"
                        },
                        {
                            "title": "Linoleic Acid Recovery from Sunflower Seed using Membrane-based Solvent Extraction",
                            "author": "Tippabust Eksangsri",
                            "year": 2016,
                            "conference": "Global Conference on Engineering and Sciences",
                            "pages": "187-188",
                            "location": "Sapporo"
                        },
                        {
                            "title": "Modification of Cellulose Acetate Membrane for Seawater Treatment",
                            "authors": "T. Eksangsri and N. Tancharoen",
                            "year": 2015,
                            "conference": "4th International Symposium on Engineering Energy and Environment",
                            "location": "Pattaya",
                            "institution": "Thammasat University"
                        }
                    ],
                    "Journal_Articles": [
                        {
                            "title": "Feasibility Study on Reuse of Washed Water in Electronic Industry; case study for flexible printed circuit board manufacturing in Thailand",
                            "authors": "Tippabust Eksangsri and Thanon Jaiwang",
                            "year": 2014,
                            "journal": "Procedia Environmental Science",
                            "volume": 20,
                            "pages": "206-214"
                        }
                    ],
                    "Thai_Language_Publications": [
                        {
                            "title": "การศึกษาความเป็นไปได้ในการน าเปลือกมะม่วงสุกไปใช้เป็นเชื้อเพลิงอัดแท่ง",
                            "authors": "จุรชา จันทร์ทอง และ ทิพบุษฏ์ เอกแสงศรี",
                            "year": 2559,
                            "conference": "การประชุมวิชาการเครือข่ายพลังงานแห่งประเทศไทยครั้งที่ 12",
                            "location": "พิษณุโลก"
                        },
                        {
                            "title": "การศึกษาปัญหาสุขภาพของประชาชนและมลพิษทางอากาศในพื้นที่อุตสาหกรรมปิโตรเคมี จังหวัดระยอง",
                            "authors": "ใจสิภา มิ่งไทยสงค์ และ ทิพบุษฎ์ เอกแสงศรี",
                            "year": 2558,
                            "conference": "พะเยาวิจัยประจ าปี 2558",
                            "pages": "782-788",
                            "location": "พะเยา",
                            "institution": "มหาวิทยาลัยพะเยา"
                        },
                        {
                            "title": "การศึกษาศักยภาพกากตะกอนจากการบ าบัดน้ าเสีย",
                            "authors": "ธิลักษณ์ จันทร์ส่องศรี และ ทิพบุษฎ์ เอกแสงศรี",
                            "year": 2558,
                            "conference": "พะเยาวิจัยประจ าปี 2558",
                            "pages": "632-639",
                            "location": "พะเยา",
                            "institution": "มหาวิทยาลัยพะเยา"
                        }
                    ]
                }
            },
            {
                "category": "Other_Researchers",
                "subcategories": {
                    "ผู้ช่วยศาสตราจารย์_ดร.วรรัตน์_ปัตรประกร": [
                        {
                            "title": "Impact of solar and wind power development plan in Thailand by considering frequency response of power system",
                            "authors": "Bhasaputra, P., Sansilah, C., & Pattaraprakorn, W.",
                            "year": 2015,
                            "conference": "12th Electrical Engineering/Electronics, Computers, Telecomunications and Information Technology- Conference (ECTI-CON)",
                            "location": "Hua Hin, Thailand"
                        },
                        {
                            "title": "Impacts of PV Power Plants on Distribution Grid for Voltage Stability and Economic Values",
                            "authors": "Pattaraprakorn, W., Bhasaputra, P., & Pattanasirichotigul, J.",
                            "year": 2015,
                            "conference": "12th Electrical Engineering/Electronics, Computers, Telecomunications and Information Technology- Conference (ECTI-CON)",
                            "location": "Hua Hin, Thailand"
                        }
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 82,
        "details": [
            {
                "category": "Research Publications",
                "subcategories": {
                    "Bacterial_Cellulose_Composites": {
                        "Title": "Development of conductive bacterial cellulose composites: An approach to bio-based substrates for solar cells",
                        "Journal": "Journal of Biobased materials and Bioenergy",
                        "Volume": "11",
                        "Pages": "1-9"
                    },
                    "Al_substituted_ZnS_Particles": {
                        "Title": "Investigation on structural properties of Al-substituted ZnS particle prepared from wet chemical synthetic route",
                        "Authors": "Infahsaeng Y., Ummartyotin S.",
                        "Year": "2017",
                        "Journal": "Results in Physics",
                        "Volume": "7",
                        "Pages": "1245-1251"
                    },
                    "Mn_substituted_SnO2_Particles": {
                        "Title": "Effect of Mn-substituted SnO2 particle toward photocatalytic degradation of methylene blue dye",
                        "Authors": "Sakwises L., Pisitsak P., Manuspiya H., Ummartyotin S.",
                        "Year": "2017",
                        "Journal": "Results in Physics",
                        "Volume": "7",
                        "Pages": "1751-1759"
                    },
                    "Bacterial_Cellulose_Gelatin_Hydrogel": {
                        "Title": "Synthesis and characterization of bacterial cellulose and gelatin-based hydrogel composites for drug-delivery systems",
                        "Authors": "Treesuppharat W., Rojanapanthu P., Siangsanoh C., Manuspiya H., Ummartyotin S.",
                        "Year": "2017",
                        "Journal": "Biotechnology Reports",
                        "Volume": "15",
                        "Pages": "84-91"
                    },
                    "Gallic_Acid_Chitosan_PVA_Hydrogel": {
                        "Title": "Development of a gallic acid-loaded chitosan and poly vinyl alcohol hydrogel composite: Release characteristics and antioxidant activity",
                        "Authors": "Thanyacharoen T., Chuysinuan P., Techasakul S., Nooeaid P., Ummartyotin S.",
                        "Year": "2018",
                        "Journal": "International Journal of Biological Macromolecules",
                        "Volume": "107",
                        "Pages": "363-370"
                    },
                    "Black_Rice_Chitosan_PVA_Composite": {
                        "Title": "The chemical composition and antioxidant and release properties of a black rice (Oryza sativa L.)-loaded chitosan and polyvinyl alcohol composite",
                        "Authors": "Thanyacharoen T., Chuysinuan P., Techasakul S., Na Lampang Noenplab A., Ummartyotin S.",
                        "Year": "2017",
                        "Journal": "Journal of Molecular Liquids",
                        "Volume": "248",
                        "Pages": "1065-1070"
                    },
                    "SnO2_Bacterial_Cellulose_Nanofiber": {
                        "Title": "SnO2 and bacterial cellulose nanofiber based composite as a novel platform for nickel ion detection",
                        "Authors": "Sakwises L., Rodthongkum N., Ummartyotin S.",
                        "Year": "2017",
                        "Journal": "Journal of Molecular Liquids",
                        "Volume": "248",
                        "Pages": "246-252"
                    },
                    "Magnetic_Composite_Hydrogel": {
                        "Title": "Fabrication and characterization of triple-responsive magnetic composite hydrogel for targeted and controlled drug delivery system",
                        "Authors": "Siangsanoh C., Ummartyotin S., Sathirakul K., Rojanapanthu P., Treesuppharat W.",
                        "Year": "2018",
                        "Journal": "Journal of Molecular Liquids",
                        "Volume": "256",
                        "Pages": "90-99"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 45,
        "details": [
            {
                "category": "แผนที่แสดงการกระจายความรับผิดชอบมาตรฐานผลการเรียนรู้จากหลักสูตรสู่รายวิชา",
                "subcategories": {
                    "คุณธรรม_จริยธรรม": {
                        "1": "ตระหนักในคุณค่าและคุณธรรม จริยธรรม เสียสละ และซื่อสัตย์สุจริต",
                        "2": "มีวินัย ตรงต่อเวลา และความรับผิดชอบต่อตนเอง วิชาชีพและสังคม",
                        "3": "มีภาวะความเป็นผู้นำและผู้ตาม สามารถทำงานเป็นทีมและสามารถแก้ไขข้อขัดแย้งและลำดับความสำคัญ",
                        "4": "เคารพสิทธิและรับฟังความคิดเห็นของผู้อื่น รวมทั้งเคารพในคุณค่าและศักดิ์ศรีของความเป็นมนุษย์",
                        "5": "เคารพกฎระเบียบและข้อบังคับต่าง ๆ ขององค์กรและสังคม",
                        "6": "มีจรรยาบรรณทางวิชาการและทางการปฏิบัติงานวิจัยและวิชาชีพ"
                    },
                    "ความรู้": {
                        "1": "มีความรู้และความเข้าใจเกี่ยวกับหลักการและทฤษฎีที่สำคัญในเนื้อหาสาขาวิศวกรรมเคมี",
                        "2": "สามารถปฏิบัติงานวิจัยเทคโนโลยีใหม่ ๆ ที่เกี่ยวข้อง",
                        "3": "สามารถวิเคราะห์ปัญหา รวมทั้งประยุกต์ความรู้ ทักษะ และการใช้เครื่องมือที่เหมาะสมกับการแก้ไขปัญหาในโรงงานที่เกี่ยวข้อง",
                        "4": "สามารถใช้โปรแกรมสำเร็จรูปในการวิเคราะห์ ออกแบบ ปรับปรุงกระบวนการผลิตของโรงงาน",
                        "5": "สามารถติดตามความก้าวหน้าและวิวัฒนาการของเทคโนโลยีที่เกี่ยวข้อง รวมทั้งการนำไปประยุกต์",
                        "6": "มีความรู้ในแนวกว้างของงานวิจัยและพัฒนาต่าง ๆ ในสาขาวิชาวิศวกรรมเคมีโดยเล็งเห็นการเปลี่ยนแปลง และเข้าใจผลกระทบของเทคโนโลยีใหม่ๆ ที่เกี่ยวข้อง"
                    },
                    "ทักษะทางปัญญา": {
                        "1": "คิดอย่างมีวิจารณญาณและอย่างเป็นระบบ",
                        "2": "สามารถสืบค้น ตีความ และประเมินเอกสารงานวิจัยต่าง ๆ เพื่อใช้ในการแก้ไขปัญหาอย่างสร้างสรรค์",
                        "3": "สามารถรวบรวม ศึกษา วิเคราะห์ และสรุปประเด็นปัญหาและความต้องการ",
                        "4": "มีการแก้ไขปัญหาและการค้นคว้าวิจัยจนประสบความสำเร็จในงานวิจัยได้อย่างถูกต้องและเหมาะสม"
                    },
                    "ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": {
                        "1": "สามารถสื่อสารทั้งภาษาไทยและภาษาต่างประเทศกับกลุ่มคนหลากหลายได้อย่างมีประสิทธิภาพ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 76,
        "details": [
            {
                "category": "บทความวิจัย",
                "subcategories": {
                    "บทความภาษาอังกฤษ": [
                        {
                            "ผู้แต่ง": "Wichit Krueasuk, Pornrapeepat Bhasaputra, Woraratana Pattaraprakorn, and Supattana Nirukkanaporn",
                            "ปี": "2015",
                            "ชื่อบทความ": "Renewable Energy for Rural Electrification in Thailand: A Case Study of Solar PV Rooftop",
                            "ชื่อวารสาร": "GMSARN International Journal",
                            "ปีที่": "Vol. 9",
                            "ฉบับที่": "No. 2"
                        },
                        {
                            "ผู้แต่ง": "C. Sansilah, P. Bhasaputra and W. Pattaraprakorn",
                            "ปี": "2015",
                            "ชื่อบทความ": "Frequency Response for Next Decade Solar Power Development Plan in Thailand Part 1: Frequency Response Model of Thailand Power System",
                            "ชื่อวารสาร": "GMSARN International Journal",
                            "ปีที่": "Vol. 9",
                            "ฉบับที่": "No. 2"
                        }
                    ],
                    "บทความภาษาไทย": [
                        {
                            "ผู้แต่ง": "พรระพีพัฒน์ ภาสบุตร, พรพรรณ พงษ์พันธ์ และ วรรัตน์ ปัตรประกร",
                            "ปี": "2557",
                            "ชื่อบทความ": "การหาค่าที่เหมาะสมกำลังผลิตสูงสุดของโรงไฟฟ้าพลังงานลมกับความต้องการพลังงานในประเทศไทย",
                            "ชื่องาน": "การประชุมวิชาการสิ่งแวดล้อมแห่งชาติครั้งที่ 13",
                            "เดือน": "มีนาคม"
                        },
                        {
                            "ผู้แต่ง": "ศุภเกียรติ สังข์เกิด, พรระพีพัฒน์ ภาสบุตร และ วรรัตน์ ปัตรประกร",
                            "ปี": "2557",
                            "ชื่อบทความ": "การศึกษาความเหมาะสมในการลงทุนในระบบรถไฟฟ้าสาธารณะทดแทนรถเอ็นจีวี ในมหาวิทยาลัยธรรมศาสตร์ ศูนย์รังสิต",
                            "ชื่องาน": "การประชุมวิชาการสิ่งแวดล้อมแห่งชาติครั้งที่ 13",
                            "เดือน": "มีนาคม"
                        },
                        {
                            "ผู้แต่ง": "พรระพีพัฒน์ ภาสบุตร, ชัชรินทร์ นิยติวัฒน์ชาญชัย และ วรรัตน์ ปัตรประกร",
                            "ปี": "2557",
                            "ชื่อบทความ": "การหาปริมาณกำลัง"
                        }
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 35,
        "details": [
            {
                "category": "บุคลากร",
                "subcategories": [
                    {
                        "ลำดับ": "21",
                        "เลขประจำตัวประชาชน": "3100601993xxx",
                        "ชื่อ-สกุล": "วาทิต ภักดี",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Mechanical Engineering",
                                "สถาบัน": "University of Colorado at Boulder, USA",
                                "ปี": "2546"
                            },
                            {
                                "ระดับ": "M.S.",
                                "สาขาวิชา": "Mechanical Engineering",
                                "สถาบัน": "University of Colorado at Boulder, USA",
                                "ปี": "2540"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเครื่องกล",
                                "สถาบัน": "มหาวิทยาลัยเกษตรศาสตร์",
                                "ปี": "2537"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเครื่องกล",
                                "สถาบัน": "สถาบันเทคโนโลยีพระจอมเกล้าฯ พระนครเหนือ",
                                "ปี": "2534"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "22",
                        "เลขประจำตัวประชาชน": "3130200158xxx",
                        "ชื่อ-สกุล": "พรระพีพัฒน์ ภาสบุตร",
                        "ตำแหน่งทางวิชาการ": "อาจารย์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Electrical Engineering",
                                "สถาบัน": "Asian Institute of Technology, Thailand",
                                "ปี": "2550"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Electrical Engineering",
                                "สถาบัน": "Asian Institute of Technology, Thailand",
                                "ปี": "2544"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "Electrical Engineering (Power Systems, Energy Management)",
                                "สถาบัน": "Thammasat University",
                                "ปี": "2539"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "23",
                        "เลขประจำตัวประชาชน": "3110100551xxx",
                        "ชื่อ-สกุล": "นายชิราวุฒิ เพชรเย็น",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "วัสดุศาสตร์",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2551"
                            },
                            {
                                "ระดับ": "วท.ม.",
                                "สาขาวิชา": "วัสดุศาสตร์",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2548"
                            },
                            {
                                "ระดับ": "วท.บ.",
                                "สาขาวิชา": "เทคโนโลยีวัสดุ",
                                "สถาบัน": "มหาวิทยาลัยรามคำแหง",
                                "ปี": "2544"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 53,
        "details": [
            {
                "category": "การประกันคุณภาพหลักสูตร",
                "subcategories": {
                    "การบริหารหลักสูตร": "มีคณะกรรมการประจำหลักสูตร ประกอบด้วยรองคณบดีฝ่ายวิชาการ ประธานหลักสูตร หัวหน้าภาค และอาจารย์ผู้รับผิดชอบหลักสูตร โดยมีคณบดีเป็นผู้กำกับดูแล วางแผนการจัดการเรียนการสอน ติดตามและรวบรวมข้อมูลเพื่อปรับปรุงและพัฒนาหลักสูตรทุกปี",
                    "การกำกับมาตรฐาน": {
                        "อาจารย์ผู้รับผิดชอบหลักสูตร": "แต่งตั้ง 3 คน มีคุณวุฒิและคุณสมบัติตามเกณฑ์มาตรฐานหลักสูตรระดับบัณฑิตศึกษา พ.ศ. 2558",
                        "อาจารย์ที่ปรึกษาวิทยานิพนธ์": "คุณวุฒิและคุณสมบัติเป็นไปตามเกณฑ์มาตรฐานหลักสูตรระดับบัณฑิตศึกษา พ.ศ. 2558",
                        "อาจารย์ผู้สอบวิทยานิพนธ์": "ประกอบด้วยอาจารย์ประจำหลักสูตรและผู้ทรงคุณวุฒิภายนอกสถาบัน รวมไม่น้อยกว่า 3 คน",
                        "อาจารย์ผู้สอน": "ต้องมีคุณวุฒิขั้นต่ำปริญญาโทหรือเทียบเท่า มีประสบการณ์สอนและผลงานทางวิชาการ",
                        "จำนวนนักศึกษาที่ปรึกษา": "อาจารย์ประจำหลักสูตรที่มีคุณวุฒิปริญญาเอกสามารถเป็นที่ปรึกษาวิทยานิพนธ์ได้ไม่เกิน 5 คนต่อภาคการศึกษา หรือไม่เกิน 10 คนสำหรับผู้มีตำแหน่งทางวิชาการ"
                    },
                    "บัณฑิต": "มีการสำรวจความพึงพอใจของผู้ใช้บัณฑิตทุกปีการศึกษา เพื่อนำมาปรับปรุงหลักสูตร"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 59,
        "details": [
            {
                "category": "ดัชนีบ่งชี้ผลการดำเนินงาน",
                "subcategories": {
                    "การประชุมและวางแผน": "อาจารย์ผู้รับผิดชอบหลักสูตรอย่างน้อยร้อยละ 80 มีส่วนร่วมในการประชุมเพื่อวางแผน ติดตาม และทบทวนการดำเนินงานหลักสูตร",
                    "รายละเอียดหลักสูตร": "มีรายละเอียดของหลักสูตร ตามแบบ มคอ.2 ที่สอดคล้องกับกรอบมาตรฐานคุณวุฒิแห่งชาติ หรือมาตรฐานคุณวุฒิสาขา/สาขาวิชา (ถ้ามี)",
                    "รายละเอียดรายวิชา": "มีรายละเอียดของรายวิชา และรายละเอียดของประสบการณ์ภาคสนาม (ถ้ามี) ตามแบบ มคอ.3 และมคอ.4 อย่างน้อยก่อนการเปิดสอนในแต่ละภาคการศึกษาให้ครบทุกรายวิชา",
                    "รายงานผลการดำเนินการรายวิชา": "จัดทำรายงานผลการดำเนินการของรายวิชา และรายงานผลการดำเนินการของประสบการณ์ภาคสนาม (ถ้ามี) ตามแบบ มคอ.5 และ มคอ.6 ภายใน 30 วัน หลังสิ้นสุดภาคการศึกษาที่เปิดสอนให้ครบทุกรายวิชา",
                    "รายงานผลการดำเนินการหลักสูตร": "จัดทำรายงานผลการดำเนินการของหลักสูตร ตามแบบมคอ.7 ภายใน 60 วัน หลังสิ้นสุดปีการศึกษา",
                    "ทวนสอบผลสัมฤทธิ์": "มีการทวนสอบผลสัมฤทธิ์ของนักศึกษาตามมาตรฐานผลการเรียนรู้ ที่กำหนดใน มคอ.3 และมคอ.4 (ถ้ามี) อย่างน้อยร้อยละ 25 ของรายวิชาที่เปิดสอนในแต่ละปีการศึกษา",
                    "พัฒนาการจัดการเรียนการสอน": "มีการพัฒนา/ปรับปรุงการจัดการเรียนการสอน กลยุทธ์การสอน หรือ การประเมินผลการเรียนรู้ จากผลการประเมินการดำเนินงานที่รายงานใน มคอ.7 ปีที่แล้ว",
                    "ปฐมนิเทศอาจารย์ใหม่": "อาจารย์ใหม่ทุกคนได้รับการปฐมนิเทศหรือคำแนะนำด้านการจัดการเรียนการสอน",
                    "พัฒนาอาจารย์ประจำหลักสูตร": "อาจารย์ประจำหลักสูตรทุกคนได้รับการพัฒนาทางวิชาการ และ/หรือวิชาชีพ อย่างน้อยปีละหนึ่งครั้ง",
                    "พัฒนาบุคลากรสนับสนุน": "จำนวนบุคลากรสนับสนุนการเรียนการสอน (ถ้ามี) ได้รับการพัฒนาวิชาการ และ/หรือวิชาชีพ ไม่น้อยกว่าร้อยละ 50 ต่อปี"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 75,
        "details": [
            {
                "category": "Academic Publications",
                "subcategories": {
                    "Conference_Paper_1": {
                        "title": "Numerical study of high-power density electronics module using k-core heat exchanger/cold plate active thermal control system",
                        "authors": "Not specified",
                        "conference": "The 15th International Heat Transfer Conference IHTC-15",
                        "date": "August 10-15, 2014",
                        "location": "Kyoto, Japan"
                    },
                    "Conference_Paper_2": {
                        "title": "Numerical Analysis on Magnetohydrodynamic Compressible Flow through a Porous Medium",
                        "authors": "Bowonsak Yuwakanit and Watit Pakdee",
                        "conference": "The 5th TSME International Conference on Mechanical Engineering (TSME-ICoME)",
                        "date": "17-19 December 2014",
                        "location": "Chiang Mai",
                        "paper_number": "TSF031"
                    },
                    "Conference_Paper_3": {
                        "title": "Parametric study of flow and heat transfer of fluid with temperature-dependent properties subjected to the magnetic field in a porous media",
                        "authors": "Pornthep Pattanavanitkul and Watit Pakdee",
                        "conference": "Proceedings of the 22nd Conference of the Mechanical Engineering Network of Thailand (ME-NETT 31)",
                        "date": "4-7 July 2017",
                        "location": "Nakornnayok",
                        "paper_number": "TSF20"
                    },
                    "Conference_Paper_4": {
                        "title": "Numerical study of MHD flow through porous media of fluid with temperature-dependent properties",
                        "authors": "Watit Pakdee and Ponthep Pattanavanitkul",
                        "conference": "The 6th International Conference on Engineering and Innovative Materials (ICEIM 2017)",
                        "date": "September 3-5, 2017",
                        "location": "Tokyo, Japan",
                        "paper_number": "IM062-A"
                    }
                }
            },
            {
                "category": "Faculty",
                "subcategories": {
                    "Faculty_Member": {
                        "name": "อาจารย์ ดร.พรระพีพัฒน์ ภาสบุตร",
                        "number": "2.19"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 38,
        "details": [
            {
                "category": "การทำวิทยานิพนธ์",
                "subcategories": {
                    "ความสามารถของนักศึกษา": [
                        "สร้างโครงการวิจัยและดำเนินการวิจัยเพื่อสร้างองค์ความรู้ใหม่ในสาขาวิศวกรรมเคมี",
                        "นำเสนอวิทยานิพนธ์",
                        "เขียนรายงานวิจัยเพื่อเผยแพร่",
                        "มีจริยธรรมในการทำวิจัยและเผยแพร่ผลงานวิชาการ",
                        "มีทักษะในการดำเนินการวิจัย วิเคราะห์ และแก้ไขปัญหา"
                    ],
                    "เงื่อนไขการตีพิมพ์": [
                        "ผลงานวิทยานิพนธ์ต้องได้รับการตีพิมพ์หรือยอมรับให้ตีพิมพ์ในวารสารระดับชาติหรือนานาชาติ",
                        "วารสารต้องมีคุณภาพตามประกาศคณะกรรมการการอุดมศึกษา",
                        "เกณฑ์แตกต่างกันระหว่างแผน ก แบบ ก 1 และแผน ก แบบ ก 2"
                    ],
                    "ช่วงเวลา": {
                        "แผน ก แบบ ก 1": "สามารถจดทะเบียนทำวิทยานิพนธ์ได้ตั้งแต่ภาคการศึกษาแรก",
                        "แผน ก แบบ ก 2": "จดทะเบียนได้เมื่อศึกษารายวิชาไม่น้อยกว่า 2 ภาคการศึกษาปกติ หรือมีหน่วยกิตสะสมไม่น้อยกว่า 12 หน่วยกิต และมีผลการเรียนเฉลี่ยสะสมไม่ต่ำกว่า 3.00"
                    },
                    "จำนวนหน่วยกิต": {
                        "แผน ก แบบ ก1": "36 หน่วยกิต",
                        "แผน ก แบบ ก2": "18 หน่วยกิต"
                    },
                    "การเตรียมการ": [
                        "นักศึกษาเลือกหัวข้อวิจัยที่สนใจ",
                        "ปรึกษากับอาจารย์ที่ปรึกษาเพื่อหาแนวทางในการดำเนินงาน"
                    ],
                    "ขั้นตอนการทำวิทยานิพนธ์": [
                        "ทำวิทยานิพนธ์เป็นภาษาไทยหรือภาษาอังกฤษ",
                        "รายงานความก้าวหน้าทุกภาคการศึกษาที่มีการลงทะเบียน",
                        "เสนอเค้าโครงวิทยานิพนธ์ต่อคณะกรรมการสอบวิทยานิพนธ์",
                        "ยื่นเรื่องแต่งตั้งอาจารย์ที่ปรึกษาและคณะกรรมการสอบวิทยานิพนธ์",
                        "สอบเค้าโครงวิทยานิพนธ์และสอบวิทยานิพนธ์"
                    ],
                    "คณะกรรมการสอบวิทยานิพนธ์": [
                        "ประกอบด้วยไม่น้อยกว่า 3 ท่าน",
                        "ประกอบด้วยอาจารย์ที่ปรึกษาวิทยานิพนธ์ อาจารย์ประจำหลักสูตร และผู้ทรงคุณวุฒิจากภายนอกมหาวิทยาลัย"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 83,
        "details": [
            {
                "category": "ชื่อหลักสูตรและชื่อปริญญา",
                "subcategories": {
                    "ชื่อหลักสูตร": {
                        "ไทย": "วิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมเคมี",
                        "อังกฤษ": "Master of Engineering Program in Chemical Engineering"
                    },
                    "ชื่อปริญญา": {
                        "ไทย": {
                            "ชื่อเต็ม": "วิศวกรรมศาสตรมหาบัณฑิต (วิศวกรรมเคมี)",
                            "ชื่อย่อ": "วศ.ม. (วิศวกรรมเคมี)"
                        },
                        "อังกฤษ": {
                            "ชื่อเต็ม": "Master of Engineering (Chemical Engineering)",
                            "ชื่อย่อ": "M.Eng. (Chemical Engineering)"
                        }
                    },
                    "สรุปการเปลี่ยนแปลง": "คงเดิม"
                }
            },
            {
                "category": "ปรัชญา ความสำคัญ และวัตถุประสงค์ของหลักสูตร",
                "subcategories": {
                    "ปรัชญา": {
                        "รายละเอียด": "หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมเคมี คณะวิศวกรรมศาสตร์ มหาวิทยาลัยธรรมศาสตร์มุ่งเน้นเพื่อส่งเสริมให้บัณฑิตเป็นผู้ที่คิดเป็น มีความสามารถด้านการคิดค้นวิจัยอย่างเป็นระบบรองรับการพัฒนางานวิจัยในภาคอุตสาหกรรม และมีความรู้พื้นฐานด้านวิศวกรรมที่เหมาะสม",
                        "สรุปการเปลี่ยนแปลง": "คงเดิม"
                    },
                    "ความสำคัญ": {
                        "รายละเอียด": "นับตั้งแต่ปี พ.ศ. 2550 เป็นต้นมา ประเทศไทยและประชาคมโลกได้เผชิญกับวิกฤตการณ์พลังงาน ซึ่งทำให้ต้นทุนในการดำรงชีพ และต้นทุนของการผลิตในภาคอุตสาหกรรมปรับตัวสูงขึ้นอย่างมาก โดยเฉพาะเมื่อประเทศไทยไม่สามารถพึ่งพาตนเองได้ในด้านพลังงาน และหลังจากนั้นไม่นาน ระบบเศรษฐกิจโลกก็เกิดการถดถอยอย่างรุนแรง มีผลในทางบวกคือทำให้ราคาของพลังงานถูกลงเนื่องจากความต้องการลดลง แต่มีผลกระทบทางลบมหาศาลคือทำให้เกิดภาวะการว่างงาน และการเลิกจ้างของบริษัทต่างๆ มากขึ้น เศรษฐกิจของประเทศพึ่งพาการส่งออกได้น้อยลง และถูกบีบด้วยกฎเกณฑ์การกีดกันทางการค้าต่างๆ เพิ่มขึ้นเรื่อยๆ ไม่ว่าจะเป็นเรื่องมาตรฐานคุณภาพ เรื่องการดูแลและรับผิดชอบต่อสิ่งแวดล้อม และการปล่อยก๊าซเรือนกระจก ทำให้ภาคอุตสาหกรรมต่างๆ จำเป็นต้องมีการปรับตัว เพื่อลดต้นทุนในการผลิต ลดการพึ่งพาพลังงานและการส่งออกต่างประเทศ ปรับโครงสร้างให้มีการใช้ทรัพยากรบุคคลได้อย่างมีประสิทธิภาพที่สุด รวมถึงต้องเริ่มสนใจพัฒนาเทคโนโลยีของตนมากขึ้นเพื่อลดการพึ่งพาเทคโนโลยีต่างประเทศ ซึ่งจะเป็นปัจจัยหนึ่งในการช่วยลดต้นทุนการผลิตอย่างยั่งยืน ด้วยเหตุนี้ สาขาวิศวกรรมเคมีจึงได้รับความนิยมอย่างสูงในปัจจุบัน เนื่องจากบัณฑิตสาขาวิศวกรรมเคมีสามารถปรับตัวกับเทคโนโลยีสมัยใหม่ที่มักมี",
                        "สรุปการเปลี่ยนแปลง": "คงเดิม"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 26,
        "details": [
            {
                "category": "วค 663 วิศวกรรมชีวเคมี",
                "subcategories": {
                    "รหัสวิชา": "วค 663",
                    "ชื่อวิชาภาษาไทย": "วิศวกรรมชีวเคมี",
                    "ชื่อวิชาภาษาอังกฤษ": "Biochemical Engineering",
                    "หน่วยกิต": "3(3-0-9)",
                    "เนื้อหา": "ระบบชีวภาพพื้นฐาน หน้าที่ของเอนไซม์และการประยุกต์วิถีเมทาบอลิซึม ปริมาณสัมพันธ์ของจุลชีวภาพ ปรากฎการณ์การถ่ายโอนของระบบกระบวนการชีวภาพ การออกแบบถังปฏิกรณ์ชีวภาพ อุปกรณ์และการควบคุม",
                    "คำอธิบายภาษาอังกฤษ": "Students learn fundamental biological systems, roles of enzymes, applications of metabolic pathways, stoichiometry for microbiology, transport phenomena for biological process, and design and control of bioreactor."
                }
            },
            {
                "category": "วค 664 การจำลองแบบสิ่งแวดล้อม",
                "subcategories": {
                    "รหัสวิชา": "วค 664",
                    "ชื่อวิชาภาษาไทย": "การจำลองแบบสิ่งแวดล้อม",
                    "ชื่อวิชาภาษาอังกฤษ": "Environmental Modelling",
                    "หน่วยกิต": "3(3-0-9)",
                    "เนื้อหา": "หลักการถ่ายโอนมวล จลนพลศาสตร์ปฏิกิริยา และกระบวนทางเคมีในการเกิดสายพันธุ์ใหม่ ที่เกี่ยวกับการจำลองแบบปัญหาและแบบจำลองสิ่งแวดล้อม การประยุกต์การแก้ปัญหาและการใช้แบบจำลองสำหรับการถ่ายโอนในแม่น้ำ ทะเลสาบ และน้ำใต้ดินด้วยซอฟต์แวร์",
                    "คำอธิบายภาษาอังกฤษ": "Concept in mass transfer, reaction kinetics and chemical speciation with respect to environmental modelling and simulation. Applying for problem solving and modelling transport in river, lakes and groundwater using available commercial software."
                }
            },
            {
                "category": "วค 692 ระเบียบวิธีวิจัย",
                "subcategories": {
                    "รหัสวิชา": "วค 692",
                    "ชื่อวิชาภาษาไทย": "ระเบียบวิธีวิจัย",
                    "ชื่อวิชาภาษาอังกฤษ": "Research Methodology and Research Skill",
                    "หน่วยกิต": "1(1-0-3)",
                    "เนื้อหา": "วัตถุประสงค์ของการวิจัย แนวทางการทำวิจัย กระบวนการพื้นฐานสำหรับการวิจัย การกำหนดปัญหา ความรู้ทางสถิติของการวิจัย การวิเคราะห์และการแปลผล พัฒนาทักษะทางการสื่อสารและการนำเสนอด้วยภาษาอังกฤษ การเขียนรายงานวิจัยด้วยภาษาอังกฤษที่ถูกต้องตามหลักไวยากรณ์",
                    "คำอธิบายภาษาอังกฤษ": "Research objectives; Research formulation; Basic procedure for doing research; Defining problems; Statistical methods for research analysis and interpretation; Improvement of communication and presentation skills on the ability to communicate effectively in English; Including process of writing English research reports with correct language usage."
                }
            },
            {
                "category": "วค 791 สัมมนาบัณฑิตศึกษา",
                "subcategories": {
                    "รหัสวิชา": "วค 791",
                    "ชื่อวิชาภาษาไทย": "สัมมนาบัณฑิตศึกษา",
                    "ชื่อวิชาภาษาอังกฤษ": "Graduate Seminar",
                    "หน่วยกิต": "1(0-3-3)",
                    "เนื้อหา": "สัมมนาทางวิชาการในหัวข้อที่เกี่ยวกับวิศวกรรมเคมีสมัยใหม่ ศึกษาและนำเสนอบทความวิจัยทางวิศวกรรมเคมีที่เกี่ยวข้องกับงานวิจัยของนักศึกษา"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 25,
        "details": [
            {
                "category": "วค 655 การบำบัดมลพิษทางน้ำจากอุตสาหกรรม",
                "subcategories": {
                    "ผลกระทบ": "ผลกระทบของมลพิษทางน้ำจากอุตสาหกรรม",
                    "คุณลักษณะและการวิเคราะห์": "คุณลักษณะและการวิเคราะห์มลพิษทางน้ำ",
                    "การควบคุมคุณภาพน้ำทิ้ง": "การควบคุมคุณภาพน้ำทิ้งจากโรงงานอุตสาหกรรมตามมาตรฐานด้วยกระบวนการทางกายภาพ เคมี และชีวภาพ",
                    "การใช้น้ำซ้ำและการประหยัดน้ำ": "การใช้น้ำซ้ำและการประหยัดน้ำในอุตสาหกรรม"
                }
            },
            {
                "category": "วค 656 การจัดการกากอุตสาหกรรม",
                "subcategories": {
                    "คำจำกัดความและลักษณะ": "คำจำกัดความของกากอุตสาหกรรม ลักษณะทางกายภาพ เคมี และพิษวิทยา",
                    "การแบ่งประเภท": "การแบ่งประเภทกากอุตสาหกรรม กากอันตราย",
                    "กฎหมายและข้อบังคับ": "กฎหมายและข้อบังคับสำคัญที่เกี่ยวกับการควบคุมวัตถุอันตราย และการจัดการกากอุตสาหกรรม",
                    "ระบบติดตาม": "ระบบติดตามกากอุตสาหกรรม",
                    "กากอุตสาหกรรมพิเศษ": "กากอุตสาหกรรมพิเศษและข้อกำหนดที่เกี่ยวข้องในการนำเข้าหรือส่งออก"
                }
            },
            {
                "category": "วค 657 การควบคุมมลพิษทางอากาศจากอุตสาหกรรม",
                "subcategories": {
                    "ผลกระทบ": "ผลกระทบของมลพิษทางอากาศ เช่น ภาวะเรือนกระจก ฝนกรด การสูญเสียชั้นโอโซน",
                    "มาตรฐานการปล่อยมลพิษ": "มาตรฐานการปล่อยมลพิษทางอากาศจากอุตสาหกรรมของประเทศไทยและต่างประเทศ",
                    "วิธีการตรวจวัดและควบคุม": "วิธีการตรวจวัดและการควบคุมมลพิษทางอากาศจากอุตสาหกรรม",
                    "อุตุนิยมวิทยาและแบบจำลอง": "อุตุนิยมวิทยาและแบบจำลองการกระจายตัวของมลพิษ",
                    "การจัดการและป้องกัน": "การจัดการมลพิษและการป้องกันมลพิษทางอากาศ"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 68,
        "details": [
            {
                "category": "Research Papers",
                "subcategories": {
                    "Renewable Energy": {
                        "Solar Power": "Sansilah, C., Bhasaputra, P., & Pattaraprakorn, W. (2015). Dependable Capacity Evaluation of Solar Power Plants by Considering Actual Minutely Solar Power Generation.",
                        "Rural Electrification": "Krueasuk, W., Bhasaputra, P., Pattaraprakorn, W., & Nirukkanaporn, S. (2015). Renewable Energy for RuralElectrification in Thailand: A Case Study of Solar PV Rooftop."
                    },
                    "Energy Economics": {
                        "Smart Grid": "Uthathip, N., Bhasaputra, P., & Pattaraprakorn, W. (2015). Economic Values of Reliability Improvement for Smart Grid in Thailand by Considering Outage Cost."
                    },
                    "Waste Management": {
                        "Plastic Recycling": "Pattaraprakorn, W., & Bhasaputra, P. (2014). Utilization of Contaminated Food Plastic Bag Waste for Fuel Oil Production through Pyrolysis Process."
                    },
                    "Environmental Engineering": {
                        "Adsorption": "Sorachoti, K., Pangkumhang, B., Tanboonchuy, V., Tulaphol, S., & Grisdanurak, N. (2017). Reversibleadsorption of metalworking fluids (MWFs) on Cu-BTC metal organic framework.",
                        "Water Treatment": "Yoadsomsuay, T., Grisdanurak, N., & Liao C. H. (2016). Influence of chitosan on modified anoscale zero-valent iron for arsenate removal.",
                        "Photocatalysis": "Khunphonoi, R., & Grisdanurak, N. (2016). Mechanism pathway and kinetics of p-cresol photocatalytic degradation over titania nanorods under UV-visible irradiation."
                    },
                    "Microwave Technology": {
                        "Waste Treatment": "P. Waiyanate, P. Dhupatemiya and P. Siritheerasas, (2016) 'Effects of Microwave Absorbers on theTorrefaction of Highly Moist Municipal Solid Waste (MSW) Pellets'",
                        "Torrefaction": "P. Siritheerasas, K. Chaloemngam and W. Booncharoen, (2016) 'Microwave Torrefaction'"
                    }
                }
            },
            {
                "category": "Researchers",
                "subcategories": {
                    "Dr. Weera Pattaraprakorn": "Associated with multiple papers on renewable energy and waste management",
                    "Dr. Nurak Grisdanurak": "Associated with papers on environmental engineering and adsorption",
                    "Asst. Prof. Prodpran Siritheerasas": "Associated with papers on microwave technology applications"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 61,
        "details": [
            {
                "category": "การประเมินและทบทวนหลักสูตร",
                "subcategories": {
                    "วิเคราะห์ปัญหาและข้อบกพร่อง": "วิเคราะห์ปัญหา ข้อบกพร่อง ตลอดจนข้อควรปรับปรุงของแต่ละรายวิชา อันนำไปสู่การเรียนการสอนที่มีประสิทธิภาพสูงขึ้น",
                    "ทบทวนภาพรวมหลักสูตร": "ทบทวนภาพรวมของหลักสูตร และคุณภาพของนักศึกษา ตลอดจนระดับความรู้ความสามารถของบัณฑิตที่สำเร็จการศึกษา",
                    "ประเมินผลงานวิชาการ": "ประเมินผลงานวิชาการของบัณฑิต"
                }
            },
            {
                "category": "กระบวนการวางแผนปรับปรุงหลักสูตร",
                "subcategories": {
                    "ศึกษาผลการประเมิน": "ศึกษาผลการประเมินคุณภาพการศึกษาข้างต้น",
                    "วิเคราะห์กลยุทธ์": "วิเคราะห์หากลยุทธ์เพื่อให้ได้ตามคุณภาพการศึกษาที่กำหนด",
                    "ปรับปรุงเนื้อหารายวิชา": "ปรับปรุงเนื้อหาของแต่ละรายวิชาให้เหมาะสมและทันกับวิทยาการปัจจุบัน",
                    "ปรับปรุงหลักสูตรให้ทันสมัย": "ปรับปรุงหลักสูตรให้มีความทันสมัยและสอดคล้องกับความต้องการของผู้ใช้บัณฑิตยิ่งขึ้น"
                }
            },
            {
                "category": "ระยะเวลาการปรับปรุงหลักสูตร",
                "subcategories": {
                    "ความถี่ในการปรับปรุง": "การปรับปรุงหลักสูตรจะดำเนินการทุก 5 ปี"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 42,
        "details": [
            {
                "category": "ความรู้ในงานวิจัยและพัฒนาสาขาวิศวกรรมเคมี",
                "subcategories": {
                    "ความรู้ทั่วไป": "มีความรู้ในแนวกว้างของงานวิจัยและพัฒนาต่าง ๆ ในสาขาวิชาวิศวกรรมเคมี",
                    "การเปลี่ยนแปลงเทคโนโลยี": "เล็งเห็นการเปลี่ยนแปลง และเข้าใจผลกระทบของเทคโนโลยีใหม่ๆ ที่เกี่ยวข้อง",
                    "การทดสอบมาตรฐาน": "สามารถทำได้โดยการทดสอบจากข้อสอบของแต่ละวิชาในชั้นเรียน และการประเมินจากอาจารย์ที่ปรึกษาวิทยานิพนธ์"
                }
            },
            {
                "category": "กลยุทธ์การสอนด้านความรู้",
                "subcategories": {
                    "รูปแบบการสอน": "ใช้การเรียนการสอนในหลากหลายรูปแบบ โดยเน้นหลักการทางทฤษฎี การใช้โปรแกรมสำเร็จรูปและประยุกต์ทางปฎิบัติในสภาพแวดล้อมจริง",
                    "การค้นคว้าและสัมมนา": "งานค้นคว้าวิจัยเทคโนโลยีใหม่ๆ และการสัมมนาเพื่อให้ทันต่อการเปลี่ยนแปลงทางเทคโนโลยี",
                    "การเรียนรู้จากประสบการณ์จริง": "การศึกษาดูงานหรือเชิญผู้เชี่ยวชาญที่มีประสบการณ์ตรงมาเป็นวิทยากรพิเศษ และการฝึกปฏิบัติงานในสถานประกอบการ"
                }
            },
            {
                "category": "กลยุทธ์การประเมินผลด้านความรู้",
                "subcategories": {
                    "การสอบ": "การสอบหัวข้อวิทยานิพนธ์, การสอบกลางภาคเรียนและปลายภาคเรียน",
                    "การนำเสนอ": "ประเมินจากการนำเสนอรายงานในชั้นเรียนและในวิชาสัมมนา",
                    "การประเมินภาคปฏิบัติ": "การประเมินจากรายวิชาภาคปฏิบัติในโรงงานอุตสาหกรรม (สำหรับนักศึกษาที่เลือกศึกษารายวิชานี้)"
                }
            },
            {
                "category": "ทักษะทางปัญญา",
                "subcategories": {
                    "การพัฒนาตนเอง": "นักศึกษาต้องสามารถพัฒนาตนเองและประกอบวิชาชีพได้โดยพึ่งตนเองได้เมื่อจบการศึกษา",
                    "การคิดวิเคราะห์": "คิดอย่างมีวิจารณญาณและอย่างเป็นระบบ",
                    "การสืบค้นและประเมิน": "สามารถสืบค้น ตีความ และประเมินเอกสารงานวิจัยต่าง ๆ เพื่อใช้ในการแก้ไขปัญหาอย่างสร้างสรรค์",
                    "การวิเคราะห์ปัญหา": "สามารถรวบรวม ศึกษา วิเคราะห์ และสรุปประเด็นปัญหาและความต้องการ",
                    "การแก้ปัญหาและวิจัย": "มีการแก้ไขปัญหาและการค้นคว้าวิจัยจนประสบความสำเร็จในงานวิจัยได้อย่างถูกต้องและเหมาะสม"
                }
            },
            {
                "category": "กลยุทธ์การสอนด้านทักษะทางปัญญา",
                "subcategories": {
                    "การทำวิจัย": "การทำงานวิจัยในวิชาวิทยานิพนธ์",
                    "การออกข้อสอบ": "การออกข้อสอบที่ให้นักศึกษาแก้ปัญหา อธิบายแนวคิดการแก้ปัญหาและวิธีการแก้ปัญหาโดยการประยุกต์ความรู้ที่เรียนมา",
                    "การปฏิบัติจริง": "มีวิชาที่ให้นักศึกษามีโอกาสปฏิบัติจริง"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 88,
        "details": [
            {
                "category": "หลักสูตร",
                "subcategories": {
                    "หลักสูตรฉบับ_พ.ศ._2558": "รายละเอียดหลักสูตรเดิม",
                    "หลักสูตรฉบับ_พ.ศ._2561": "รายละเอียดหลักสูตรใหม่",
                    "สรุปการเปลี่ยนแปลง": "สรุปการเปลี่ยนแปลงระหว่างสองหลักสูตร"
                }
            },
            {
                "category": "เงื่อนไขการสำเร็จการศึกษา",
                "subcategories": {
                    "การนำเสนอบทความ": "นำเสนอต่อที่ประชุมวิชาการโดยบทความที่นำเสนอฉบับสมบูรณ์ (Full Paper) ได้รับการตีพิมพ์ในรายงานสืบเนื่องจากการประชุมวิชาการ (Proceedings) อย่างน้อย 1 เรื่อง",
                    "เงื่อนไขอื่นๆ": "ต้องปฏิบัติตามเงื่อนไขอื่นๆ ที่คณะและมหาวิทยาลัยธรรมศาสตร์กำหนด"
                }
            },
            {
                "category": "จำนวนหน่วยกิตรวมและระยะเวลาศึกษา",
                "subcategories": {
                    "จำนวนหน่วยกิตรวม": {
                        "แผน_ก1": "36 หน่วยกิต",
                        "แผน_ก2": "38 หน่วยกิต"
                    },
                    "ระยะเวลาศึกษา": "หลักสูตรแบบเต็มเวลา นักศึกษาต้องใช้ระยะเวลาการศึกษาตลอดหลักสูตรอย่างน้อย 3 ภาคการศึกษาปกติ และอย่างมากไม่เกิน 10 ภาคการศึกษาปกติ"
                }
            },
            {
                "category": "โครงสร้างและองค์ประกอบหลักสูตร",
                "subcategories": {
                    "แผน_ก_แบบ_ก1": {
                        "วิชาเสริมพื้นฐาน": "ไม่นับหน่วยกิต",
                        "วิทยานิพนธ์": "36 หน่วยกิต",
                        "ศึกษาวิชาโดยไม่นับหน่วยกิต": "2 หน่วยกิต"
                    },
                    "แผน_ก_แบบ_ก2": {
                        "วิชาเสริมพื้นฐาน": "ไม่นับหน่วยกิต",
                        "วิชาบังคับ": "14 หน่วยกิต",
                        "วิชาเลือก": "6 หน่วยกิต",
                        "วิทยานิพนธ์": "18 หน่วยกิต"
                    }
                }
            },
            {
                "category": "รายวิชาในหลักสูตร",
                "subcategories": {
                    "วิชาเสริมพื้นฐาน": {
                        "วค.500": "สมดุลมวลสารและพลังงาน 3(3-0-9)",
                        "วค.501": "กลศาสตร์ของไหลสำหรับวิศวกรรมเคมี 3(3-0-9)",
                        "วค.502": "การถ่ายเทความร้อน 3(3-0-9)",
                        "วค.503": "วิศวกรรมปฏิกิริยา 3(3-0-9)",
                        "วค.504": "การถ่ายโอนมวล 3(3-0-9)",
                        "วค.506": "เธอร์โมไดนามิกส์วิศวกรรมเคมี 3(3-0-9)"
                    },
                    "แผน_ก_แบบ_ก1_วิชาไม่นับหน่วยกิต": {
                        "วค.692": "ระเบียบวิธีวิจัย 1(1-0-3)",
                        "วค.791": "สัมมนาบัณฑิตศึกษา 1(0-3-3)"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 36,
        "details": [
            {
                "category": "ข้อมูลบุคลากร",
                "subcategories": {
                    "ลำดับที่": "24",
                    "เลขประจำตัวประชาชน": "1909900014xxx",
                    "ตำแหน่งทางวิชาการ": "อาจารย์",
                    "ชื่อ-สกุล": "นายศรุต อำมาตย์โยธิน",
                    "คุณวุฒิ": {
                        "ระดับปริญญาเอก": {
                            "คุณวุฒิ": "Ph.D.",
                            "สาขาวิชา": "Polymer Science",
                            "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                            "ปีที่สำเร็จการศึกษา": "2555"
                        },
                        "ระดับปริญญาโท": {
                            "คุณวุฒิ": "M.Eng.",
                            "สถาบัน": "Universite De Limoges, France",
                            "ปีที่สำเร็จการศึกษา": "2551"
                        },
                        "ระดับปริญญาตรี": {
                            "คุณวุฒิ": "วศ.บ.",
                            "สาขาวิชา": "Materials Engineering",
                            "สถาบัน": "มหาวิทยาลัยเกษตรศาสตร์",
                            "ปีที่สำเร็จการศึกษา": "2549"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 56,
        "details": [
            {
                "category": "การพัฒนาและประเมินหลักสูตร",
                "subcategories": {
                    "การประเมินความพึงพอใจ": "มีการประเมินความพึงพอใจของหลักสูตรและการเรียนการสอน โดยมหาบัณฑิตที่สำเร็จการศึกษา",
                    "การปรับปรุงหลักสูตร": "แต่งตั้งคณะกรรมการปรับปรุงหลักสูตร ที่มีจำนวนและคุณสมบัติตามหลักเกณฑ์ของคณะกรรมการการอุดมศึกษา (สกอ.) ปรับปรุงหลักสูตรอย่างน้อยทุก 5 ปี",
                    "การพิจารณาปรับปรุง": "นำความคิดเห็นของผู้ทรงคุณวุฒิ นักศึกษาปีสุดท้ายหรือมหาบัณฑิตบัณฑิตใหม่ และผู้ใช้บัณฑิต การเปลี่ยนแปลงทางเศรษฐกิจและสังคมที่มีผลกระทบต่อลักษณะที่พึงประสงค์ของมหาบัณฑิตมาประกอบการพิจารณา"
                }
            },
            {
                "category": "เป้าหมายการพัฒนาหลักสูตร",
                "subcategories": {
                    "ความทันสมัย": "พัฒนาหลักสูตรให้ทันสมัยโดยอาจารย์และนักศึกษาสามารถก้าวทันหรือเป็นผู้นำในการสร้างองค์ความรู้ใหม่ๆทางด้านเทคโนโลยีสารสนเทศ",
                    "การกระตุ้นการเรียนรู้": "กระตุ้นให้นักศึกษาเกิดความใฝ่รู้ มีแนวทางการเรียนที่สร้างทั้งความรู้ความสามารถในวิชาการวิชาชีพที่ทันสมัย",
                    "การประเมินคุณภาพ": "ตรวจสอบและปรับปรุงหลักสูตรให้มีคุณภาพมาตรฐาน",
                    "การประเมินมาตรฐาน": "มีการประเมินมาตรฐานของหลักสูตรอย่างสม่ำเสมอ"
                }
            },
            {
                "category": "การดำเนินการพัฒนาหลักสูตร",
                "subcategories": {
                    "มาตรฐานวิชาชีพ": "จัดให้หลักสูตรสอดคล้องกับมาตรฐานวิชาชีพด้านเทคโนโลยีในระดับสากลหรือระดับชาติ",
                    "การปรับปรุงหลักสูตร": "ปรับปรุงหลักสูตรให้ทันสมัยโดยมีการพิจารณาปรับปรุงหลักสูตรทุกๆ 5ปี",
                    "แนวทางการเรียนการสอน": "จัดแนวทางการเรียนในวิชาเรียนให้มีทั้งภาคทฤษฎีและภาคปฏิบัติ และมีแนวทางการเรียนหรือกิจกรรมประจำวิชาให้นักศึกษาได้ศึกษาความรู้ที่ทันสมัยด้วยตนเอง",
                    "การสนับสนุนการเรียนรู้": "จัดให้มีผู้สนับสนุนการเรียนรู้ และหรือผู้ช่วยสอน เพื่อกระตุ้นให้นักศึกษาเกิดความใฝ่รู้",
                    "คุณสมบัติอาจารย์": "กำหนดให้อาจารย์ที่สอนมีคุณวุฒิไม่ต่ำกว่าปริญญาเอกหรือเป็นผู้มีความเชี่ยวชาญมีประสบการณ์หลายปี มีจำนวนคณาจารย์ประจำไม่น้อยกว่าเกณฑ์มาตรฐาน",
                    "การพัฒนาอาจารย์": "สนับสนุนให้อาจารย์ผู้สอนเป็นผู้นำในทางวิชาการ และ/หรือ เป็นผู้เชี่ยวชาญทางวิชาชีพในแขนงต่างๆ ทางวิศวกรรมเคมี หรือในด้านที่เกี่ยวข้อง",
                    "การศึกษาดูงาน": "ส่งเสริมให้อาจารย์ประจำหลักสูตรไปดูงานในหลักสูตรหรือวิชาการที่เกี่ยวข้อง ทั้งในและต่างประเทศ",
                    "การประเมินหลักสูตร": "มีการประเมินหลักสูตรโดยคณะกรรมการภายในและภายนอกอย่างน้อยทุก 5 ปี",
                    "การจัดทำฐานข้อมูล": "จัดทำฐานข้อมูลทางด้านนักศึกษา อาจารย์ อุปกรณ์ เครื่องมือวิจัย งบประมาณ"
                }
            },
            {
                "category": "การประเมินผล",
                "subcategories": {
                    "มาตรฐานหลักสูตร": "หลักสูตรที่สามารถอ้างอิงกับมาตรฐานที่กำหนดโดยหน่วยงานวิชาชีพด้านเทคโนโลยีสารสนเทศ มีความทันสมัยและมีการปรับปรุงสม่ำเสมอ",
                    "รายวิชา": "จำนวนวิชาเรียนที่มีภาคปฏิบัติ และวิชาเรียนที่มีแนวทางให้นักศึกษาได้ศึกษาค้นคว้าความรู้ใหม่ได้ด้วยตนเอง",
                    "คณาจารย์": "จำนวนและรายชื่อคณาจารย์ประจำ ประวัติอาจารย์ด้านคุณวุฒิประสบการณ์ และการพัฒนาอบรมของอาจารย์",
                    "บุคลากรสนับสนุน": "จำนวนบุคลากรผู้สนับสนุนการเรียนรู้และบันทึกกิจกรรมในการสนับสนุนการเรียนรู้",
                    "การประเมินการสอน": "ผลการประเมินการเรียนการสอนอาจารย์ผู้สอน และการสนับสนุนการเรียนรู้ของผู้สนับสนุนการเรียนรู้ โดยนักศึกษา",
                    "การประเมินภายนอก": "ประเมินผลโดยคณะกรรมการผู้ทรงคุณวุฒิภายนอก ทุก ๆ 5 ปี",
                    "การประเมินโดยบัณฑิต": "ประเมินผลโดยบัณฑิตผู้สำเร็จการศึกษาทุกปี"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 78,
        "details": [
            {
                "category": "Publications",
                "subcategories": {
                    "Journal_Articles": [
                        {
                            "title": "Physico-Chemical Properties of ZnO and Chitosan Composite for Packaging Material",
                            "authors": "Ummartyotin, S., Pechyen C.",
                            "year": 2017,
                            "journal": "Journal of Biobased Materials and Bioenergy",
                            "volume": 11,
                            "issue": 3,
                            "pages": "183-192",
                            "impact_factor": 1.56
                        },
                        {
                            "title": "Development of isotactic polypropylene and stearic acid-modified calcium carbonate composite: a promising material for microwavable packaging",
                            "authors": "Ummartyotin, S., Pechyen C.",
                            "year": 2017,
                            "journal": "Polym. Bull.",
                            "pages": "1-8",
                            "impact_factor": 1.43
                        },
                        {
                            "title": "Microcrystalline-cellulose and polypropylene based composite: a simple, selective and effective material for microwavable packaging",
                            "authors": "Ummartyotin, S., Pechyen C.",
                            "year": 2016,
                            "journal": "Carbohydrate Polymers",
                            "impact_factor": 4.811
                        },
                        {
                            "title": "Role of ZnO on nylon 6 surface and the photocatalytic efficiency of methylene blue for wastewater treatment",
                            "authors": "Ummartyotin, S., Pechyen C.",
                            "year": 2016,
                            "journal": "Colloid and Polymer Science",
                            "pages": "1-8",
                            "impact_factor": 1.89
                        },
                        {
                            "title": "Soft template-assisted synthesis of polyvinylpyrrolidone−functionalized nano-scale ZnO particles",
                            "authors": "Ummartyotin, S., Pechyen C., Tommee S.",
                            "year": 2016,
                            "journal": "Russian Journal of Applied Chemistry",
                            "volume": 89,
                            "pages": "90-93",
                            "impact_factor": 0.312
                        },
                        {
                            "title": "Eggshell and bacterial cellulose composite",
                            "authors": "Ummartyotin S., Pisitsak P., Pechyen C.",
                            "year": 2016,
                            "journal": "Unknown",
                            "details": "Incomplete information"
                        }
                    ]
                }
            },
            {
                "category": "Research Themes",
                "subcategories": {
                    "Materials_Science": [
                        "Packaging materials",
                        "Composites",
                        "Nanoparticles",
                        "Biobased materials"
                    ],
                    "Applications": [
                        "Microwavable packaging",
                        "Wastewater treatment"
                    ],
                    "Compounds_Studied": [
                        "ZnO",
                        "Chitosan",
                        "Polypropylene",
                        "Calcium carbonate",
                        "Microcrystalline-cellulose",
                        "Nylon 6",
                        "Polyvinylpyrrolidone",
                        "Eggshell",
                        "Bacterial cellulose"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 63,
        "details": [
            {
                "category": "Publications",
                "subcategories": {
                    "Journal_Articles": [
                        {
                            "title": "Changes in Molecular Weight and Rheological Properties of Natural Rubber",
                            "journal": "Rheological Acta",
                            "volume": "55",
                            "pages": "641–648"
                        },
                        {
                            "title": "การจำลองทางคณิตศาสตร์ของสภาวะการไหลที่เหมาะสมเพื่อลดการเกิดตะกรันในอุตสาหกรรมนม",
                            "authors": "ณัฐพล จุลวก และ แคทลียา ปัทมพรหม",
                            "year": "2560",
                            "journal": "วารสารวิชาการพระจอมเกล้าพระนครเหนือ",
                            "volume": "27",
                            "pages": "417-430"
                        },
                        {
                            "title": "การศึกษาความเหมาะสมสำหรับการติดตั้งอุปกรณ์ลดอุณหภูมิอากาศด้านขาเข้าเครื่องผลิตไฟฟ้ากังหันก๊าซ เพื่อเพิ่มสมรรถนะการผลิตพลังงานไฟฟ้า",
                            "authors": "รัฐนนท์ นนท์ไพรวัล และ แคทลียา ปัทมพรหม",
                            "year": "2560",
                            "volume": "27(4)",
                            "pages": "699-706"
                        }
                    ],
                    "Conference_Proceedings": [
                        {
                            "title": "Synthesis of PLA-grafted Natural Rubber by Reactive Melt-Blending for Impact Modification Of PLA",
                            "authors": "Wongngam, Y., Pattamaprom, C.",
                            "year": "2017",
                            "conference": "The 7th International Polymer Conference of Thailand (PCT-7)",
                            "location": "Thailand",
                            "pages": "152-156"
                        },
                        {
                            "title": "The effectiveness of sodium carboxymethyl cellulose (CMC) as a co-antiscalant in sugar cane evaporators",
                            "authors": "Wichanroj, S., Pattamaprom, C.",
                            "year": "2015",
                            "conference": "PPS 31",
                            "location": "Korea",
                            "pages": "813-816"
                        },
                        {
                            "title": "Grafting of maleic anhydride onto natural rubber latex induced by gamma irradiation",
                            "authors": "Pongsathit, S., Pattamaprom, C.",
                            "year": "2015",
                            "conference": "PPS 31",
                            "location": "Korea",
                            "pages": "789-791"
                        },
                        {
                            "title": "Preparation of vinyl acetate grafted natural rubber by irradiation method",
                            "authors": "Porntrirat, A., Pattamaprom, C.",
                            "year": "2015",
                            "conference": "PPS 31",
                            "location": "Korea",
                            "pages": "782-786"
                        },
                        {
                            "title": "The Dynamic Vulcanization of Natural Rubber in The PLA/NR Blends",
                            "authors": "Kaewpimmuang, N., Pattamaprom, C.",
                            "year": "2015",
                            "conference": "PPS 31",
                            "location": "Korea",
                            "pages": "426-429"
                        },
                        {
                            "title": "Investigation of Heat Transfer Efficiency of Alumina Nanofluids in Shell and Tube Heat Exchanger",
                            "authors": "Danwittayakul, A. Pattamaprom, C.",
                            "year": "2015",
                            "proceedings": "International Proceedings of Chemical, biological & Environmental Engineering",
                            "volume": "82",
                            "pages": "68-72"
                        }
                    ]
                }
            },
            {
                "category": "Faculty",
                "subcategories": {
                    "Assistant_Professor": [
                        {
                            "name": "ดร.พัชราภรณ์ วุฒิเจริญมงคล",
                            "publications": [
                                {
                                    "title": "Release of Thiram Fungicide from Electrospun Cellulose Acetate Nanofiber Mats",
                                    "authors": "Thitiwongsawet, P., & Sribuajub, P.",
                                    "year": "2017",
                                    "journal": "KMUTTNB: International Journal of Applied Science and Technology",
                                    "issue": "Special issue",
                                    "pages": "121-127"
                                },
                                {
                                    "title": "Properties of Composite Films from Sugarcane Bagasse, Coconut Coir, and Water Hyacinth Fibers/Poly(Vinyl Chloride)",
                                    "authors": "Thitiwongsawet, P., Saetan, S., & Siangsanoh, P.",
                                    "year": "2017",
                                    "journal": "Materials Science Forum",
                                    "volume": "890",
                                    "pages": "196-203"
                                },
                                {
                                    "title": "Development of Novel PHBV/PCL and BCP Composite for Musculoskeletal Infection: an In Vitro Vancomycin Release and Anti-MRSA Effect",
                                    "authors": "Upho, N., Tangtrakulwanich, B., Pripatnanont, P., Thitiwongsawet, P., & Ingviya, N.",
                                    "year": "2015",
                                    "journal": "Journal of Pharmaceutical Innovation",
                                    "volume": "10(3)",
                                    "pages": "211-221"
                                }
                            ]
                        }
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 51,
        "details": [
            {
                "category": "เกณฑ์การสำเร็จการศึกษาตามหลักสูตร",
                "subcategories": {
                    "หน่วยกิตสะสม": {
                        "แผน_ก_แบบ_ก1": "ไม่น้อยกว่า 36 หน่วยกิต",
                        "แผน_ก_แบบ_ก2": "ไม่น้อยกว่า 38 หน่วยกิต"
                    },
                    "ค่าระดับเฉลี่ยสะสม": "ไม่ต่ำกว่า 3.00 (จากระบบ 4 ระดับคะแนนหรือเทียบเท่า)",
                    "ผลการเรียนรายวิชา": {
                        "รายวิชาโดยไม่นับหน่วยกิต_แผน_ก_แบบ_ก1": "ได้ค่าระดับ P (ผ่าน)",
                        "การสอบภาษาต่างประเทศ": "ได้ค่าระดับ P (ผ่าน) ตามเกณฑ์ที่มหาวิทยาลัยกำหนด",
                        "วิชาเสริมพื้นฐาน": "ได้ระดับ P (ผ่าน)",
                        "การสอบวิทยานิพนธ์": "ได้ระดับ S (ใช้ได้) ในการสอบปากเปล่าขั้นสุดท้าย"
                    },
                    "การสอบวิทยานิพนธ์": {
                        "วิธีการสอบ": "สอบปากเปล่าขั้นสุดท้าย โดยคณะกรรมการที่คณะวิศวกรรมศาสตร์แต่งตั้ง",
                        "ลักษณะการสอบ": "ระบบเปิดให้ผู้สนใจเข้ารับฟังได้",
                        "รูปแบบวิทยานิพนธ์": "ตามที่ห้องสมุดแห่งมหาวิทยาลัยธรรมศาสตร์กำหนด",
                        "การส่งวิทยานิพนธ์": "นำส่งเข้าระบบบริหารจัดการวิทยานิพนธ์ตามระเบียบมหาวิทยาลัยธรรมศาสตร์"
                    },
                    "การเผยแพร่ผลงานวิทยานิพนธ์": {
                        "แผน_ก_แบบ_ก1": {
                            "จำนวนผลงาน": "อย่างน้อย 2 เรื่อง",
                            "ประเภทการเผยแพร่": [
                                "วารสารวิชาการอย่างน้อย 1 เรื่อง",
                                "การประชุมวิชาการระดับนานาชาติที่มีรายงานการประชุม (Proceedings) อย่างน้อย 1 เรื่อง"
                            ],
                            "เงื่อนไขเพิ่มเติม": "กรณีผลงานในวารสารยังไม่มีการเผยแพร่ ต้องแสดงต้นฉบับและใบตอบรับให้ลงตีพิมพ์"
                        },
                        "แผน_ก_แบบ_ก2": {
                            "จำนวนผลงาน": "อย่างน้อย 1 เรื่อง",
                            "ประเภทการเผยแพร่": [
                                "ตีพิมพ์ในวารสารระดับชาติหรือระดับนานาชาติที่มีคุณภาพตามประกาศคณะกรรมการการอุดมศึกษา",
                                "นำเสนอต่อที่ประชุมวิชาการโดยบทความฉบับสมบูรณ์ (Full Paper) ได้รับการตีพิมพ์ในรายงานสืบเนื่องจากการประชุมวิชาการ (Proceedings)"
                            ]
                        }
                    },
                    "เงื่อนไขอื่นๆ": "ต้องปฏิบัติตามเงื่อนไขอื่นๆ ที่คณะและมหาวิทยาลัยธรรมศาสตร์กำหนด"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 4,
        "details": [
            {
                "category": "ข้อมูลอาจารย์",
                "subcategories": {
                    "อาจารย์_1": {
                        "เลขประจำตัวประชาชน": "3100501910xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-นามสกุล": "นางแคทลียา ปัทมพรหม",
                        "คุณวุฒิการศึกษา": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขา": "Chemical Engineering",
                                "สถาบัน": "University of Michigan Ann Arbor, U.S.A.",
                                "ปีที่จบ": 2544
                            },
                            {
                                "ระดับ": "M.Sc.",
                                "สาขา": "Chemical Engineering",
                                "สถาบัน": "University of Michigan, Ann Arbor, U.S.A.",
                                "ปีที่จบ": 2540
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปีที่จบ": 2537
                            }
                        ]
                    },
                    "อาจารย์_2": {
                        "เลขประจำตัวประชาชน": "3959900235xxx",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "ชื่อ-นามสกุล": "นางสาวพัชราภรณ์ วุฒิเจริญมงคล",
                        "คุณวุฒิการศึกษา": [
                            {
                                "ระดับ": "ปร.ด.",
                                "สาขา": "วิทยาศาสตร์พอลิเมอร์",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปีที่จบ": 2550
                            },
                            {
                                "ระดับ": "วท.บ.",
                                "สาขา": "เคมี",
                                "สถาบัน": "มหาวิทยาลัยสงขลานครินทร์",
                                "ปีที่จบ": 2546
                            }
                        ]
                    }
                }
            },
            {
                "category": "ข้อมูลหลักสูตร",
                "subcategories": {
                    "สถานที่จัดการเรียนการสอน": "คณะวิศวกรรมศาสตร์ มหาวิทยาลัยธรรมศาสตร์ ศูนย์รังสิต",
                    "สถานการณ์ภายนอกหรือการพัฒนาที่จำเป็นต้องนำมาพิจารณาในการวางแผนหลักสูตร": {
                        "สถานการณ์หรือการพัฒนาทางเศรษฐกิจ": [
                            "เป็นไปตามแผนพัฒนาเศรษฐกิจและสังคมแห่งชาติฉบับที่ 12 (พ.ศ. 2560-2564)",
                            "สอดคล้องกับยุทธศาสตร์ชาติ 20 ปี",
                            "มุ่งเน้นการสร้างภูมิคุ้มกันในประเทศให้เข้มแข็ง",
                            "เตรียมความพร้อมให้แก่คน สังคม และระบบเศรษฐกิจ",
                            "ปรับโครงสร้างประเทศไทยไปสู่ประเทศไทย 4.0",
                            "ยึดหลักปรัชญาของเศรษฐกิจพอเพียง"
                        ],
                        "สภาวการณ์สำคัญที่ต้องเร่งแก้ไขและเตรียมพร้อม": [
                            "การเปลี่ยนแปลงสภาพภูมิอากาศ",
                            "ปัญหาทรัพยากรธรรมชาติและสิ่งแวดล้อม",
                            "ความมั่นคงด้านอาหารและพลังงาน",
                            "การสร้างความร่วมมือในระดับภูมิภาค",
                            "การก้าวสู่สังคมผู้สูงอายุ"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 90,
        "details": [
            {
                "category": "หลักสูตรฉบับ พ.ศ. 2558 และ พ.ศ. 2561",
                "subcategories": {
                    "4_หมวดวิชาการคำนวณและคอมพิวเตอร์": {
                        "วค.645": {
                            "ชื่อวิชา_2558": "การคำนวณทางด้านวิศวกรรมเคมีเบื้องต้น",
                            "ชื่อวิชา_2561": "การคำนวณทางด้านวิศวกรรมเคมีเบื้องต้น",
                            "หน่วยกิต": "3(3-0-9)",
                            "การเปลี่ยนแปลง": "คงเดิม"
                        },
                        "วค.646": {
                            "ชื่อวิชา_2558": "โปรแกรมสำเร็จรูปในงานอุตสาหกรรม",
                            "ชื่อวิชา_2561": "โปรแกรมสำเร็จรูปในงานอุตสาหกรรม",
                            "หน่วยกิต": "3(3-0-9)",
                            "การเปลี่ยนแปลง": "คงเดิม"
                        },
                        "วค.648": {
                            "ชื่อวิชา_2561": "การออกแบบการทดลองสำหรับงานวิจัยทางวิศวกรรมเคมี",
                            "หน่วยกิต": "3(3-0-9)",
                            "การเปลี่ยนแปลง": "วิชาใหม่"
                        }
                    },
                    "5_หมวดวิชาสิ่งแวดล้อมและความปลอดภัย": {
                        "วค.654": {
                            "ชื่อวิชา": "การประเมินวงชีวิตผลิตภัณฑ์",
                            "หน่วยกิต": "3(3-0-9)",
                            "การเปลี่ยนแปลง": "คงเดิม"
                        },
                        "วค.655": {
                            "ชื่อวิชา": "การบำบัดมลพิษทางน้ำจากอุตสาหกรรม",
                            "หน่วยกิต": "3(3-0-9)",
                            "การเปลี่ยนแปลง": "คงเดิม"
                        },
                        "วค.656": {
                            "ชื่อวิชา": "การจัดการกากอุตสาหกรรม",
                            "หน่วยกิต": "3(3-0-9)",
                            "การเปลี่ยนแปลง": "คงเดิม"
                        },
                        "วค.657": {
                            "ชื่อวิชา": "การควบคุมมลพิษทางอากาศจากอุตสาหกรรม",
                            "หน่วยกิต": "3(3-0-9)",
                            "การเปลี่ยนแปลง": "คงเดิม"
                        }
                    },
                    "6_หมวดวิชาวิศวกรรมชีวเคมีและเทคโนโลยีชีวภาพ": {
                        "วค.663": {
                            "ชื่อวิชา": "วิศวกรรมชีวเคมี",
                            "หน่วยกิต": "3(3-0-9)",
                            "การเปลี่ยนแปลง": "คงเดิม"
                        },
                        "วค.664": {
                            "ชื่อวิชา_2558": "วิธีเชิงวิเคราะห์ในวิศวกรรมเคมีชีวภาพ",
                            "ชื่อวิชา_2561": "การจำลองแบบสิ่งแวดล้อม",
                            "หน่วยกิต": "3(3-0-9)",
                            "การเปลี่ยนแปลง": "ปรับชื่อและคำอธิบายรายวิชา"
                        }
                    },
                    "7_หมวดวิชาปัญหาพิเศษ": {
                        "วค.793": {
                            "ชื่อวิชา": "ปัญหาพิเศษทางวิจัยอุตสาหกรรมเคมี",
                            "หน่วยกิต": "3(3-0-9)",
                            "การเปลี่ยนแปลง": "คงเดิม"
                        },
                        "วค.794": {
                            "ชื่อวิชา": "ปฏิบัติการพิเศษทางอุตสาหกรรมเคมี",
                            "หน่วยกิต": "3(3-0-9)",
                            "การเปลี่ยนแปลง": "คงเดิม"
                        }
                    },
                    "4_วิทยานิพนธ์": {
                        "แผน_ก_แบบ_ก1": {
                            "รหัสวิชา": "วธ.803",
                            "ชื่อวิชา": "วิทยานิพนธ์",
                            "หน่วยกิต": "36 นก.",
                            "การเปลี่ยนแปลง": "คงเดิม"
                        },
                        "แผน_ก_แบบ_ก2": {
                            "รหัสวิชา": "วธ.804",
                            "ชื่อวิชา": "วิทยานิพนธ์",
                            "หน่วยกิต": "18 นก.",
                            "การเปลี่ยนแปลง": "คงเดิม"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 15,
        "details": [
            {
                "category": "แผนการศึกษา",
                "subcategories": {
                    "วิชาเสริมพื้นฐาน": {
                        "description": "ไม่นับหน่วยกิต (ส าหรับนักศึกษาแผน ก แบบ ก 1 และ ก 2)",
                        "รายวิชา": [
                            "วค 500 สมดุลมวลและพลังงาน 3 หน่วยกิต",
                            "วค 501 กลศาสตร์ของไหลส าหรับวิศวกรรมเคมี 3 หน่วยกิต",
                            "วค 502 การถ่ายเทความร้อน 3 หน่วยกิต",
                            "วค 503 วิศวกรรมปฏิกิริยา 3 หน่วยกิต",
                            "วค 504 การถ่ายโอนมวล 3 หน่วยกิต",
                            "วค 506 เธอร์โมไดนามิกส์วิศวกรรมเคมี 3 หน่วยกิต"
                        ],
                        "รวมหน่วยกิต": "18 หน่วยกิต"
                    },
                    "แผนการศึกษา_2_ปี": {
                        "ปีการศึกษาที่_1": {
                            "แผน_ก_แบบ_ก_1": {
                                "ภาคการศึกษาที่_1": [
                                    "วค 803 วิทยานิพนธ์ 9 หน่วยกิต",
                                    "วค 692 ระเบียบวิธีวิจัย 1 หน่วยกิต"
                                ],
                                "รวม": "10 หน่วยกิต",
                                "ภาคการศึกษาที่_2": [
                                    "วค 803 วิทยานิพนธ์ 9 หน่วยกิต",
                                    "วค. 791 สัมมนาบัณฑิตศึกษา 1 หน่วยกิต"
                                ],
                                "รวม_2": "10 หน่วยกิต"
                            },
                            "แผน_ก_แบบ_ก_2": {
                                "ภาคการศึกษาที่_1": [
                                    "วค 621 ปรากฏการณ์ถ่ายโอนขั้นกลาง 3 หน่วยกิต",
                                    "วค 631 จลนพลศาสตร์เคมีและการออกแบบเครื่องปฏิกรณ์เคมีขั้นกลาง 3 หน่วยกิต",
                                    "วค 647 การจ าลองกระบวนการเคมีและการประเมินทางเศรษฐศาสตร์ 3 หน่วยกิต",
                                    "วค 692 ระเบียบวิธีวิจัย 1 หน่วยกิต",
                                    "วค xxx วิชาเลือก 3 หน่วยกิต"
                                ],
                                "รวม": "13 หน่วยกิต",
                                "ภาคการศึกษาที่_2": [
                                    "วค 611 เธอร์โมไดนามิกส์วิศวกรรมเคมีขั้นกลาง 3 หน่วยกิต",
                                    "วค xxx วิชาเลือก 3 หน่วยกิต",
                                    "วค 804 วิทยานิพนธ์ 3 หน่วยกิต",
                                    "วค 791 สัมมนาบัณฑิตศึกษา 1 หน่วยกิต"
                                ],
                                "รวม_2": "10 หน่วยกิต"
                            }
                        },
                        "ปีการศึกษาที่_2": {
                            "แผน_ก_แบบ_ก_1": {
                                "ภาคการศึกษาที่_1": "ข้อมูลไม่ครบถ้วน"
                            },
                            "แผน_ก_แบบ_ก_2": {
                                "ภาคการศึกษาที่_1": "ข้อมูลไม่ครบถ้วน"
                            }
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 66,
        "details": [
            {
                "category": "บทความวิจัย",
                "subcategories": {
                    "ผู้ช่วยศาสตราจารย์ ดร.สุพิชชา รุ่งโรจน์นิมิตชัย": [
                        {
                            "title": "Rapid Preparation of Biosorbents with High Ion Exchange Capacity from Rice Straw and Bagasse for Removal of Heavy Metals",
                            "authors": "S. Rungrodnimitchai",
                            "publication": "The Scientific World Journal",
                            "year": 2014,
                            "details": "Article ID 634837, 1-9"
                        },
                        {
                            "title": "Chemically modified ground tire rubber as fluoride ions adsorbents",
                            "authors": "Rungrodnimitchai, S. and Kotatha, D.",
                            "publication": "Chemical Engineering Journal",
                            "year": 2015,
                            "details": "282, 161-169"
                        },
                        {
                            "title": "Novel Synthesis of Eu2+ Doped CaF Nanocrystals and Eu2+ Doped SrF2 Nanocrystals in Liquid Ammonia",
                            "authors": "Rungrodnimitchai, S., Kotatha, D., Dokbua, C., Hasegawa, Y., Nakanishi, T., Hirai, Y., Kawai, T.",
                            "publication": "Academic Journal of Sciences",
                            "year": 2015,
                            "details": "CD-ROM ISSN: 2165-6282, 04(02), 223-232"
                        },
                        {
                            "title": "Chemically Modification of Ground Tire Rubber",
                            "authors": "สุพิชชา รุ่งโรจน์นิมิตชัย และ ดิษพล โกตถา",
                            "publication": "วารสารวิชาการวิทยาศาสตร์และเทคโนโลยี มหาวิทยาลัยราชภัฏนครสวรรค์",
                            "year": 2558,
                            "details": "7, 143-156"
                        }
                    ],
                    "ผู้ช่วยศาสตราจารย์ ดร.พงศ์ธร ธูปะเตมีย์": [
                        {
                            "title": "Extraction and Development of Day-and-night Cream Containing Centellaasiatica and Tinosporacrispa Extracts",
                            "authors": "Darunee Kruasing, Dechathorn Klinhom, Pongtorn Dhupatemiya, Thunthida Nuamthong, Wuttipong Panitsettakorn, Suradwadee Thungmungmee",
                            "publication": "การประชุมสวนสุนันทา วิชาการระดับชาติด้าน \"การวิจัยเพื่อการพัฒนาอย่างยั่งยืน\" ครั้งที่ 4",
                            "year": 2559,
                            "details": "877-885 (วิทยาศาสตร์และเทคโนโลยี ฯ)"
                        },
                        {
                            "title": "Effects ofmicrowave absorbers on the torrefaction of highly moist municipal solid waste (MSW) pellets",
                            "authors": "Phichayanan Waiyanate, Pongtorn Dhupatemiya, and Prodpran Siritheerasas",
                            "publication": "The 6th International Thai Institute of Chemical Engineering and Applied Science Conference (ITIChE2016)",
                            "year": 2016,
                            "details": "299-304"
                        },
                        {
                            "title": "ผลกระทบของสารดูดกลืนคลื่นไมโครเวฟต่อกระบวนการให้ความร้อนที่อุณหภูมิต่่าของขยะชุมชนอัดแท่งที่มีความชื้นสูง",
                            "authors": "พิชญานันท์ ไวยเนตร, พงศ์ธร ธูปเตมีย์ และโปรดปราน สิริธีรศาสน์",
                            "publication": "Rajabhat J. Sci. Humanit. Soc. Sci.",
                            "year": 2017,
                            "details": "18(1), 131-146"
                        }
                    ],
                    "ผู้ช่วยศาสตราจารย์ ดร.ทิพบุษฏ์ เอกแสงศรี": [
                        {
                            "title": "Incomplete information",
                            "authors": "Siripond Phromma, Chaweewan Sapcharoenkun, Tuksadon Wutikhun, Panita",
                            "details": "Incomplete information provided"
                        }
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 7,
        "details": [
            {
                "category": "คุณลักษณะของบัณฑิตที่พึงประสงค์",
                "subcategories": {
                    "ความสามารถทางวิศวกรรมเคมี": "เป็นวิศวกรและนักวิจัยระดับสูงในสาขาวิชาวิศวกรรมเคมีที่สามารถพัฒนาเทคโนโลยีในภาคอุตสาหกรรมและแก้ปัญหาภาคการผลิตในเชิงลึกทั้งในอุตสาหกรรมเคมีและอุตสาหกรรมอื่นๆที่เกี่ยวข้อง",
                    "ความสามารถในการวิจัย": "มีความรู้ความสามารถในการพัฒนากิจกรรมงานวิจัยในสาขาวิชาวิศวกรรมเคมีและสาขาอื่นที่เกี่ยวข้อง เช่น วัสดุศาสตร์ พลังงาน ปิโตรเลียม สิ่งแวดล้อม และเทคโนโลยีชีวภาพ เป็นต้น",
                    "ความสามารถในการปรับตัว": "เป็นผู้ที่สามารถปรับตัวกับเทคโนโลยีสมัยใหม่ที่มีการเปลี่ยนแปลงตามยุคสมัยได้ง่าย"
                }
            },
            {
                "category": "แผนพัฒนาปรับปรุง",
                "subcategories": {
                    "การพัฒนาทักษะการแก้ปัญหาในอุตสาหกรรม": {
                        "กลยุทธ์": "ปรับเปลี่ยนแนวทางการวิจัยโดยเน้นการร่วมมือกับภาคอุตสาหกรรมเพื่อหาแนวทางการแก้ปัญหาของภาคอุตสาหกรรม",
                        "หลักฐาน/ตัวบ่งชี้": "ค าอธิบายรายวิชาในวิทยานิพนธ์ / จ านวนวิทยานิพนธ์ที่มีการน าปัญหาของอุตสาหกรรมมาศึกษาไม่น้อยกว่า 10%"
                    },
                    "การพัฒนาทักษะภาษาอังกฤษ": {
                        "กลยุทธ์": "ปรับเปลี่ยนข้อก าหนดในการส าเร็จการศึกษาโดยนักศึกษาจะต้องผ่านเกณฑ์ภาษาอังกฤษด้านการสื่อสารที่ก าหนดไว้",
                        "หลักฐาน/ตัวบ่งชี้": "ค าอธิบายในข้อก าหนดการจบการศึกษา / นักศึกษามีคะแนนการวัดผลภาษาอังกฤษทุกคน"
                    }
                }
            },
            {
                "category": "ระบบการจัดการศึกษา",
                "subcategories": {
                    "ระบบการศึกษา": "ใช้ระบบการศึกษาแบบทวิภาค โดย 1 ปีการศึกษาแบ่งออกเป็น 2 ภาคการศึกษาปกติ 1 ภาคการศึกษาปกติมีระยะเวลาศึกษาไม่น้อยกว่า 15 สัปดาห์",
                    "ภาคฤดูร้อน": "อาจเปิดภาคฤดูร้อนได้โดยใช้เวลาการศึกษาไม่น้อยกว่า 8 สัปดาห์ แต่ให้เพิ่มชั่วโมงการศึกษาในแต่ละรายวิชาให้เท่ากับภาคปกติ ภาคฤดูร้อนเป็นภาคการศึกษาที่ไม่บังคับ",
                    "การจัดการศึกษาภาคฤดูร้อน": "มีการจัดการเรียนการสอนภาคฤดูร้อน ทั้งนี้ขึ้นอยู่กับการพิจารณาของคณะกรรมการประจ าหลักสูตร",
                    "การเทียบเคียงหน่วยกิตในระบบทวิภาค": "ไม่มี"
                }
            },
            {
                "category": "การด าเนินการหลักสูตร",
                "subcategories": {
                    "วัน-เวลาในการด าเนินการเรียนการสอน": {
                        "ช่วงเวลา": "วัน – เวลาราชการปกติ",
                        "ภาคการศึกษาที่ 1": "เดือนสิงหาคม – พฤศจิกายน",
                        "ภาคการศึกษาที่ 2": "เดือนมกราคม – เมษายน",
                        "ภาคฤดูร้อน": "เดือนพฤษภาคม – กรกฎาคม"
                    },
                    "คุณสมบัติของผู้เข้าศึกษา": "คุณสมบัติของผู้เข้าศึกษาต้องเป็นไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ว่าด้วยการศึกษาระดับ"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 69,
        "details": [
            {
                "category": "อาจารย์",
                "subcategories": {
                    "ตรีกิตติ ไตรบุตร": {
                        "ผลงาน": [
                            "การเผาไหม้และการปล่อยก๊าซมลพิษของถ่านไม้ในเตาหุงต้มแบบต่างๆ, The 7th National Science Research Conference, 30-31 มีนาคม 2558"
                        ]
                    },
                    "โปรดปราน สิริธีรศาสน์": {
                        "ผลงาน": [
                            "Empirical Models for Predicting Electricity Consumption of Thammasat University, Rangsit (2557)",
                            "Technical, Economic, and Environmental Assessments of the Carbon Capture and Storage (2557)",
                            "การเผาไหม้และการปล่อยก๊าซมลพิษของถ่านไม้ในเตาหุงต้มแบบต่างๆ (2557)"
                        ]
                    },
                    "ธนิทธิ์ พิพัฒพันธุ์": {
                        "บทความวิจัย": [
                            "การหาสภาวะที่เหมาะสมของกระบวนการกลั่นและกระบวนการแยกน้ำในการผลิตเอทิลแอลกอฮอล์โดยใช้โปรแกรม Aspen Plus และ HYSYS (2557)",
                            "การทำนายค่าความสามารถในการละลายของคาร์บอนไดออกไซด์ ไนโตรเจน และมีเทนในน้ำบริสุทธิ์และน้ำเกลือ ตามสมการของ Zhenhoa Duan และ Pitzer (2557)",
                            "การประยุกต์ใช้สมการสภาวะ Peng-Robinson ในการทำนายสมดุลเฟสของคาร์บอนไดออกไซด์เหนือจุดวิกฤตในน้ำมันปาล์มและน้ำมันเมล็ดปาล์มด้วยโปรแกรม MATLAB (2558)",
                            "การจำลองการผลิตไฮโดรเจนจากชีวมวลด้วยกระบวนการแก็สซิฟิเคชั่นแบบหมุนเวียนสารเคมีโดยใช้โปรแกรม Aspen Plus (2559)"
                        ]
                    },
                    "ไพรัช อุศุภรัตน์": {
                        "ตำแหน่ง": "ผู้ช่วยศาสตราจารย์ ดร."
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 31,
        "details": [
            {
                "category": "อาจารย์",
                "subcategories": [
                    {
                        "ลำดับ": "4",
                        "เลขประจำตัวประชาชน": "3101600634xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "นายประภัสสร์ วังศกาญจน์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "D.Eng.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "Cleveland State University, U.S.A.",
                                "ปี": "2532"
                            },
                            {
                                "ระดับ": "M.S.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "Oregon State University, U.S.A.",
                                "ปี": "2528"
                            },
                            {
                                "ระดับ": "วท.บ.",
                                "สาขาวิชา": "เทคโนโลยีอาหารและเทคโนโลยีชีวภาพ",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2524"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "5",
                        "เลขประจำตัวประชาชน": "3100900248xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "นายสาธก ไชยกุลชื่นสกุล",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "Polytechnic University, U.S.A.",
                                "ปี": "2543"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "Stevens Institute of Technology, U.S.A.",
                                "ปี": "2537"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2535"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "6",
                        "เลขประจำตัวประชาชน": "3100100768xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "นายภาณุ ด่านวานิชกุล",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Pennsylvania, U.S.A.",
                                "ปี": "2546"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Delaware, U.S.A.",
                                "ปี": "2541"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2537"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "7",
                        "เลขประจำตัวประชาชน": "3100502911xxx",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "ชื่อ-สกุล": "นางสุพิชชา รุ่งโรจน์นิมิตชัย",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Material and Life Science Engineering",
                                "สถาบัน": "Osaka University, Japan",
                                "ปี": "2546"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 34,
        "details": [
            {
                "category": "อาจารย์",
                "subcategories": [
                    {
                        "ลำดับที่": "17",
                        "เลขประจำตัวประชาชน": "3302000235xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "นางสาววรณี แพ่งจันทึก",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "ปร.ด.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2551"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "มหาวิทยาลัยขอนแก่น",
                                "ปี": "2547"
                            },
                            {
                                "ระดับ": "วท.บ.",
                                "สาขาวิชา": "เทคโนโลยีปิโตรเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2539"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "18",
                        "เลขประจำตัวประชาชน": "3909900753xxx",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "ชื่อ-สกุล": "นางสาวภณิดา ซ้ายขวัญ",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Cambridge",
                                "ประเทศ": "United Kingdom",
                                "ปี": "2551"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Cambridge",
                                "ประเทศ": "United Kingdom",
                                "ปี": "2547"
                            },
                            {
                                "ระดับ": "B.Eng.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Cambridge",
                                "ประเทศ": "United Kingdom",
                                "ปี": "2546"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "19",
                        "เลขประจำตัวประชาชน": "3100501086xxx",
                        "ตำแหน่งทางวิชาการ": "อาจารย์",
                        "ชื่อ-สกุล": "นายบรรพต ศิริณัฐสมบูรณ์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Biological Systems Engineering",
                                "สถาบัน": "University of California-Davis",
                                "ประเทศ": "U.S.A.",
                                "ปี": "2554"
                            },
                            {
                                "ระดับ": "B.S.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Michigan – Ann Arbor",
                                "ประเทศ": "U.S.A.",
                                "ปี": "2548"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "20",
                        "เลขประจำตัวประชาชน": "31020363xxx",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "ชื่อ-สกุล": "ชาญณรงค์ อัศวเทศานุภาพ",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Mechanical Engineering",
                                "สถาบัน": "University of Southern California",
                                "ปี": "2545"
                            },
                            {
                                "ระดับ": "วศ.ม.",
                                "สาขาวิชา": "วิศวกรรมเครื่องกล",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2538"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 37,
        "details": [
            {
                "category": "อาจารย์พิเศษและผู้ทรงคุณวุฒิ",
                "subcategories": {
                    "การจัดการเรียนการสอน": "ใช้อาจารย์ประจำเป็นหลัก (มากกว่า 90%)",
                    "การเชิญผู้ทรงคุณวุฒิ": "อาจมีการเชิญผู้ทรงคุณวุฒิที่มีประสบการณ์ในด้านต่าง ๆ จากภายนอกในบางส่วนของบางรายวิชา",
                    "วัตถุประสงค์": "เพื่อเปิดโลกทัศน์การเรียนรู้แก่นักศึกษาให้กว้างขวางขึ้น"
                }
            },
            {
                "category": "องค์ประกอบเกี่ยวกับประสบการณ์ภาคสนาม",
                "subcategories": {
                    "รายวิชา": "รายวิชาปฏิบัติการพิเศษ อยู่ในกลุ่มวิชาเลือก",
                    "วัตถุประสงค์": "เพื่อเปิดโอกาสให้นักศึกษาที่ต้องการพัฒนาในส่วนนี้ได้เลือกที่จะเพิ่มพูนความมั่นใจในตนเอง พัฒนาความสามารถในด้านการปรับตัวเข้ากับผู้อื่นหรือสังคมในการทำงาน"
                }
            },
            {
                "category": "มาตรฐานผลการเรียนรู้ของประสบการณ์ภาคสนาม",
                "subcategories": {
                    "ทักษะ": "ทักษะในการปฏิบัติงานจากสถานประกอบการ ตลอดจนการฝึกฝนการนำทฤษฎีมาประมวลผลและประยุกต์ใช้มากยิ่งขึ้น",
                    "การบูรณาการความรู้": "บูรณาการความรู้ที่เรียนมาเพื่อนำไปแก้ปัญหาทางอุตสาหกรรมได้อย่างเหมาะสม",
                    "มนุษยสัมพันธ์": "มีมนุษยสัมพันธ์และสามารถทำงานร่วมกับผู้อื่นได้ดี",
                    "ระเบียบวินัย": "มีระเบียบวินัย ตรงเวลา เข้าใจวัฒนธรรมและสามารถปรับตัวเข้ากับสถานประกอบการได้",
                    "ความกล้าแสดงออก": "มีความกล้าในการแสดงออก และนำความคิดสร้างสรรค์ไปใช้ประโยชน์ในงานได้"
                }
            },
            {
                "category": "ช่วงเวลาและการจัดเวลา",
                "subcategories": {
                    "ภาคการศึกษา": "ภาคการศึกษาที่ 2 หรือภาคฤดูร้อนของปีการศึกษาที่ 1",
                    "การจัดเวลา": "3 วันต่อสัปดาห์ในภาคเรียนที่ 2 หรือเต็มเวลาในภาคฤดูร้อน"
                }
            },
            {
                "category": "ข้อกำหนดเกี่ยวกับการทำวิทยานิพนธ์",
                "subcategories": {
                    "ลักษณะงาน": "การวิจัยเชิงปฏิบัติการในสาขาวิชาวิศวกรรมเคมี",
                    "การควบคุม": "ภายใต้การดูแลปรึกษาของอาจารย์ผู้ควบคุม",
                    "กิจกรรม": "การสร้างโครงการวิจัยหรือการวิจัยเชิงปฏิบัติการ เขียนและนำเสนอวิทยานิพนธ์ การเขียนรายงานวิจัยเพื่อเผยแพร่",
                    "จริยธรรม": "จริยธรรมในการทำวิจัย และในการเผยแพร่ผลงานทางวิชาการ"
                }
            },
            {
                "category": "มาตรฐานผลการเรียนรู้ของการทำวิทยานิพนธ์",
                "subcategories": {
                    "ผลงาน": "สามารถผลิตผลงานวิทยานิพนธ์ อันก่อให้เกิดองค์ความรู้ใหม่ในสาขาวิชาวิศวกรรมเคมี",
                    "การวิเคราะห์": "สามารถวิเคราะห์และเรียบเรียงผลงานวิจัยเพื่อเผยแพร่ได้",
                    "กระบวนการ": "สามารถมีกระบวนการในการเก็บข้อมูล วิเคราะห์ และพัฒนาแนวทาง หรือวิธีการ หรือกระบวนการ หรือองค์ความรู้ใหม่ ๆ",
                    "การทดสอบ": "มีการทดสอบ พิสูจน์ ยืนยันความถูกต้อง และความน่าเชื่อถือ"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 46,
        "details": [
            {
                "category": "ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ",
                "subcategories": {
                    "การช่วยเหลือและอำนวยความสะดวก": "สามารถให้ความช่วยเหลือและอำนวยความสะดวกในการแก้ปัญหาสถานการณ์ต่างๆ ทั้งในบทบาทของผู้นำ หรือในบทบาทของผู้ร่วมทีมทำงาน",
                    "การใช้ความรู้ชี้นำสังคม": "สามารถใช้ความรู้ในศาสตร์มาชี้นำสังคมในประเด็นที่เหมาะสม",
                    "ความรับผิดชอบ": "มีความรับผิดชอบในการกระทำของตนเองและรับผิดชอบงานในกลุ่ม",
                    "การริเริ่มและแสดงจุดยืน": "สามารถเป็นผู้ริเริ่มแสดงประเด็นในการแก้ไขสถานการณ์ทั้งส่วนตัวและส่วนรวม พร้อมทั้งแสดงจุดยืนอย่างพอเหมาะทั้งของตนเองและของกลุ่ม",
                    "การพัฒนาตนเอง": "มีความรับผิดชอบการพัฒนาการเรียนรู้ทั้งของตนเองและทางวิชาชีพอย่างต่อเนื่อง"
                }
            },
            {
                "category": "ทักษะการวิเคราะห์เชิงตัวเลข การสื่อสาร และการใช้เทคโนโลยีสารสนเทศ",
                "subcategories": {
                    "ทักษะการคำนวณและวิเคราะห์": "มีทักษะในการคำนวณและวิเคราะห์ผลโดยใช้เครื่องคำนวณและคอมพิวเตอร์",
                    "ทักษะการสื่อสาร": "สามารถสื่อสารอย่างมีประสิทธิภาพทั้งปากเปล่าและการเขียน พร้อมทั้งเลือกใช้รูปแบบของสื่อการนำเสนอได้อย่างเหมาะสม",
                    "การใช้เทคโนโลยีสารสนเทศ": "สามารถใช้สารสนเทศและเทคโนโลยีสื่อสารอย่างเหมาะสม"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 23,
        "details": [
            {
                "category": "วค 643 อุปกรณ์และเครื่องมือวัดในกระบวนการผลิตของอุตสาหกรรมเคมี",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "AE 643 Industrial Process Equipment and Instrument in Chemical Industries",
                    "หน่วยกิต": "(3-0-9)",
                    "เนื้อหา": {
                        "ภาพรวม": "ภาพรวมของกระบวนการออกแบบและการเริ่มการผลิตของโรงงานในอุตสาหกรรมเคมีและปิโตรเคมี",
                        "การวิเคราะห์และออกแบบ": "การวิเคราะห์และออกแบบ PFD และ P&ID",
                        "หลักการวัดและการเลือกใช้อุปกรณ์": "หลักการวัดและการเลือกใช้อุปกรณ์การวัดและอุปกรณ์ควบคุมกระบวนการ",
                        "อุปกรณ์การวัดและควบคุม": "อุปกรณ์การวัดและควบคุมอุณหภูมิ ความดัน ระดับ และอัตราการไหลในเชิงอุตสาหกรรม",
                        "พื้นฐานระบบ": "พื้นฐานระบบท่อ ปั๊มและถังรับความดัน",
                        "การออกแบบ": "การออกแบบเครื่องแลกเปลี่ยนความร้อน"
                    }
                }
            },
            {
                "category": "วค 645 การคำนวณทางด้านวิศวกรรมเคมีเบื้องต้น",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "AE 645 Introduction to Chemical Engineering Computing",
                    "หน่วยกิต": "3(3-0-9)",
                    "เนื้อหา": {
                        "การใช้โปรแกรม": "ใช้โปรแกรมสเปรดชีทและโปรแกรมอื่นๆ ที่เหมาะสมในการแก้โจทย์ปัญหาทางด้านวิศวกรรมเคมี",
                        "หัวข้อที่เกี่ยวข้อง": [
                            "สมดุลมวลและพลังงาน",
                            "เธอร์โมไดนามิกส์",
                            "จลนพลศาสตร์และการออกแบบปฏิกรณ์",
                            "การจำลองกระบวนการถ่ายโอน"
                        ],
                        "วิธีการแก้ปัญหา": [
                            "การลองผิดลองถูก",
                            "การแก้สมการอนุพันธ์",
                            "การประมาณหาค่าพารามิเตอร์ด้วยวิธีเชิงเส้นและไม่เชิงเส้น"
                        ]
                    }
                }
            },
            {
                "category": "วค 646 โปรแกรมสำเร็จรูปในงานอุตสาหกรรม",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "AE 646 Softwares in Industrial Practices",
                    "หน่วยกิต": "3(3-0-9)",
                    "เนื้อหา": {
                        "วัตถุประสงค์": "ฝึกใช้โปรแกรมสำเร็จรูปที่ทันสมัยเพื่อประเมินการทำงานในอุตสาหกรรมเคมี",
                        "ตัวอย่างการประเมิน": [
                            "การประเมินกระบวนการและจัดขั้นตอนการทำงาน",
                            "การอนุรักษ์พลังงานแบบองค์รวมของกระบวนการ",
                            "การประเมินระบบท่อในอุตสาหกรรม",
                            "การประเมินระบบการระบายสาร",
                            "การประเมินความเสี่ยง"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 60,
        "details": [
            {
                "category": "การประเมินและปรับปรุงการดำเนินการของหลักสูตร",
                "subcategories": {
                    "การประเมินประสิทธิผลของการสอน": {
                        "การประเมินกลยุทธ์การสอน": [
                            "มีการประชุมร่วมของอาจารย์ในภาควิชาเพื่อแลกเปลี่ยนความคิดเห็น และขอคำแนะนำ/ข้อเสนอแนะของอาจารย์ที่มีความรู้ในการใช้กลยุทธ์การสอน",
                            "การสอบถามจากนักศึกษา ถึงประสิทธิผลของการเรียนรู้จากวิธีการที่ใช้ โดยใช้แบบสอบถามหรือการสนทนากับกลุ่มนักศึกษาระหว่างภาคการศึกษา โดยอาจารย์ผู้สอน",
                            "ประเมินจากการเรียนรู้ของนักศึกษา จากการทำกิจกรรม และผลการสอบ"
                        ],
                        "การประเมินทักษะของอาจารย์ในการใช้แผนกลยุทธ์การสอน": "ทำการสำรวจเพื่อประเมินประสิทธิภาพการสอนของคณาจารย์ โดยแจกแบบประเมินให้กับนักศึกษาในแต่ละรายวิชาก่อนสิ้นภาคการศึกษา ข้อมูลที่ได้จะถูกวิเคราะห์โดยคณะวิศวกรรมศาสตร์ และส่งให้คณาจารย์ผู้สอนแต่ละคนในภาคการศึกษาถัดไปเพื่อใช้เป็นผลป้อนกลับในการปรับปรุงการสอนและรายวิชาของตน"
                    },
                    "การประเมินหลักสูตรในภาพรวม": {
                        "วิธีการประเมิน": "การประเมินหลักสูตรในภาพรวม โดยสำรวจข้อมูลจาก",
                        "แหล่งข้อมูล": [
                            "นักศึกษาปีสุดท้าย/ บัณฑิตใหม่",
                            "ผู้ว่าจ้าง",
                            "ผู้ทรงคุณวุฒิภายนอก"
                        ]
                    },
                    "การประเมินผลการดำเนินงานตามรายละเอียดหลักสูตร": "เป็นไปตามการประเมินคุณภาพหลักสูตรตามเกณฑ์มาตรฐานของ สกอ.",
                    "การทบทวนผลการประเมินและวางแผนปรับปรุง": "กระบวนการทบทวนผลการประเมินที่ได้จากอาจารย์และนักศึกษา"
                }
            },
            {
                "category": "ดัชนีบ่งชี้ผลการดำเนินงาน",
                "subcategories": {
                    "ระดับความพึงพอใจของนักศึกษาปีสุดท้าย/บัณฑิตใหม่": "เฉลี่ยไม่น้อยกว่า 3.51 จากคะแนนเต็ม 5.0",
                    "ระดับความพึงพอใจของผู้ใช้บัณฑิตที่มีต่อบัณฑิตใหม่": "เฉลี่ยไม่น้อยกว่า 3.51 จากคะแนนเต็ม 5.0"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 6,
        "details": [
            {
                "category": "หมวดที่ 2 ข้อมูลเฉพาะของหลักสูตร",
                "subcategories": {
                    "1. ปรัชญา ความสำคัญ และวัตถุประสงค์ของหลักสูตร": {
                        "1.1 ปรัชญา": "หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมเคมี คณะวิศวกรรมศาสตร์ มหาวิทยาลัยธรรมศาสตร์มุ่งเน้นเพื่อส่งเสริมให้บัณฑิตเป็นผู้ที่คิดเป็น มีความสามารถด้านการคิดค้นวิจัยอย่างเป็นระบบรองรับการพัฒนางานวิจัยในภาคอุตสาหกรรม และมีความรู้พื้นฐานด้านวิศวกรรมที่เหมาะสม",
                        "1.2 ความสำคัญ": "อธิบายถึงความสำคัญของหลักสูตรในบริบทของสถานการณ์พลังงาน เศรษฐกิจโลก และความต้องการในภาคอุตสาหกรรม รวมถึงความสำคัญของสาขาวิศวกรรมเคมีในการพัฒนาเทคโนโลยีและการปรับตัวกับเทคโนโลยีสมัยใหม่",
                        "1.3 วัตถุประสงค์ของหลักสูตร": "เพื่อให้มหาบัณฑิตที่สำเร็จการศึกษาในหลักสูตรมีลักษณะดังนี้ (รายละเอียดไม่ได้ระบุในเอกสารที่ให้มา)"
                    }
                }
            },
            {
                "category": "13. ความสัมพันธ์กับหลักสูตรอื่นที่เปิดสอนในวิทยาลัย/คณะ/ภาควิชาอื่น",
                "subcategories": {
                    "13.2 รายวิชาในหลักสูตรที่เปิดสอนให้วิทยาลัย/คณะ/ภาควิชา/หลักสูตรอื่นต้องมาเรียน": "-ไม่มี-",
                    "13.3 การบริหารจัดการ": "-ไม่มี-"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 86,
        "details": [
            {
                "category": "การแต่งตั้งอาจารย์ที่ปรึกษาวิทยานิพนธ์",
                "subcategories": {
                    "หลักสูตรฉบับ_พ.ศ._2558": "แต่งตั้งอาจารย์ที่ปรึกษาวิทยานิพนธ์ ซึ่งจะให้คำแนะนำนักศึกษา รวมทั้งสอบเค้าโครงวิทยานิพนธ์ และสอบวิทยานิพนธ์ และแต่งตั้งคณะกรรมการสอบวิทยานิพนธ์ รวมไม่น้อยกว่า 4 ท่าน",
                    "หลักสูตรฉบับ_พ.ศ._2561": "แต่งตั้งอาจารย์ที่ปรึกษาวิทยานิพนธ์ ซึ่งจะให้คำแนะนำนักศึกษา รวมทั้งสอบเค้าโครงวิทยานิพนธ์ และสอบวิทยานิพนธ์ และแต่งตั้งคณะกรรมการสอบวิทยานิพนธ์ รวมไม่น้อยกว่า 3 ท่าน ซึ่งประกอบด้วย อาจารย์ที่ปรึกษาวิทยานิพนธ์ อาจารย์ประจำหลักสูตรและผู้ทรงคุณวุฒิจากภายนอกมหาวิทยาลัย"
                }
            },
            {
                "category": "อาจารย์ที่ปรึกษาวิทยานิพนธ์",
                "subcategories": {
                    "หลักสูตรฉบับ_พ.ศ._2558": "ประกอบด้วย อาจารย์ที่ปรึกษาวิทยานิพนธ์หลัก และ/หรือ อาจารย์ที่ปรึกษาวิทยานิพนธ์ร่วม โดยต้องมีคุณสมบัติเป็นไปตามเกณฑ์มาตรฐานหลักสูตรระดับบัณฑิตศึกษาของสำนักงานคณะกรรมการการอุดมศึกษา",
                    "หลักสูตรฉบับ_พ.ศ._2561": "ประกอบด้วย อาจารย์ที่ปรึกษาวิทยานิพนธ์หลัก และ/หรือ อาจารย์ที่ปรึกษาวิทยานิพนธ์ร่วม โดยต้องมีคุณสมบัติเป็นไปตามเกณฑ์มาตรฐานหลักสูตรระดับบัณฑิตศึกษาของสำนักงานคณะกรรมการการอุดมศึกษา"
                }
            },
            {
                "category": "การสอบวิทยานิพนธ์",
                "subcategories": {
                    "คณะกรรมการสอบวิทยานิพนธ์": "ประกอบด้วย อาจารย์ที่ปรึกษาวิทยานิพนธ์ อาจารย์ประจำหลักสูตร และผู้ทรงคุณวุฒิภายนอก อย่างน้อย 3 คน โดยมีคุณสมบัติเป็นไปตามเกณฑ์มาตรฐานหลักสูตรระดับบัณฑิตศึกษาของสำนักงานคณะกรรมการการอุดมศึกษา และข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาระดับบัณฑิตศึกษา พ.ศ. 2561",
                    "เงื่อนไขการสอบ": "นักศึกษาจะสอบวิทยานิพนธ์ได้เมื่อสอบภาษาต่างประเทศผ่านแล้ว",
                    "ลักษณะการสอบ": "เป็นการสอบปากเปล่า และเป็นระบบเปิดให้ผู้สนใจเข้าร่วมฟังได้โดยให้เป็นไปตามระเบียบและและข้อบังคับของมหาวิทยาลัยธรรมศาสตร์ และการสอบวิทยานิพนธ์ที่จะได้ผลระดับ S ต้องได้มติเป็นเอกฉันท์จากคณะกรรมการสอบวิทยานิพนธ์",
                    "การจัดทำวิทยานิพนธ์": "ให้เป็นไปตามรูปแบบที่ห้องสมุดแห่งมหาวิทยาลัยธรรมศาสตร์กำหนด และนำส่งวิทยานิพนธ์เข้าระบบบริหารจัดการวิทยานิพนธ์ให้มหาวิทยาลัยธรรมศาสตร์ตามระเบียบมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยวิทยานิพนธ์ สารนิพนธ์ และการค้นคว้าอิสระ พ.ศ. 2559"
                }
            },
            {
                "category": "การตีพิมพ์ผลงานวิทยานิพนธ์",
                "subcategories": {
                    "แผน_ก1": "ผลงานวิทยานิพนธ์หรือส่วนหนึ่งของวิทยานิพนธ์ต้องได้รับการตีพิมพ์ หรืออย่างน้อยได้รับการยอมรับให้ตีพิมพ์ในวารสารระดับชาติหรือระดับนานาชาติที่มีคุณภาพตามประกาศคณะกรรมการการอุดมศึกษา เรื่องหลักเกณฑ์การพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ",
                    "แผน_ก_แบบ_ก_2": "ผลงานวิทยานิพนธ์หรือส่วนหนึ่งของวิทยานิพนธ์ต้องได้รับการตีพิมพ์ หรืออย่างน้อยได้รับการยอมรับให้ตีพิมพ์ในวารสารระดับชาติหรือระดับนานาชาติที่มีคุณภาพตามประกาศคณะกรรมการการอุดมศึกษา เรื่อง หลักเกณฑ์การพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ หรือนำเสนอต่อที่ประชุมวิชาการโดยบทความที่นำเสนอฉบับสมบูรณ์ (Full Paper) ได้รับการตีพิมพ์ในรายงานสืบเนื่องจากการประชุมวิชาการ (Proceedings)"
                }
            },
            {
                "category": "เกณฑ์การสำเร็จการศึกษา",
                "subcategories": {
                    "การเปลี่ยนแปลง": "ปรับเงื่อนไขการนำเสนอ ตีพิมพ์และนำส่ง"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 32,
        "details": [
            {
                "category": "อาจารย์",
                "subcategories": [
                    {
                        "ลำดับ": "8",
                        "เลขประจำตัวประชาชน": "3100501000xxx",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "ชื่อ-สกุล": "นายพงศ์ธร ธูปะเตมีย์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "D.Eng.",
                                "สาขาวิชา": "Materials Process Engineering",
                                "สถาบัน": "Kyushu University, Japan",
                                "ปี": "2543"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Engineering, Hydrocarbon Chemistry",
                                "สถาบัน": "Kyoto University, Japan",
                                "ปี": "2535"
                            },
                            {
                                "ระดับ": "B.Eng.",
                                "สาขาวิชา": "Engineering",
                                "สถาบัน": "Kyoto University, Japan",
                                "ปี": "2533"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "9",
                        "เลขประจำตัวประชาชน": "3101700601xxx",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "ชื่อ-สกุล": "นางสาวทิพบุษฎ์ เอกแสงศรี",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "D.Eng.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "Tokyo Institute of Technology, Japan",
                                "ปี": "2547"
                            },
                            {
                                "ระดับ": "M.S.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "New Jersey Institute of Technology, U.S.A.",
                                "ปี": "2537"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2535"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "10",
                        "เลขประจำตัวประชาชน": "3101400826xxx",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "ชื่อ-สกุล": "นางสาววรรัตน์ ปัตรประกร",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "D.Eng.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "Tokyo Institute of Technology, Japan",
                                "ปี": "2548"
                            },
                            {
                                "ระดับ": "วศ.ม.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2539"
                            },
                            {
                                "ระดับ": "วท.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี/เคมีเทคนิค",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2537"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "11",
                        "เลขประจำตัวประชาชน": "3559900130xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "นายนุรักษ์ กฤษดานุรักษ์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical and Petroleum-Refining Engineering",
                                "สถาบัน": "The University Colorado School of Mines, U.S.A.",
                                "ปี": "2539"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "สถาบันเทคโนโลยี",
                                "ปี": "2532"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 13,
        "details": [
            {
                "category": "หมวดวิชาวิศวกรรมพอลิเมอร์ และวัสดุศาสตร์",
                "subcategories": {
                    "วค_630": {
                        "ชื่อวิชา": "เทคนิคการหาลักษณะเฉพาะของพื้นผิวของแข็ง",
                        "ชื่อวิชาภาษาอังกฤษ": "Characterization Technique of Solid Surface",
                        "หน่วยกิต": "3(3-0-9)"
                    },
                    "วค_634": {
                        "ชื่อวิชา": "วิทยาการตัวเร่งปฏิกิริยา",
                        "ชื่อวิชาภาษาอังกฤษ": "Catalysis Sciences",
                        "หน่วยกิต": "3(3-0-9)"
                    },
                    "วค_637": {
                        "ชื่อวิชา": "วิทยาการวัสดุศาสตร์ขั้นกลาง",
                        "ชื่อวิชาภาษาอังกฤษ": "Intermediate Material Sciences",
                        "หน่วยกิต": "3(3-0-9)"
                    },
                    "วค_638": {
                        "ชื่อวิชา": "รีโอโลยีและกระบวนการขึ้นรูปของพอลิเมอร์",
                        "ชื่อวิชาภาษาอังกฤษ": "Rheology and Processing of Polymer",
                        "หน่วยกิต": "3(3-0-9)"
                    },
                    "วค_639": {
                        "ชื่อวิชา": "เทคโนโลยียางและกาว",
                        "ชื่อวิชาภาษาอังกฤษ": "Rubber and Adhesive Technology",
                        "หน่วยกิต": "3(3-0-9)"
                    }
                }
            },
            {
                "category": "หมวดวิชาคณิตศาสตร์และการควบคุมระบบ",
                "subcategories": {
                    "วค_643": {
                        "ชื่อวิชา": "อุปกรณ์และเครื่องมือวัดในกระบวนการผลิตของอุตสาหกรรมเคมี",
                        "ชื่อวิชาภาษาอังกฤษ": "Industrial Process Equipment and Instrument in Chemical Industries",
                        "หน่วยกิต": "3(3-0-9)"
                    },
                    "วค_645": {
                        "ชื่อวิชา": "การคำนวณทางด้านวิศวกรรมเคมีเบื้องต้น",
                        "ชื่อวิชาภาษาอังกฤษ": "Introduction to Chemical Engineering Computing",
                        "หน่วยกิต": "3(3-0-9)"
                    },
                    "วค_646": {
                        "ชื่อวิชา": "โปรแกรมสำเร็จรูปในงานอุตสาหกรรม",
                        "ชื่อวิชาภาษาอังกฤษ": "Softwares in Industrial Practices",
                        "หน่วยกิต": "3(3-0-9)"
                    },
                    "วค_648": {
                        "ชื่อวิชา": "การออกแบบการทดลองสำหรับงานวิจัยทางวิศวกรรมเคมี",
                        "ชื่อวิชาภาษาอังกฤษ": "Design of Experiments for Chemical Engineering Research",
                        "หน่วยกิต": "3(3-0-9)"
                    }
                }
            },
            {
                "category": "หมวดวิชาสิ่งแวดล้อมและความปลอดภัย",
                "subcategories": {}
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 8,
        "details": [
            {
                "category": "คุณสมบัติผู้เข้าศึกษา",
                "subcategories": {
                    "แผน_ก_แบบ_ก_1": {
                        "1": "เป็นผู้ที่สำเร็จการศึกษาวิศวกรรมศาสตรบัณฑิต (วศ.บ.) สาขาวิศวกรรมเคมี ที่มีเกรดเฉลี่ยตลอดหลักสูตรไม่น้อยกว่า 2.75 จาก 4.00",
                        "2": "เป็นผู้ที่สำเร็จการศึกษาวิศวกรรมศาสตรบัณฑิต (วศ.บ.) สาขาวิศวกรรมเคมี ที่มีเกรดเฉลี่ยตลอดหลักสูตรไม่น้อยกว่า 2.50 จาก 4.00 และมีเกรดในวิชาโครงงานในระดับ A",
                        "3": "เป็นผู้ที่สำเร็จการศึกษาวิทยาศาสตรบัณฑิต (วท.บ.) หรือครุศาสตรอุตสาหกรรมบัณฑิต (คอ.บ.) หรือเทียบเท่า ที่มีเกรดเฉลี่ยไม่น้อยกว่า 3.00 จาก 4.00"
                    },
                    "แผน_ก_แบบ_ก_2": {
                        "1": "เป็นผู้ที่สำเร็จการศึกษาวิศวกรรมศาสตรบัณฑิต (วศ.บ.) หรือ วิทยาศาสตรบัณฑิต (วท.บ.) หรือครุศาสตรอุตสาหกรรมบัณฑิต (คอ.บ.) หรือเทียบเท่า",
                        "2": "กำลังศึกษาอยู่ในภาคการศึกษาสุดท้ายของหลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) หรือวิทยาศาสตรบัณฑิต (วท.บ.) หรือครุศาสตรอุตสาหกรรมบัณฑิต (คอ.บ.) หรือเทียบเท่า",
                        "3": "ผู้ที่มีสมบัติตามข้อ (1) หรือ (2) ต้องมีเกรดเฉลี่ยตลอดหลักสูตรไม่น้อยกว่า 2.50 หรือคณะกรรมการประจำหลักสูตรอาจพิจารณาผู้ที่มีคุณสมบัติโดดเด่นเป็นพิเศษโดยพิจารณาจากผลงานทางวิชาการหรือคุณสมบัติอื่นที่เหมาะสมต่อการศึกษาให้มีสิทธิสมัครได้"
                    }
                }
            },
            {
                "category": "การคัดเลือกผู้เข้าศึกษา",
                "subcategories": {
                    "1": "ผู้เข้าศึกษาต้องผ่านการสอบข้อเขียนและการสอบสัมภาษณ์",
                    "2": "ผู้เข้าศึกษาต้องส่งผลทดสอบภาษาอังกฤษ TU-GET หรือ TOEFL หรือ IELTS (ผลสอบต้องไม่เกิน 2 ปี นับถึงวันสมัคร)",
                    "3": "เงื่อนไขอื่นๆ ให้เป็นไปตามประกาศรับสมัครบุคคลเข้าศึกษาในระดับบัณฑิตศึกษาของมหาวิทยาลัยธรรมศาสตร์ และ/หรือคณะวิศวกรรมศาสตร์"
                }
            },
            {
                "category": "ปัญหาของนักศึกษาแรกเข้า",
                "subcategories": {
                    "1": "นักศึกษาขาดทักษะในการใช้ภาษาอังกฤษ",
                    "2": "นักศึกษาขาดทักษะในการทำวิจัย"
                }
            },
            {
                "category": "กลยุทธ์ในการดำเนินการเพื่อแก้ไขปัญหา",
                "subcategories": {
                    "ทักษะภาษาอังกฤษ": "ให้นักศึกษาที่มีคะแนนจากการสอบวัดทักษะภาษาอังกฤษต่ำกว่ามาตรฐานที่มหาวิทยาลัยกำหนดไว้ จะต้องลงทะเบียนเรียนภาษาอังกฤษเสริม ในรายวิชา มธ.005 ภาษาอังกฤษ 1 และมธ.006 ภาษาอังกฤษ 2",
                    "ทักษะการวิจัย": "ใช้วิชาสัมมนา เพื่อฝึกให้นักศึกษาเรียนรู้วิธีการค้นคว้าข้อมูลเพื่อการทำวิจัย และสร้างทักษะการสื่อสารเชิงเทคนิค ทั้งด้านการอ่าน เขียน นำเสนอ อภิปราย และการใช้ภาษาอังกฤษ"
                }
            },
            {
                "category": "แผนการรับนักศึกษาและผู้สำเร็จการศึกษาในระยะ 5 ปี",
                "subcategories": {
                    "จำนวนรับต่อปี": "15 คน",
                    "ปีการศึกษา_2561": {
                        "ชั้นปีที่_1": 15,
                        "ชั้นปีที่_2": 0
                    },
                    "ปีการศึกษา_2562": {
                        "ชั้นปีที่_1": 15,
                        "ชั้นปีที่_2": 15
                    },
                    "ปีการศึกษา_2563": {
                        "ชั้นปีที่_1": 15,
                        "ชั้นปีที่_2": 15
                    },
                    "ปีการศึกษา_2564": {
                        "ชั้นปีที่_1": 15,
                        "ชั้นปีที่_2": 15
                    },
                    "ปีการศึกษา_2565": {
                        "ชั้นปีที่_1": 15,
                        "ชั้นปีที่_2": 15
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 65,
        "details": [
            {
                "category": "Faculty Members",
                "subcategories": {
                    "รองศาสตราจารย์_ดร_ภาณุ_ด่านวานิชกุล": {
                        "position": "รองศาสตราจารย์ ดร.",
                        "name": "ภาณุ ด่านวานิชกุล",
                        "publications": {
                            "International_Journals": [
                                {
                                    "authors": "Danwanichakul, P., Suwatthanarak, T., Suwanvisith, C., & Danwanichakul, D.",
                                    "year": 2016,
                                    "title": "The role of ammonia in synthesis of silver nanoparticles in skim natural rubber latex",
                                    "journal": "Journal of Nanoscience",
                                    "doi": "10.1155/2016/7258313"
                                },
                                {
                                    "authors": "Suwatthanarak, T., Than-ardna, B., Danwanichakul, D., & Danwanichakul, P.",
                                    "year": 2016,
                                    "title": "Synthesis of silver nanoparticles in skim natural rubber latex at room temperature",
                                    "journal": "Materials Letters",
                                    "volume": 168,
                                    "pages": "31-35"
                                },
                                {
                                    "authors": "Saikhwan, P., Thongchan, S., Jumwan, N., Thungsiabyuan, P., Sakdanuphap, J., Boonsom, S., Kraitong, P., & Danwanichakul, P.",
                                    "year": 2015,
                                    "title": "Cleaning studies of coconut milk foulants formed during heat treatment process",
                                    "journal": "Food and Bioproducts Processing",
                                    "volume": 93,
                                    "pages": "166-175"
                                },
                                {
                                    "authors": "Danwanichakul, P.",
                                    "year": 2014,
                                    "title": "Monte carlo simulation of protein adsorption on energetically heterogeneous surfaces",
                                    "journal": "BioMed Research International",
                                    "doi": "10.1155/2014/278098"
                                },
                                {
                                    "authors": "Danwanichakul, P., & Danwanichakul, D.",
                                    "year": 2014,
                                    "title": "Two-dimensional simulation of electrospun nanofibrous structures: Connection of experimental and simulated Results",
                                    "journal": "Journal of Chemistry",
                                    "doi": "10.1155/2014/479139"
                                },
                                {
                                    "authors": "Danwanichakul, D., Rattanaphan, O., Srisatjang, J., & Danwanichakul, P.",
                                    "year": 2014,
                                    "title": "Extraction of protein from skim natural rubber latex using PEG as a surfactant via low speed centrifugation and continuous flow",
                                    "journal": "Journal of Applied Polymer Science",
                                    "doi": "10.1002/app.39900"
                                }
                            ],
                            "National_Journals": [
                                {
                                    "authors": "Yooyanyong, A., Danwanichakul D. & Danwanichakul, P.",
                                    "year": 2016,
                                    "title": "The effect of remaining SDS on protein release in later leaching steps of deproteinized natural rubber",
                                    "journal": "KKU Engineering Journal",
                                    "volume": 43,
                                    "issue": 1,
                                    "pages": "41-46"
                                },
                                {
                                    "authors": "Danwanichakul, P., Danwanichakul, D., Yooyanyong, A. & Sae-Ieo, K.",
                                    "year": 2016,
                                    "title": "Filtration efficiency and filter resistance of nylon-6 and nylon-6/chitosan nanofibrous membranes",
                                    "journal": "KKU Engineering Journal",
                                    "volume": 43,
                                    "issue": 1,
                                    "pages": "26-31"
                                },
                                {
                                    "authors": "Danwanichakul, D., & Danwanichakul, P.",
                                    "year": 2015,
                                    "title": "Adsorption of anionic, cationic and disperse dye with activated pyrolytic tire char",
                                    "journal": "KKU Engineering Journal",
                                    "volume": 42,
                                    "issue": 4,
                                    "pages": "292-297"
                                },
                                {
                                    "authors": "Yamkayai, P., Danwanichakul, D. & Danwanichakul, P.",
                                    "year": 2014,
                                    "title": "Electrical property of poly(vinyl alcohol) films filled with pyrolytic tyre char compared with carbon black-filled films",
                                    "journal": "Thammasat Engineering Journal",
                                    "volume": 2,
                                    "issue": 1,
                                    "pages": "3-9",
                                    "language": "Thai"
                                }
                            ]
                        }
                    },
                    "ผู้ช่วยศาสตราจารย์_ดร_สุพิชชา_รุ่งโรจน์นิมิตชัย": {
                        "position": "ผู้ช่วยศาสตราจารย์ ดร.",
                        "name": "สุพิชชา รุ่งโรจน์นิมิตชัย"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 55,
        "details": [
            {
                "category": "การปรับปรุงหลักสูตร",
                "subcategories": {
                    "ความถี่": "อย่างน้อยปีละ 2 ครั้ง",
                    "กระบวนการ": "แต่งตั้งคณะกรรมการพัฒนาและปรับปรุงหลักสูตรวิศวกรรมศาสตรมหาบัณฑิต",
                    "การมีส่วนร่วม": "อาจารย์ทุกคนต้องร่วมรับผิดชอบในกลุ่มวิชาที่สอน และอาจารย์ประจำหลักสูตรเข้าร่วมประชุมไม่น้อยกว่าร้อยละ 80 ทุกครั้ง"
                }
            },
            {
                "category": "การแต่งตั้งอาจารย์พิเศษ",
                "subcategories": {
                    "นโยบาย": "เชิญผู้ทรงคุณวุฒิจากภายนอกมาเป็นวิทยากรร่วมสอนในบางหัวข้อ",
                    "กระบวนการคัดเลือก": "อาจารย์ประจำวิชาเลือกอาจารย์พิเศษ โดยผ่านการเห็นชอบจากอาจารย์ผู้รับผิดชอบหลักสูตร",
                    "คุณสมบัติ": "ต้องมีคุณวุฒิและคุณสมบัติตามเกณฑ์มาตรฐานหลักสูตรระดับบัณฑิตศึกษา พ.ศ. 2558",
                    "สัดส่วนการสอน": "อาจารย์พิเศษต้องมีชั่วโมงสอนไม่เกินร้อยละ 50 ของรายวิชา",
                    "งบประมาณ": "กำหนดแผนงบประมาณของสาขาวิชาสอดคล้องกับแผนการสอน"
                }
            },
            {
                "category": "หลักสูตร การเรียนการสอน การประเมินผู้เรียน",
                "subcategories": {
                    "การเตรียมความพร้อม": "มอบหมายอาจารย์ทุกคนเตรียมอุปกรณ์ เครื่องมือ สื่อการสอน และเอกสารประกอบการสอน",
                    "การประเมินความพึงพอใจ": "ประเมินความพึงพอใจของนักศึกษาต่อคุณภาพการสอนและสิ่งสนับสนุนการเรียนรู้",
                    "การประเมินผลการเรียน": "ประเมินผลการเรียนของนักศึกษาทุกรายวิชาอย่างน้อย 1 ครั้งต่อภาคการศึกษา",
                    "ผลงานวิทยานิพนธ์": "ต้องได้รับการตีพิมพ์หรือนำเสนอในวารสารหรือที่ประชุมวิชาการที่มีคุณภาพ",
                    "การรายงานผล": "รวบรวมผลการประเมินและจัดทำรายงานผลการดำเนินการของหลักสูตรประจำปี",
                    "การปรับปรุงหลักสูตร": "วิเคราะห์ผลการดำเนินการและวางแผนปรับปรุงกลยุทธ์การสอนและรายละเอียดของรายวิชา",
                    "การประเมินหลักสูตร": "จัดการประเมินหลักสูตรโดยผู้ทรงคุณวุฒิและนักศึกษาปีสุดท้ายหรือมหาบัณฑิตใหม่ เมื่อครบรอบหลักสูตร (2 ปี)"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 28,
        "details": [
            {
                "category": "การวิจัยในสาขาวิศวกรรมเคมี",
                "subcategories": {
                    "การสร้างโครงการวิจัย": "การเตรียมและพัฒนาข้อเสนอโครงการวิจัยในสาขาวิศวกรรมเคมี",
                    "การดำเนินการวิจัย": "การดำเนินการวิจัยที่นำไปสู่องค์ความรู้ใหม่ในสาขาวิศวกรรมเคมี",
                    "นวัตกรรม": "การพัฒนากระบวนการผลิตภัณฑ์หรือนวัตกรรมต่างๆ ในสาขาวิศวกรรมเคมี"
                }
            },
            {
                "category": "การนำเสนอและเผยแพร่งานวิจัย",
                "subcategories": {
                    "การนำเสนอวิทยานิพนธ์": "การเตรียมและนำเสนอวิทยานิพนธ์",
                    "การเขียนรายงานการวิจัย": "การเขียนรายงานการวิจัยเพื่อเผยแพร่ต่อสาธารณะ",
                    "ทักษะการสื่อสาร": "การพัฒนาทักษะการสื่อสารในฐานะวิศวกรเคมีที่มีความสามารถ เช่น การเขียนบทความและการนำเสนองานวิจัย"
                }
            },
            {
                "category": "จริยธรรมในการวิจัย",
                "subcategories": {
                    "ศีลธรรมและจริยธรรม": "การดำเนินการวิจัยที่ไม่ขัดต่อศีลธรรมและจริยธรรม",
                    "จริยธรรมในการเผยแพร่": "การรักษาไว้ซึ่งจริยธรรมในการเผยแพร่ผลงานวิชาการ",
                    "จรรยาบรรณการวิจัย": "การเน้นย้ำการรักษาจริยธรรมและศีลธรรมในทุกขั้นตอนของการดำเนินการวิจัย"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 77,
        "details": [
            {
                "category": "การประชุมวิชาการ",
                "subcategories": {
                    "การประชุมวิชาการสิ่งแวดล้อมแห่งชาติ": {
                        "ครั้งที่": "13",
                        "เดือน": "มีนาคม",
                        "ปี": "2557"
                    },
                    "การประชุมวิชาการงานวิจัยและพัฒนาเชิงประยุกต์": {
                        "ครั้งที่": "6",
                        "เดือน": "พฤษภาคม",
                        "ปี": "2557"
                    }
                }
            },
            {
                "category": "บทความวิจัย",
                "subcategories": {
                    "บทความ_1": {
                        "ชื่อเรื่อง": "การผลิตไฟฟ้าจากพลังงานแสงอาทิตย์ที่มากที่สุดในระบบไฟฟ้ามาตรฐาน IEEE 30 บัส",
                        "ผู้เขียน": [
                            "พรระพีพัฒน์ ภาสบุตร",
                            "นรวัฒน์ วงศ์ค่า",
                            "วรรัตน์ ปัตรประกร"
                        ],
                        "ปีที่ตีพิมพ์": "2557",
                        "การประชุม": "การประชุมวิชาการสิ่งแวดล้อมแห่งชาติครั้งที่ 13"
                    },
                    "บทความ_2": {
                        "ชื่อเรื่อง": "การศึกษาศักยภาพของเครื่องกำเนิดไฟฟ้าสำรองเพื่อลดความต้องการกำลังไฟฟ้าสูงสุดของระบบไฟฟ้าประเทศไทย",
                        "ผู้เขียน": [
                            "พรพรรณ พงษ์พันธ์",
                            "พรระพีพัฒน์ ภาสบุตร",
                            "วรรัตน์ ปัตรประกร"
                        ],
                        "ปีที่ตีพิมพ์": "2557",
                        "การประชุม": "การประชุมวิชาการสิ่งแวดล้อมแห่งชาติครั้งที่ 13"
                    },
                    "บทความ_3": {
                        "ชื่อเรื่อง": "ปริมาณกำลังผลิตสูงสุดของโรงไฟฟ้าพลังงานลมสำหรับความต้องการพลังงานประเทศไทยในระบบไฟฟ้ามาตรฐาน IEEE 118 บัส",
                        "ผู้เขียน": [
                            "พรพรรณ พงษ์พันธ์",
                            "พรระพีพัฒน์ ภาสบุตร",
                            "วรรัตน์ ปัตรประกร"
                        ],
                        "ปีที่ตีพิมพ์": "2557",
                        "การประชุม": "การประชุมวิชาการงานวิจัยและพัฒนาเชิงประยุกต์ครั้งที่ 6"
                    },
                    "บทความ_4": {
                        "ชื่อเรื่อง": "การหาปริมาณกำลังการผลิตไฟฟ้าสูงสุดของโรงไฟฟ้าพลังงานแสงอาทิตย์ของประเทศไทยด้วยระบบไฟฟ้ามาตรฐาน IEEE 118 บัส",
                        "ผู้เขียน": [
                            "ชัชรินทร์ นิยติวัฒน์ชาญชัย",
                            "พรระพีพัฒน์ ภาสบุตร",
                            "วรรัตน์ ปัตรประกร"
                        ],
                        "ปีที่ตีพิมพ์": "2557",
                        "การประชุม": "การประชุมวิชาการงานวิจัยและพัฒนาเชิงประยุกต์ครั้งที่ 6"
                    }
                }
            },
            {
                "category": "บุคลากร",
                "subcategories": {
                    "อาจารย์": {
                        "ชื่อ": "ดร.ชิราวุฒิ เพชรเย็น",
                        "ตำแหน่ง": "อาจารย์"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 64,
        "details": [
            {
                "category": "Research Publications",
                "subcategories": {
                    "Journal Articles": [
                        {
                            "title": "Electrospun Gelatin Fiber Bundles by Self-Bundling Electrospinning",
                            "authors": "Thitiwongsawet, P., Wisesanupong, B., & Pukkanasut, S.",
                            "journal": "Advanced Materials Research",
                            "year": 2015,
                            "volume": 1105,
                            "pages": "190-194"
                        },
                        {
                            "title": "Electrospun Polycaprolactone Fiber Mats as Carriers for Resorcinol",
                            "authors": "Thitiwongsawet, P., Parana, P., & Bandhitsing, T.",
                            "journal": "Thammasat International Journal of Science and Technology",
                            "year": 2014,
                            "volume": "19(4)",
                            "pages": "37-44"
                        },
                        {
                            "title": "สบู่ต้านเชื้อแบคทีเรียจากสารสกัดหยาบจากผลมะขามป้อม",
                            "authors": "พัชราภรณ์ ฐิติวงศ์เศวต, เสาวลักษณ์ วงษ์จันลา, และวิจิตรา จันดาวงศ์",
                            "journal": "วารสารมหาวิทยาลัยศรีนครินทรวิโรฒ (สาขาวิทยาศาสตร์และเทคโนโลยี)",
                            "year": 2559,
                            "volume": "8(15)",
                            "pages": "27-39"
                        },
                        {
                            "title": "การลดปริมาณของเสียในกระบวนการผลิตฮาร์ดดิสไดร์ฟ โดยการปรับปรุงประสิทธิภาพการเชื่อมวงจรโดยวิธีการพ่นลูกโลหะผสม",
                            "authors": "บัวทิพย์ บัวศักดิ์, นุรักษ์ กฤษดานุรักษ์, และพัชราภรณ์ ฐิติวงศ์เศวต",
                            "journal": "วารสารวิจัย มข. (บศ.)",
                            "year": 2556,
                            "volume": "13(2)",
                            "pages": "54-59"
                        }
                    ],
                    "Conference Proceedings": [
                        {
                            "title": "Electrospun Cellulose Acetate Fiber Mats as Carriers for Crude Extracts From Phyllanthus Emblica Linn. Fruits",
                            "authors": "Thitiwongsawet, P., Boonruang, T., & Noochsuparb, T.",
                            "conference": "The International Conference on Chemical and Material Engineering: ICCME2015",
                            "year": 2015,
                            "location": "Phuket, Thailand",
                            "pages": "03001: 1-5",
                            "paper": "ME-106E"
                        }
                    ]
                }
            },
            {
                "category": "Faculty Members' Academic Works",
                "subcategories": {
                    "Assoc. Prof. Dr. Prapat Wangskarn": [
                        {
                            "title": "Energy Conservation of the Designated Government Buildings in Thailand",
                            "authors": "Prapat Wangskarn & Monchai Prukvilailert",
                            "publication": "MATEC web of Conferences",
                            "year": 2016,
                            "volume": 60,
                            "doi": "10.1051/matecconf/201600402"
                        },
                        {
                            "title": "Esco Project for Buildings of Government Agencies in Thailand",
                            "authors": "Prapat Wangskarn & Monchai Prukvilailert",
                            "publication": "MATEC web of Conferences",
                            "year": 2016,
                            "volume": 60,
                            "doi": "10.1051/matecconf/201600401"
                        },
                        {
                            "title": "ระบบการจัดการพลังงานสำหรับอาคารควบคุมของรัฐ",
                            "authors": "ประภัสสร์ วังศกาญจน์ และ มนต์ชัย พฤกษ์วิไลเลิศ",
                            "journal": "วารสารวิทยาศาสตร์และเทคโนโลยี",
                            "year": 2014,
                            "volume": "22(1)",
                            "pages": "109-114"
                        }
                    ],
                    "Assoc. Prof. Dr. Sathok Chaikuncheunsakun": [
                        {
                            "title": "Estimated binary mixture flash point from Component structures",
                            "author": "S. Chaikuncheunsakun",
                            "conference": "The 4th International Symposium on Engineering, Energy, and Environment",
                            "year": 2015,
                            "pages": "18-21"
                        },
                        {
                            "title": "การเผาไหม้และการปล่อยก๊าซมลพิษของถ่านไม้ในเตาหุงต้มแบบต่างๆ",
                            "authors": "ตรีกิตติ ไตรบุตร, โปรดปราน สิริธีรศาสน์, และสาธก ไชยกุลชื่นสกุล",
                            "conference": "การประชุมวิชาการวิศวกรรมเคมีและเคมีประยุกต์แห่งประเทศไทย ครั้งที่ 24",
                            "year": 2557,
                            "location": "จ. เชียงใหม่",
                            "pages": "153-158"
                        }
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 52,
        "details": [
            {
                "category": "การเตรียมการสำหรับอาจารย์ใหม่",
                "subcategories": {
                    "การปฐมนิเทศ": "มีการปฐมนิเทศอาจารย์ใหม่ ให้มีความรู้ความเข้าใจในนโยบายของมหาวิทยาลัย บทบาทหน้าที่ของอาจารย์ กฎระเบียบต่างๆ รวมถึงสิทธิผลประโยชน์ของอาจารย์",
                    "การพัฒนาความรู้": "กำหนดให้อาจารย์จะต้องเพิ่มพูนความรู้โดยเข้าร่วมอบรมเพื่อพัฒนาการสอน การวัดและการประเมินผล การทำวิจัยเพื่อพัฒนาการเรียนการสอน การศึกษาดูงาน ประชุมสัมมนา และการประชุมวิชาการเสนอผลงานทั้งในและต่างประเทศ",
                    "การศึกษาหลักสูตร": "มอบเอกสารหลักสูตรให้อาจารย์ใหม่นำไปศึกษา รวมถึงอธิบายปรัชญาและเป้าประสงค์ของหลักสูตรและความสัมพันธ์ระหว่างรายวิชาต่างๆ เพื่อให้การสอนเป็นไปในทิศทางเดียวกัน"
                }
            },
            {
                "category": "การพัฒนาความรู้และทักษะให้แก่คณาจารย์",
                "subcategories": {
                    "การพัฒนาทักษะการจัดการเรียนการสอน": "กำหนดให้อาจารย์จะต้องเพิ่มพูนความรู้โดยเข้าร่วมอบรมเพื่อพัฒนาการสอน อบรมการวัดและการประเมินผล อบรมการทำวิจัยเพื่อพัฒนาการเรียนการสอน การศึกษาดูงาน ประชุมสัมมนา และการประชุมวิชาการเสนอผลงานทั้งในและต่างประเทศ",
                    "การพัฒนาวิชาการและวิชาชีพด้านอื่นๆ": {
                        "การบริการวิชาการ": "การให้อาจารย์มีส่วนร่วมในกิจกรรมบริการทางวิชาการแก่ชุมชน",
                        "การวิจัย": "ส่งเสริมการทำวิจัยสร้างองค์ความรู้ใหม่",
                        "การพัฒนาทักษะ": "ส่งเสริมให้อาจารย์เข้าร่วมสัมมนาที่เกี่ยวข้องกับงานวิจัย และอบรมทักษะปฏิบัติต่างๆ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 17,
        "details": [
            {
                "category": "วค 503 วิศวกรรมปฏิกิริยา",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "AE 503 Reaction Engineering",
                    "หน่วยกิต": "3(3-0-9)",
                    "เนื้อหา": "วิเคราะห์และทำนายอัตราการเกิดปฏิกิริยาทั้งในระบบที่เกิดการไหลและไม่เกิดการไหล การเกิดปฏิกิริยาในระบบที่เป็นเนื้อเดียวและของผสม ผลกระทบของการถ่ายเทความร้อนและการถ่ายโอนมวลที่มีต่อปฏิกิริยาเคมี และประยุกต์การคำนวณสำหรับการออกแบบเครื่องปฏิกรณ์เคมี",
                    "เนื้อหาภาษาอังกฤษ": "Development and application of the theory of chemical kinetics including collision and transition state. Interpretation of chemical rate and selectivity data in homogeneous reaction systems. Design and sizing of ideal and non-ideal chemical reactors. Distributions of residence times for chemical reactors. Reactor design of non-isothermal systems. Introduction to kinetics of surface-catalyzed reactions and mass-transfer limitation."
                }
            },
            {
                "category": "วค 504 การถ่ายโอนมวล",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "AE 504 Mass Transfer",
                    "หน่วยกิต": "3(3-0-9)",
                    "เนื้อหา": "กฎของฟิกค์ การแพร่ในสภาวะคงตัว สัมประสิทธิ์การถ่ายโอนมวล อุปกรณ์ที่ใช้การถ่ายโอนมวล ปรากฏการณ์การถ่ายโอนมวลและความร้อนพร้อมกัน ปรากฏการณ์การถ่ายโอนมวลและการเกิดปฏิกิริยาพร้อมกัน การดูดซึม การดูดซับ เครื่องเพิ่มความชื้น หอลดความร้อน การแยกโดยเยื่อบาง",
                    "เนื้อหาภาษาอังกฤษ": "Macroscopic mass balance and component balance. Mechanism of mass transfer. Fick's first law of diffusion. Steady diffusion. Mass transfer coefficient and interfacial mass transport. Simultaneous heat and mass transfer. Mass transfer with a chemical reaction. Mass transfer equipment. Absorption. Adsorption. Humidification. Cooling tower. Drying. Evaporation. Fluidization. Membrane separation."
                }
            },
            {
                "category": "วค 506 เธอร์โมไดนามิกส์วิศวกรรมเคมี",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "AE 506 Chemical Engineering Thermodynamics",
                    "หน่วยกิต": "3(3-0-9)",
                    "เนื้อหา": "สมบัติทางเธอร์โมไดนามิกส์สำหรับแก๊สจริงและแก๊สอุดมคติ สมการพื้นฐานทางเธอร์โมไดนามิกส์และความสัมพันธ์ระหว่างสมบัติทางเธอร์โมไดนามิกส์ต่างๆ การคำนวณสมบัติเรซิดวลโดยใช้สมการสภาวะและสมการสหสัมพันธ์ทั่วไป การหาสมบัติทางเธอร์โมไดนามิกส์ด้วยสมการอนุพันธ์ เธอร์โมไดนามิกส์สำหรับสารละลายและสมบัติพาร์เชียล ฟิวกาซิตีและสัมประสิทธิ์ฟิวกาซิตี สารละลายอุดมคติและสารละลายจริง"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 85,
        "details": [
            {
                "category": "คุณสมบัติของผู้เข้าศึกษา",
                "subcategories": {
                    "วุฒิการศึกษา": "เป็นผู้ที่สำเร็จการศึกษาวิศวกรรมศาสตรบัณฑิต (วศ.บ.) หรือ วิทยาศาสตรบัณฑิต (วท.บ.) หรือครุศาสตรอุตสาหกรรมบัณฑิต (คอ.บ.) หรือเทียบเท่า",
                    "สถานะการศึกษา": "กำลังศึกษาอยู่ในภาคการศึกษาสุดท้ายของหลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) หรือ วิทยาศาสตรบัณฑิต (วท.บ.) หรือครุศาสตรอุตสาหกรรมบัณฑิต (คอ.บ.) หรือเทียบเท่า",
                    "เกรดเฉลี่ย": "ต้องมีเกรดเฉลี่ยตลอดหลักสูตรไม่น้อยกว่า 2.50 หรือคณะกรรมการประจำหลักสูตรอาจพิจารณาผู้ที่มีคุณสมบัติโดดเด่นเป็นพิเศษโดยพิจารณาจากผลงานทางวิชาการหรือคุณสมบัติอื่นที่เหมาะสมต่อการศึกษาให้มีสิทธิสมัครได้"
                }
            },
            {
                "category": "การคัดเลือกผู้เข้าศึกษา",
                "subcategories": {
                    "การสอบ": "ผู้เข้าศึกษาต้องผ่านการสอบข้อเขียนและการสอบสัมภาษณ์",
                    "ผลทดสอบภาษาอังกฤษ": "ผู้เข้าศึกษาต้องส่งผลทดสอบภาษาอังกฤษ TU-GET หรือ TOEFL หรือ IELTS (ผลสอบต้องไม่เกิน 2 ปี นับถึงวันสมัคร)",
                    "เงื่อนไขอื่นๆ": "ให้เป็นไปตามประกาศรับสมัครบุคคลเข้าศึกษาในระดับบัณฑิตศึกษาของมหาวิทยาลัยธรรมศาสตร์ และ/หรือคณะวิศวกรรมศาสตร์"
                }
            },
            {
                "category": "จำนวนการรับนักศึกษา",
                "subcategories": {
                    "จำนวนรับ": "ปีการศึกษาละ 15 คน"
                }
            },
            {
                "category": "ระบบการศึกษา",
                "subcategories": {
                    "รูปแบบ": "ใช้ระบบการศึกษาแบบทวิภาค",
                    "ภาคการศึกษา": "1 ปีการศึกษาแบ่งออกเป็น 2 ภาคการศึกษาปกติ 1 ภาคการศึกษาปกติมีระยะเวลาศึกษาไม่น้อยกว่า 15 สัปดาห์",
                    "ภาคฤดูร้อน": "อาจเปิดภาคฤดูร้อนได้โดยใช้เวลาการศึกษาไม่น้อยกว่า 8 สัปดาห์ แต่ให้เพิ่มชั่วโมงการศึกษาในแต่ละรายวิชาให้เท่ากับภาคปกติ ภาคฤดูร้อนเป็นภาคการศึกษาที่ไม่บังคับ"
                }
            },
            {
                "category": "ข้อกำหนดการทำวิทยานิพนธ์/การค้นคว้าอิสระ",
                "subcategories": {
                    "ภาษา": "นักศึกษาต้องทำวิทยานิพนธ์เป็นภาษาไทยหรือภาษาอังกฤษ",
                    "การรายงานความก้าวหน้า": "นักศึกษาจะต้องรายงานความก้าวหน้าวิทยานิพนธ์ทุกภาคการศึกษาที่มีการลงทะเบียน โดยมีอาจารย์ที่ปรึกษาวิทยานิพนธ์เป็นผู้ทำหน้าที่ในการประเมินความก้าวหน้า หรือแต่งตั้งกรรมการร่วมประเมินกับอาจารย์ที่ปรึกษาวิทยานิพนธ์ได้",
                    "การเสนอเค้าโครง": "หลังจากจดทะเบียนทำวิทยานิพนธ์แล้ว นักศึกษาต้องเสนอเค้าโครงวิทยานิพนธ์ต่อคณะกรรมการสอบวิทยานิพนธ์ โดยยื่นเรื่องให้คณบดีคณะวิศวกรรมศาสตร์แต่งตั้งอาจารย์ที่ปรึกษาวิทยานิพนธ์",
                    "การสอบวิทยานิพนธ์": "เป็นระบบเปิดให้ผู้สนใจเข้ารับฟัง",
                    "การตีพิมพ์ผลงาน": "ปรับเกณฑ์การตีพิมพ์ผลงานวิทยานิพนธ์ตามเกณฑ์ฯ สกอ."
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 24,
        "details": [
            {
                "category": "วค 647 การจำลองกระบวนการเคมีและการประเมินทางเศรษฐศาสตร์",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "AE 647 Chemical Process Simulation and Economic Evaluation",
                    "หน่วยกิต": "3(3-0-9)",
                    "เนื้อหา": {
                        "การออกแบบกระบวนการเคมี": "ใช้โปรแกรมสำเร็จรูปทั่วไป เช่น Aspen Plus, Aspen Hysys",
                        "การคำนวณต้นทุน": [
                            "ต้นทุนลงทุน",
                            "ต้นทุนด้านพลังงาน",
                            "ต้นทุนการดำเนินการ"
                        ],
                        "การวิเคราะห์ความเสี่ยงทางเศรษฐศาสตร์": [
                            "การวิเคราะห์ความอ่อนไหว",
                            "การประยุกต์ใช้ทฤษฎีตัดสินใจ"
                        ],
                        "การหาค่าที่เหมาะสม": "แนะนำระเบียบวิธีการหาค่าที่เหมาะสมที่เกี่ยวข้องกับการแก้ปัญหาทางวิศวกรรมเคมี โดยใช้กำหนดการแบบเป็นเชิงเส้นหรือไม่เป็นเชิงเส้น"
                    }
                }
            },
            {
                "category": "วค. 648 การออกแบบการทดลองสำหรับงานวิจัยทางวิศวกรรมเคมี",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "AE 648 Design of Experiments for Chemical Engineering Research",
                    "หน่วยกิต": "3(3-0-9)",
                    "เนื้อหา": {
                        "หลักการทางสถิติ": "เกี่ยวข้องกับการออกแบบการทดลอง",
                        "เครื่องมือทางสถิติ": "รวมถึงซอฟต์แวร์สำเร็จรูปที่ใช้สำหรับการวิเคราะห์ทางสถิติ",
                        "การสร้างและประเมินแบบจำลอง": "จากการทดลอง",
                        "การออกแบบการทดลอง": [
                            "แบบบล็อก",
                            "แบบแฟกทอเรียลแบบเต็มรูปแบบและแบบบางส่วน",
                            "โดยใช้วิธีการพื้นผิวตอบสนอง"
                        ],
                        "การประยุกต์ใช้": "สำหรับงานวิจัยทางวิศวกรรมเคมี"
                    }
                }
            },
            {
                "category": "วค 654 การประเมินวงชีวิตผลิตภัณฑ์",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "AE 654 Product Life Cycle Assessment",
                    "หน่วยกิต": "3(3-0-9)",
                    "เนื้อหา": {
                        "การประเมินผลกระทบต่อสิ่งแวดล้อม": "ของกระบวนการและผลิตภัณฑ์",
                        "การนิยาม": "จุดประสงค์และขอบเขตการทำ LCA",
                        "การเปรียบเทียบ": "ผลกระทบต่อสิ่งแวดล้อมของกระบวนการหรือผลิตภัณฑ์มากกว่า 1 ชนิด",
                        "การประยุกต์ใช้": "LCA ในการออกแบบผลิตภัณฑ์ใหม่"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 12,
        "details": [
            {
                "category": "วิชาบังคับ",
                "subcategories": {
                    "วค_621": "ปรากฏการณ์การถ่ายโอนขั้นกลาง 3(3-0-9)",
                    "AE_621": "Intermediate Transport Phenomena",
                    "วค_631": "จลนพลศาสตร์เคมีและการออกแบบเครื่องปฏิกรณ์เคมีขั้นกลาง 3(3-0-9)",
                    "AE_631": "Intermediate Chemical Kinetics and Reactor Designs",
                    "วค_647": "การจำลองกระบวนการเคมีและการประเมินทางเศรษฐศาสตร์ 3(3-0-9)",
                    "AE_647": "Chemical Process Simulation and Economic Evaluation",
                    "วค_692": "ระเบียบวิธีวิจัย 1(1-0-3)",
                    "AE_692": "Research Methodology and Research Skill",
                    "วค_791": "สัมมนาบัณฑิตศึกษา 1(0-3-3)",
                    "AE_791": "Graduate Seminar"
                }
            },
            {
                "category": "วิชาเลือก",
                "subcategories": {
                    "แผน_ก_แบบ_ก_2": "ให้เลือกศึกษา 2 วิชา รวม 6 หน่วยกิต โดยเลือกศึกษาจากรายวิชาในหมวดใดก็ได้ไม่น้อยกว่า 2 หมวดวิชา",
                    "หมวดวิชาอุณหพลศาสตร์_เทคโนโลยีพลังงาน_การเผาไหม้": {
                        "วค_615": "เธอร์โมไดนามิกส์เชิงสถิติเบื้องต้น 3(3-0-9)",
                        "AE_615": "Introduction to Statistical Thermodynamics",
                        "วค_616": "การอนุรักษ์พลังงานและเทคโนโลยีพลังงาน 3(3-0-9)",
                        "AE_616": "Energy Conservation and Energy Technology",
                        "วค_617": "เชื้อเพลิงสะอาด 3(3-0-9)",
                        "AE_617": "Clean Fuels"
                    },
                    "หมวดวิชาปรากฏการณ์ถ่ายโอน_กระบวนการแยก_และวิศวกรรมปิโตรเคมี": {
                        "วค_623": "กระบวนการแยกขั้นกลาง 3(3-0-9)",
                        "AE_623": "Intermediate Separation Processes",
                        "วค_625": "เทคโนโลยีอุตสาหกรรมปิโตรเคมี 3(3-0-9)",
                        "AE_625": "Petrochemical industry technology"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 30,
        "details": [
            {
                "category": "อาจารย์ประจำหลักสูตร",
                "subcategories": [
                    {
                        "ลำดับที่": "1",
                        "เลขประจำตัวประชาชน": "3100501910xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "นางสาววันวิสาข์ สกลภาพ",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "The University of Waterloo, Canada",
                                "ปี": "2546"
                            },
                            {
                                "ระดับ": "M.S.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "The University, Colorado State, U.S.A.",
                                "ปี": "2538"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "มหาวิทยาลัยขอนแก่น",
                                "ปี": "2536"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "2",
                        "เลขประจำตัวประชาชน": "4100600053xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "นางแคทลียา ปัทมพรหม",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Michigan Ann Arbor, U.S.A.",
                                "ปี": "2544"
                            },
                            {
                                "ระดับ": "M.Sc.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Michigan Ann Arbor, U.S.A.",
                                "ปี": "2540"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2537"
                            }
                        ]
                    },
                    {
                        "ลำดับที่": "3",
                        "เลขประจำตัวประชาชน": "3959900235xxx",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "ชื่อ-สกุล": "นางสาวพัชราภรณ์ วุฒิเจริญมงคล",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "ปร.ด.",
                                "สาขาวิชา": "วิทยาศาสตร์พอลิเมอร์",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2550"
                            },
                            {
                                "ระดับ": "วท.บ.",
                                "สาขาวิชา": "เคมี",
                                "สถาบัน": "มหาวิทยาลัยสงขลานครินทร์",
                                "ปี": "2546"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 3,
        "details": [
            {
                "category": "สถานภาพของหลักสูตรและการพิจารณาอนุมัติ/เห็นชอบหลักสูตร",
                "subcategories": {
                    "ประเภทหลักสูตร": "หลักสูตรปรับปรุง พ.ศ. 2561 ปรับปรุงจากหลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมเคมี พ.ศ. 2558",
                    "กำหนดเปิดสอน": "ภาคการศึกษาที่ 1 ปีการศึกษา 2561",
                    "การพิจารณากลั่นกรอง": "คณะกรรมการนโยบายวิชาการในการประชุมครั้งที่ 7/2558 เมื่อวันที่ 10 กรกฎาคม 2558",
                    "การอนุมัติ/เห็นชอบหลักสูตร": "สภามหาวิทยาลัย ในการประชุมครั้งที่ 7/2558 เมื่อวันที่ 20 กรกฎาคม 2558"
                }
            },
            {
                "category": "ความพร้อมในการเผยแพร่หลักสูตรที่มีคุณภาพและมาตรฐาน",
                "subcategories": {
                    "ปีการศึกษา": "2563"
                }
            },
            {
                "category": "อาชีพที่สามารถประกอบได้หลังสำเร็จการศึกษา",
                "subcategories": {
                    "อาชีพ_1": "วิศวกรกระบวนการผลิต (Production Engineer)",
                    "อาชีพ_2": "วิศวกรออกแบบกระบวนการผลิต (Design Engineer)",
                    "อาชีพ_3": "นักวิจัยและพัฒนาในองค์กรราชการและเอกชน",
                    "อาชีพ_4": "นักวิเคราะห์โครงการ",
                    "อาชีพ_5": "ผู้ประกอบการธุรกิจที่เกี่ยวข้องกับสารเคมีและกระบวนการทางเคมี",
                    "อาชีพ_6": "วิศวกรความปลอดภัยกับงานสิ่งแวดล้อม",
                    "อาชีพ_7": "นักเทคโนโลยีพลังงานและสิ่งแวดล้อม",
                    "อาชีพ_8": "วิศวกรแผนกควบคุมคุณภาพ",
                    "อาชีพ_9": "นวัตกร",
                    "อาชีพ_10": "นักวิชาชีพในสถานประกอบการที่มีการใช้เทคโนโลยีที่เกี่ยวข้องกับกระบวนการทางเคมีและเครื่องมือวิเคราะห์ต่าง ๆ"
                }
            },
            {
                "category": "อาจารย์ผู้รับผิดชอบหลักสูตรและอาจารย์ประจำหลักสูตร",
                "subcategories": {
                    "ลำดับที่": "1",
                    "เลขประจำตัวประชาชน": "3100501910xxx",
                    "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                    "ชื่อ-นามสกุล": "นางวันวิสาข์ สกลภาพ",
                    "คุณวุฒิการศึกษา": [
                        {
                            "ระดับ": "Ph.D.",
                            "สาขา": "Chemical Engineering",
                            "สถาบัน": "The University of Waterloo, Canada",
                            "ปีที่จบ": "2546"
                        },
                        {
                            "ระดับ": "M.S.",
                            "สาขา": "Chemical Engineering",
                            "สถาบัน": "The University of Colorado State, U.S.A.",
                            "ปีที่จบ": "2538"
                        },
                        {
                            "ระดับ": "วศ.บ.",
                            "สาขา": "วิศวกรรมเคมี",
                            "สถาบัน": "มหาวิทยาลัยขอนแก่น",
                            "ปีที่จบ": "2536"
                        }
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 11,
        "details": [
            {
                "category": "วิชาเสริมพื้นฐาน",
                "subcategories": {
                    "วค_501": "กลศาสตร์ของไหลสำหรับวิศวกรรมเคมี 3(3-0-9)",
                    "วค_502": "การถ่ายเทความร้อน 3(3-0-9)",
                    "วค_503": "วิศวกรรมปฏิกิริยา 3(3-0-9)",
                    "วค_504": "การถ่ายโอนมวล 3(3-0-9)",
                    "วค_506": "เธอร์โมไดนามิกส์วิศวกรรมเคมี 3(3-0-9)",
                    "หมายเหตุ": "วิชาเสริมพื้นฐาน สำหรับนักศึกษาที่ไม่ได้สำเร็จการศึกษาวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมเคมี โดยให้ทดสอบความรู้พื้นฐาน ถ้าสอบผ่านนักศึกษาไม่ต้องเรียนวิชาเสริมพื้นฐาน และถ้าสอบไม่ผ่านนักศึกษาต้องลงทะเบียนเรียนวิชาเสริมพื้นฐานทุกวิชา"
                }
            },
            {
                "category": "แผน ก แบบ ก1",
                "subcategories": {
                    "วค_692": "ระเบียบวิธีวิจัย 1(1-0-3)",
                    "วค_791": "สัมมนาบัณฑิตศึกษา 1(0-3-3)",
                    "หมายเหตุ": "ศึกษารายวิชาโดยไม่นับหน่วยกิตจำนวน 2 วิชา"
                }
            },
            {
                "category": "แผน ก แบบ ก2",
                "subcategories": {
                    "วิชาบังคับ": {
                        "จำนวนหน่วยกิต": "14 หน่วยกิต",
                        "วค_611": "เธอร์โมไดนามิกส์วิศวกรรมเคมีขั้นกลาง 3(3-0-9)"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 87,
        "details": [
            {
                "category": "หลักเกณฑ์การสำเร็จการศึกษา",
                "subcategories": {
                    "การศึกษารายวิชา": "ได้ศึกษาลักษณะวิชาต่างๆ ครบตามโครงสร้างหลักสูตร และมีหน่วยกิตสะสมไม่น้อยกว่า 36 หน่วยกิตสำหรับแผน ก แบบ ก1 และไม่น้อยกว่า 38 หน่วยกิต สำหรับแผน ก แบบ ก2",
                    "ค่าระดับเฉลี่ยสะสม": "ได้ค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 3.00 (จากระบบ 4 ระดับคะแนนหรือเทียบเท่า)",
                    "ผลการเรียนรายวิชาไม่นับหน่วยกิต": "ได้ค่าระดับ P (ผ่าน) ในรายวิชาโดยไม่นับหน่วยกิต แผน ก แบบ ก1",
                    "การสอบภาษาต่างประเทศ": "ได้ค่าระดับ P (ผ่าน) ในการสอบภาษาต่างประเทศ ตามเกณฑ์ที่มหาวิทยาลัยกำหนด",
                    "วิชาเสริมพื้นฐาน": "ได้ระดับ P (ผ่าน) ในการวัดผลวิชาเสริมพื้นฐาน",
                    "การสอบวิทยานิพนธ์": "ได้ระดับ S (ใช้ได้) ในการสอบวิทยานิพนธ์ โดยการสอบปากเปล่าขั้นสุดท้ายโดยคณะกรรมการที่คณะวิศวกรรมศาสตร์แต่งตั้ง และต้องเป็นระบบเปิดให้ผู้สนใจเข้ารับฟัง",
                    "การส่งวิทยานิพนธ์": "จัดทำวิทยานิพนธ์ให้เป็นไปตามรูปแบบที่ห้องสมุดแห่งมหาวิทยาลัยธรรมศาสตร์กำหนดและนำส่งวิทยานิพนธ์ให้มหาวิทยาลัยธรรมศาสตร์ตามระเบียบมหาวิทยาลัยธรรมศาสตร์ว่าด้วยวิทยานิพนธ์ สารนิพนธ์ และการค้นคว้าอิสระ พ.ศ. 2559"
                }
            },
            {
                "category": "การเผยแพร่ผลงานวิทยานิพนธ์",
                "subcategories": {
                    "แผน_ก_แบบ_ก1": {
                        "จำนวนผลงาน": "อย่างน้อย 2 เรื่อง",
                        "ประเภทการเผยแพร่": [
                            "1. ผลงานวิทยานิพนธ์หรือส่วนหนึ่งของวิทยานิพนธ์ของนักศึกษา ที่มีการเผยแพร่ในวารสารวิชาการอย่างน้อย 1 เรื่อง",
                            "2. ผลงานวิทยานิพนธ์หรือส่วนหนึ่งของวิทยานิพนธ์ของนักศึกษาที่มีการนำเสนอในการประชุมวิชาการระดับนานาชาติที่มีรายงานการประชุม (Proceedings) อย่างน้อย 1 เรื่อง"
                        ],
                        "กรณียังไม่มีการเผยแพร่": "กรณีที่ผลงานในข้อ 1. ยังไม่มีการเผยแพร่ จะต้องแสดงต้นฉบับของผลงานนั้นและใบตอบรับให้ลงตีพิมพ์ประกอบ",
                        "คุณภาพวารสาร": "วารสารระดับชาติหรือระดับนานาชาติที่มีคุณภาพตามประกาศคณะกรรมการการอุดมศึกษา เรื่อง หลักเกณฑ์การพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ",
                        "ชื่อนักศึกษา": "จะต้องมีชื่อของนักศึกษาเป็นลำดับแรกในรายชื่อคณะผู้วิจัย"
                    },
                    "แผน_ก_แบบ_ก2": {
                        "จำนวนผลงาน": "อย่างน้อย 1 เรื่อง",
                        "ประเภทการเผยแพร่": "ผลงานวิทยานิพนธ์หรือส่วนหนึ่งของวิทยานิพนธ์ต้องได้รับการตีพิมพ์ หรืออย่างน้อยได้รับการยอมรับให้ตีพิมพ์ในวารสารระดับชาติหรือระดับนานาชาติที่มีคุณภาพตามประกาศคณะกรรมการการอุดมศึกษา เรื่อง หลักเกณฑ์การพิจารณาวารสารทางวิชาการสำหรับการเผยแพร่ผลงานทางวิชาการ หรือนำเสนอต่อที่ประชุมวิชาการที่มีรายงานการประชุม (Proceedings)"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 50,
        "details": [
            {
                "category": "หลักเกณฑ์ในการประเมินผลนักศึกษา",
                "subcategories": {
                    "กฎระเบียบหรือหลักเกณฑ์ในการให้ระดับคะแนน": {
                        "การวัดผลการศึกษา": "แบ่งเป็น 9 ระดับ มีชื่อและค่าระดับต่อหนึ่งหน่วยวิชา ตั้งแต่ A ถึง F",
                        "การนับหน่วยกิต": "นับรวมเฉพาะหน่วยกิตลักษณะวิชาที่นักศึกษาได้ค่าระดับ S หรือระดับไม่ต่ำกว่า C",
                        "การลงทะเบียนซ้ำ": {
                            "รายวิชาบังคับ": "ลงทะเบียนซ้ำได้อีก 1 ครั้ง ต้องได้ค่าระดับ S หรือไม่ต่ำกว่า C",
                            "รายวิชาเลือก": "ลงทะเบียนซ้ำได้จนกว่าจะได้อักษร C ขึ้นไป หรือ S หรือเลือกวิชาอื่นแทน"
                        },
                        "การวัดผลวิทยานิพนธ์": "แบ่งเป็น 2 ระดับ คือ S (ใช้ได้) และ U (ใช้ไม่ได้)",
                        "การวัดผลวิชาเสริมพื้นฐาน": "แบ่งเป็น 2 ระดับ คือ P (ผ่าน) และ N (ไม่ผ่าน) และไม่นับหน่วยกิต"
                    },
                    "กระบวนการทวนสอบมาตรฐานผลสัมฤทธิ์ของนักศึกษา": {
                        "รายวิชาเชิงทฤษฎี": "ทวนสอบจากคะแนนข้อสอบ งานที่มอบหมาย และคะแนนเก็บระหว่างเรียน",
                        "รายวิชาวิทยานิพนธ์": "ทวนสอบจากคุณภาพของข้อเสนอโครงงาน ผลงานวิจัยที่ผ่านการประเมินจากผู้ทรงคุณวุฒิ และการสอบจบวิทยานิพนธ์"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 49,
        "details": [
            {
                "category": "รายวิชา",
                "subcategories": {
                    "วค_655": "การบำบัดมลพิษทางน้ำจากอุตสาหกรรม",
                    "วค_657": "การควบคุมมลพิษทางอากาศจากอุตสาหกรรม",
                    "วค_656": "การจัดการกากอุตสาหกรรม",
                    "วค_663": "วิศวกรรมชีวเคมี",
                    "วค_664": "การจำลองแบบสิ่งแวดล้อม",
                    "วค_692": "ระเบียบวิธีวิจัย",
                    "วค_791": "สัมมนาบัณฑิตศึกษา",
                    "วค_793": "ปัญหาพิเศษทางวิจัยอุตสาหกรรมเคมี",
                    "วค_794": "ปฏิบัติการพิเศษทางอุตสาหกรรมเคมี",
                    "วค_803": "วิทยานิพนธ์",
                    "วค_804": "วิทยานิพนธ์"
                }
            },
            {
                "category": "ทักษะการเรียนรู้",
                "subcategories": {
                    "คุณธรรม_จริยธรรม": "1 2 3 4 5 6",
                    "ความรู้": "1 2 3 4 5 6",
                    "ทักษะทางปัญญา": "1 2 3 4",
                    "ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": "1 2 3 4 5 6",
                    "ทักษะการวิเคราะห์เชิงตัวเลขการสื่อสารและเทคโนโลยีสารสนเทศ": "1 2 3"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 57,
        "details": [
            {
                "category": "สิ่งสนับสนุนการเรียนรู้",
                "subcategories": {
                    "การบริหารทรัพยากรการเรียนการสอน": {
                        "การบริหารงบประมาณ": "คณะจัดสรรงบประมาณประจำปี ทั้งงบประมาณแผ่นดินและเงินรายได้เพื่อจัดซื้อตำรา สื่อการเรียนการสอน โสตทัศนูปกรณ์และวัสดุครุภัณฑ์คอมพิวเตอร์อย่างเพียงพอเพื่อสนับสนุนการเรียนการสอนในชั้นเรียน และสร้างสภาพแวดล้อมให้เหมาะสมกับการเรียนรู้ด้วยตนเองของนักศึกษา รวมทั้งมีการจัดสรรงบประมาณเพื่อซื้อและซ่อมแซมครุภัณฑ์เพื่อสนับสนุนงานวิจัยของนักศึกษา",
                        "ทรัพยากรการเรียนการสอนที่มีอยู่เดิม": {
                            "ห้องสมุด": "นักศึกษาสามารถใช้ค้นคว้าโดยสะดวกทั้ง หนังสือตำรา และวารสารวิชาการทางวิศวกรรมศาสตร์และวิทยาศาสตร์ ได้แก่ สำนักหอสมุดกลางของมหาวิทยาลัยธรรมศาสตร์ ท่าพระจันทร์และหอสมุดปรีดี พนมยงค์",
                            "หนังสือและวารสาร": {
                                "หมวดวิชาพื้นฐาน": {
                                    "หมวดมนุษยศาสตร์": "5,438 เล่ม",
                                    "หมวดสังคมศาสตร์": "14,762 เล่ม",
                                    "หมวดวิทยาศาสตร์และคณิตศาสตร์": "23,699 เล่ม",
                                    "หมวดภาษา": "2,942 เล่ม"
                                },
                                "วิชาเฉพาะด้าน": {
                                    "หมวดวิชาวิศวกรรมศาสตร์": "10,132 เล่ม",
                                    "วารสาร": "513 เล่ม",
                                    "วารสารเย็บเล่ม": "3,359 เล่ม"
                                }
                            }
                        },
                        "การจัดหาทรัพยากรการเรียนการสอนเพิ่มเติม": "ประสานงานกับห้องสมุดกลาง ในการจัดซื้อหนังสือ และตำราที่เกี่ยวข้อง เพื่อบริการให้อาจารย์และนักศึกษาได้ค้นคว้า และใช้ประกอบการเรียนการสอน ในการประสานการจัดซื้อหนังสือนั้น อาจารย์ผู้สอนแต่ละรายวิชาจะมีส่วนร่วมในการเสนอแนะรายชื่อหนังสือ ตลอดจนสื่ออื่นๆ ที่จำเป็น"
                    }
                }
            },
            {
                "category": "การประเมินผล",
                "subcategories": {
                    "ความร่วมมือกับต่างประเทศ": "ผลงานทางวิชาการทุกปีเพื่อเป็นข้อมูลในการประเมินของคณะกรรมการ",
                    "ประเมินความพึงพอใจ": "ประเมินความพึงพอใจของหลักสูตรและการเรียนการสอน โดยบัณฑิตที่สำเร็จการศึกษา"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 72,
        "details": [
            {
                "category": "Publications",
                "subcategories": {
                    "Authors": [
                        "รัตนาพร อินทรพานิชย์",
                        "วรณี มังคละศิริ",
                        "จิตติ มังคละศิริ",
                        "Jitti Mungkalasiri",
                        "Woranee Paengjuntuek",
                        "Jirasak Boonmak",
                        "ภณิดา ซ้ายขวัญ",
                        "บรรพต ศิริณัฐสมบูรณ์"
                    ],
                    "Journals": [
                        "วารสารวิทยาศาสตร์และเทคโนโลยี",
                        "Thammasat International Journal of Science and Technology",
                        "วิศวกรรมสารฉบับวิจัยและพัฒนา",
                        "Food and Bioproducts Process",
                        "Journal of Food science and agricultural technology",
                        "ECS Transactions",
                        "International Journal of Energy and Environmental Engineering"
                    ],
                    "Conference_Proceedings": [
                        "4th International Symposium on Engineering, Energy and Environments"
                    ]
                }
            },
            {
                "category": "Research_Topics",
                "subcategories": {
                    "Energy": [
                        "การใช้พลังงาน",
                        "Energy analysis of hydrogen production",
                        "IGFC system",
                        "Microbial fuel cell"
                    ],
                    "Food_Technology": [
                        "Cleaning studies of coconut milk foulants",
                        "Microbial growth in rubber latex",
                        "Protein and fat contents in coconut milk"
                    ],
                    "Fuel_Cells": [
                        "CO tolerance and HOR activity for PEFC",
                        "Single-chamber microbial fuel cell"
                    ],
                    "Environmental_Studies": [
                        "วอเตอร์ฟุตพริ้นท์ของปาล์มน้ำมัน"
                    ]
                }
            },
            {
                "category": "Publication_Years",
                "subcategories": {
                    "2014": [
                        "Optimal operation analysis of IGFC system",
                        "วอเตอร์ฟุตพริ้นท์ของปาล์มน้ำมัน",
                        "Modeling of a membraneless single-chamber microbial fuel cell"
                    ],
                    "2015": [
                        "Cleaning studies of coconut milk foulants",
                        "The use of pasteurization to control microbial growth in rubber latex",
                        "Effects of pasteurization on protein and fat contents in coconut milk"
                    ],
                    "2016": [
                        "Energy analysis of hydrogen production from biomass in Thailand"
                    ],
                    "2017": [
                        "Effect of valency of Sn in Sn-modified Pt-Ru catalyst"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 9,
        "details": [
            {
                "category": "2.6 งบประมาณตามแผน",
                "subcategories": {
                    "งบบุคลากร_(โครงการปกติ)": "0 บาท",
                    "หมวดเงินเดือน": "0 บาท",
                    "หมวดค่าจ้างประจำ": "0 บาท",
                    "งบดำเนินการ": "182,300 บาท",
                    "หมวดค่าตอบแทน": "72,000 บาท",
                    "หมวดค่าใช้สอย": "20,000 บาท",
                    "หมวดค่าวัสดุ": "90,300 บาท",
                    "รวมทั้งสิ้น": "182,300 บาท",
                    "ค่าใช้จ่ายต่อหัวนักศึกษา": "53,600 บาทต่อปี",
                    "ประเภทงบประมาณ": "งบประมาณแผ่นดิน"
                }
            },
            {
                "category": "2.7 ระบบการศึกษา",
                "subcategories": {
                    "รูปแบบการศึกษา": [
                        "แบบชั้นเรียน",
                        "แบบทางไกลผ่านสื่อสิ่งพิมพ์เป็นหลัก",
                        "แบบทางไกลผ่านสื่อแพร่ภาพและเสียงเป็นสื่อหลัก",
                        "แบบทางไกลทางอิเล็กทรอนิกส์เป็นสื่อหลัก (E-learning)",
                        "แบบทางไกลทางอินเตอร์เน็ต",
                        "อื่นๆ (ระบุ)"
                    ]
                }
            },
            {
                "category": "2.8 การเทียบโอนหน่วยกิต รายวิชาและการลงทะเบียนเรียนข้ามมหาวิทยาลัย",
                "subcategories": {
                    "ข้อบังคับ": "เป็นไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ว่าด้วยการศึกษาระดับบัณฑิตศึกษา พ.ศ. 2561"
                }
            },
            {
                "category": "3. หลักสูตรและอาจารย์ผู้สอน",
                "subcategories": {
                    "3.1_หลักสูตร": {
                        "3.1.1_จำนวนหน่วยกิตรวมและระยะเวลาศึกษา": {
                            "แผน_ก_แบบ_ก1": "36 หน่วยกิต",
                            "แผน_ก_แบบ_ก2": "38 หน่วยกิต",
                            "ระยะเวลาศึกษา": "อย่างน้อย 3 ภาคการศึกษาปกติ และอย่างมากไม่เกิน 10 ภาคการศึกษาปกติ"
                        },
                        "3.1.2_โครงสร้างหลักสูตร": {
                            "3.1.2.1_แผน_ก_แบบ_ก_1_(ทำเฉพาะวิทยานิพนธ์)": {
                                "วิชาเสริมพื้นฐาน": "ไม่นับหน่วยกิต",
                                "วิทยานิพนธ์": "36 หน่วยกิต",
                                "ศึกษาวิชาโดยไม่นับหน่วยกิต": "2 หน่วยกิต"
                            },
                            "3.1.2.2_แผน_ก_แบบ_ก_2_(ศึกษารายวิชาและทำวิทยานิพนธ์)": {}
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 21,
        "details": [
            {
                "category": "วค 630 เทคนิคการหาลักษณะเฉพาะของพื้นผิวของแข็ง",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "AE 630 Characterization Technique of Solid Surface",
                    "หน่วยกิต": "3(3-0-9)",
                    "คำอธิบายรายวิชา_ภาษาไทย": "การวิเคราะห์ลักษณะเฉพาะทั้งทางกายภาพและทางเคมีของพื้นผิวของแข็ง โดยเฉพาะสำหรับตัวเร่งปฏิกิริยาโดยหลักการของเทคนิคเชิงความร้อน เช่น Temperature Programmed Desorption, Temperature Programmed Reduction สเปกโตรสโคปีและไมโครสโคปี เช่น Extended X-rays Absorption Fine Structure, X-rays Photoelectron microscopy, X-rays diffractometer, Scanning Electron Microscope.",
                    "คำอธิบายรายวิชา_ภาษาอังกฤษ": "Physico-chemical characterizations of solid surface, particular to catalyst surface using thermal techniques, such as Temperature Programmed Desorption, Temperature Programmed Reduction, and spectroscopy-microscropy such as Extended X-rays Absorption Fine Structure, X-rays Photoelectron microscopy, X-rays diffractometer, Scanning Electron Microscope."
                }
            },
            {
                "category": "วค 631 จลนพลศาสตร์เคมีและการออกแบบเครื่องปฏิกรณ์เคมีขั้นกลาง",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "AE 631 Intermediate Chemical Kinetics and Reactor Designs",
                    "หน่วยกิต": "3(3-0-9)",
                    "คำอธิบายรายวิชา_ภาษาไทย": "ความเข้าใจในตัวเร่งปฏิกิริยาของแข็งและการถ่ายโอนมวล จลนพลศาสตร์ของปฏิกิริยาการเร่งแบบวิวิธพันธ์ การวิเคราะห์ปฏิกิริยาที่มีความรุนแรงสูงและแนวทางแก้ไข การฝึกทำระบบจำลองกระบวนการการกระจายตัวของของไหลในระบบแบบไม่อุดมคติ",
                    "คำอธิบายรายวิชา_ภาษาอังกฤษ": "Understanding of solid catalysis and mass transfer related, Kinetics of catalytic heterogeneous reactions, Risk evaluation and measures of extremely hazardous reactions, reaction-reactor simulation and non-ideal flow and reactors."
                }
            },
            {
                "category": "วค 634 วิทยาการตัวเร่งปฏิกิริยา",
                "subcategories": {
                    "ชื่อภาษาอังกฤษ": "AE 634 Catalysis Sciences",
                    "หน่วยกิต": "3(3-0-9)",
                    "คำอธิบายรายวิชา_ภาษาไทย": "ตัวเร่งปฏิกิริยาแบบเอกพันธ์และวิวิทธพันธ์ การเตรียม การวิเคราะห์คุณลักษณะของวัสดุ และการประเมินทิศทางการเกิดปฏิกิริยาบนตัวเร่งปฏิกิริยา การทดสอบตรวจวัดคุณสมบัติของตัวเร่งปฏิกิริยา"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 40,
        "details": [
            {
                "category": "การพัฒนาคุณลักษณะพิเศษของนักศึกษา",
                "subcategories": {
                    "ด้านบุคลิกภาพ": "มีการสอดแทรกเรื่อง การแต่งกาย การเข้าสังคม เทคนิคการเจรจา สื่อสาร การมีมนุษยสัมพันธ์ที่ดี และการวางตัวในการทำงานในบางรายวิชาที่เกี่ยวข้อง และในกิจกรรมปัจฉิมนิเทศก่อนที่นักศึกษาจะสำเร็จการศึกษา",
                    "ด้านภาวะผู้นำ_และความรับผิดชอบ": "- กำหนดให้มีรายวิชาซึ่งนักศึกษาต้องทำงานเป็นกลุ่ม และมีการกำหนดหัวหน้ากลุ่มในการทำรายงานตลอดจน กำหนดให้ทุกคนมีส่วนร่วมในการนำเสนอรายงาน\n- มีกิจกรรมนักศึกษาที่มอบหมายให้นักศึกษาหมุนเวียนกันเป็นหัวหน้าในการดำเนินกิจกรรม\n- มีกติกาที่จะสร้างวินัยในตนเอง เช่น การเข้าเรียนตรงเวลา เข้าเรียนอย่างสม่ำเสมอ การมีส่วนร่วมในชั้นเรียน เสริมความกล้าในการแสดงความคิดเห็น",
                    "จริยธรรม_และจรรยาบรรณวิชาชีพ": "มีการให้ความรู้ถึงผลกระทบต่อสังคม และข้อกฎหมายที่เกี่ยวข้องกับการกระทำความผิดจริยธรรม และจรรยาบรรณวิชาชีพทางวิศวกรรมเคมี"
                }
            },
            {
                "category": "การพัฒนาผลการเรียนรู้ในแต่ละด้าน",
                "subcategories": {
                    "คุณธรรม_จริยธรรม": {
                        "ผลการเรียนรู้": "นักศึกษาต้องมีคุณธรรม จริยธรรมเพื่อให้สามารถดำเนินชีวิตร่วมกับผู้อื่นในสังคมอย่างราบรื่น และเป็นประโยชน์ต่อส่วนรวม ทั้งในฐานะวิศวกรเคมีและนักวิจัยจำเป็นมีความรับผิดชอบต่อผลที่เกิดขึ้นเช่นเดียวกับการประกอบอาชีพในสาขาอื่น ๆ",
                        "วิธีการสอน": "อาจารย์ที่สอนในแต่ละวิชาต้องพยายามสอดแทรกเรื่องที่เกี่ยวกับสิ่งต่อไปนี้ทั้ง 6 ข้อ เพื่อให้นักศึกษาสามารถพัฒนาคุณธรรม จริยธรรมไปพร้อมกับวิทยาการต่าง ๆ ที่ศึกษา",
                        "คุณสมบัติอาจารย์": "อาจารย์ต้องมีคุณสมบัติด้านคุณธรรมจริยธรรมอย่างน้อย 6 ข้อตามที่ระบุไว้",
                        "ผลการเรียนรู้ที่ต้องการ": [
                            "ตระหนักในคุณค่าและคุณธรรม จริยธรรม เสียสละ และซื่อสัตย์สุจริต",
                            "มีวินัย ตรงต่อเวลา และความรับผิดชอบต่อตนเอง วิชาชีพและสังคม",
                            "มีภาวะความเป็นผู้นำและผู้ตาม สามารถทำงานเป็นทีมและสามารถแก้ไขข้อขัดแย้งและลำดับความสำคัญ"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 54,
        "details": [
            {
                "category": "การประเมินหลักสูตร",
                "subcategories": {
                    "การสำรวจการมีงานทำ": "มีการสำรวจการมีงานทำของมหาบัณฑิต โดยที่ร้อยละของมหาบัณฑิตที่มีงานทำภายใน 1 ปี หลังสำเร็จการศึกษาไม่น้อยกว่าร้อยละ 70",
                    "ความพึงพอใจของผู้ใช้มหาบัณฑิต": "ระดับความพึงพอใจของผู้ใช้มหาบัณฑิตต่อคุณภาพมหาบัณฑิต ไม่น้อยกว่า 3.5 จากคะแนนเต็ม 5 ภายหลังจากสำเร็จการศึกษาอย่างน้อย 1 ปี",
                    "การปรับปรุงหลักสูตร": "มีการปรับเปลี่ยนรายละเอียดวิชาเพื่อให้ทันสมัย และสอดคล้องกับความต้องการของตลาดแรงงาน"
                }
            },
            {
                "category": "นักศึกษา",
                "subcategories": {
                    "การให้คำปรึกษา": {
                        "อาจารย์ที่ปรึกษาทางวิชาการ": "คณะฯ มีการแต่งตั้งอาจารย์ที่ปรึกษาทางวิชาการให้แก่นักศึกษาทุกคน",
                        "ชั่วโมงให้คำปรึกษา": "ทุกคนต้องกำหนดชั่วโมงให้คำปรึกษา (Office Hours) เพื่อให้นักศึกษาเข้าปรึกษาได้",
                        "ที่ปรึกษากิจกรรม": "ต้องมีที่ปรึกษากิจกรรมเพื่อให้คำปรึกษาแนะนำในการจัดทำกิจกรรมแก่นักศึกษา"
                    },
                    "การแต่งตั้งอาจารย์ที่ปรึกษา": {
                        "อาจารย์ที่ปรึกษาทั่วไป": "สาขาวิชาฯ แต่งตั้งประธานหลักสูตรฯ เป็นอาจารย์ที่ปรึกษาทั่วไป เพื่อให้คำปรึกษาด้านวิชาการและอื่น ๆ แก่นักศึกษาชั้นปีที่ 1",
                        "อาจารย์ที่ปรึกษาวิทยานิพนธ์": "คณบดีแต่งตั้งอาจารย์ที่ปรึกษาวิทยานิพนธ์สำหรับนักศึกษาให้มีหน้าที่แนะนำและควบคุมการทำวิทยานิพนธ์",
                        "อาจารย์ประจำรายวิชา": "อาจารย์ประจำรายวิชากำหนดตารางเวลาให้คำปรึกษาทางวิชาการแก่นักศึกษาที่ลงทะเบียนเรียนรายวิชานั้น"
                    },
                    "การอุทธรณ์ของนักศึกษา": {
                        "การขอดูคะแนน": "นักศึกษาสามารถยื่นคำร้องขอดูกระดาษคำตอบ ตลอดจนดูคะแนนและวิธีการประเมินของอาจารย์แต่ละรายวิชาได้",
                        "ข้อบังคับการอุทธรณ์": "การอุทธรณ์ของนักศึกษา ให้เป็นไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยวินัยนักศึกษา พ.ศ. 2547 หมวดที่ 4"
                    }
                }
            },
            {
                "category": "คณาจารย์",
                "subcategories": {
                    "การรับอาจารย์ใหม่": {
                        "ระเบียบการรับสมัคร": "การรับสมัครอาจารย์ใหม่เป็นไปตามระเบียบของมหาวิทยาลัยธรรมศาสตร์",
                        "การกำหนดคุณสมบัติ": "สาขาวิชาฯ เป็นผู้กำหนดคุณวุฒิและคุณสมบัติที่ต้องการ",
                        "กระบวนการคัดเลือก": "ผู้สมัครต้องนำเสนอผลงานวิจัยแบบปากเปล่าหรือสอบสอน ในที่ประชุมคณาจารย์ และสอบสัมภาษณ์โดยคณะกรรมการที่ได้รับการแต่งตั้ง"
                    },
                    "การมีส่วนร่วมในการบริหารหลักสูตร": {
                        "กรรมการบริหารหลักสูตร": "อาจารย์ประจำหลักสูตรอย่างน้อยร้อยละ 50 ร่วมเป็นกรรมการบริหารหลักสูตรฯ",
                        "การประชุม": "มีการประชุมอย่างน้อยปีละ 3 ครั้ง รวมถึงการประชุมก่อนและหลังภาคการศึกษา และมีการประชุมคณาจารย์"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 43,
        "details": [
            {
                "category": "ทักษะทางปัญญา",
                "subcategories": {
                    "กลยุทธ์การประเมินผลการเรียนรู้": "ประเมินจากการสอบวิทยานิพนธ์ การนำเสนองานวิจัยในที่ประชุมวิชาการ และการปฏิบัติของนักศึกษา"
                }
            },
            {
                "category": "ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ",
                "subcategories": {
                    "ผลการเรียนรู้": [
                        "สามารถสื่อสารทั้งภาษาไทยและภาษาต่างประเทศกับกลุ่มคนหลากหลายได้อย่างมีประสิทธิภาพ",
                        "สามารถให้ความช่วยเหลือและอำนวยความสะดวกในการแก้ปัญหาสถานการณ์ต่าง ๆ ทั้งในบทบาทของผู้นำ หรือในบทบาทของผู้ร่วมทีมทำงาน",
                        "สามารถใช้ความรู้ในศาสตร์มาชี้นำสังคมในประเด็นที่เหมาะสม",
                        "มีความรับผิดชอบในการกระทำของตนเองและรับผิดชอบงานในกลุ่ม",
                        "สามารถเป็นผู้ริเริ่มแสดงประเด็นในการแก้ไขสถานการณ์ทั้งส่วนตัวและส่วนรวม พร้อมทั้งแสดงจุดยืนอย่างพอเหมาะทั้งของตนเองและของกลุ่ม",
                        "มีความรับผิดชอบการพัฒนาการเรียนรู้ทั้งของตนเองและทางวิชาชีพอย่างต่อเนื่อง"
                    ],
                    "กลยุทธ์การสอน": [
                        "ใช้การสอนที่มีการกำหนดกิจกรรมให้มีการทำงานเป็นกลุ่ม การทำงานที่ต้องประสานงานกับผู้อื่น หรือต้องค้นคว้าหาข้อมูลจากการสัมภาษณ์บุคคลอื่น หรือผู้มีประสบการณ์",
                        "ในการทำงานวิจัยในกลุ่มวิจัย ต้องมีการติดต่อประสานงานภายในกลุ่มและบุคคลภายนอกในการสืบค้นข้อมูล วัสดุอุปกรณ์เครื่องมือในการวิจัยและความช่วยเหลือต่าง ๆ",
                        "ในวิชาปฏิบัติการในโรงงานอุตสาหกรรมนักศึกษาได้ฝึกผนการทำงานร่วมกับผู้อื่น ในหลายระดับ"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 27,
        "details": [
            {
                "category": "วิชาสัมมนาและปัญหาพิเศษ",
                "subcategories": {
                    "วค_793_ปัญหาพิเศษทางวิจัยอุตสาหกรรมเคมี": {
                        "รหัสวิชา": "วค 793",
                        "ชื่อวิชาภาษาไทย": "ปัญหาพิเศษทางวิจัยอุตสาหกรรมเคมี",
                        "ชื่อวิชาภาษาอังกฤษ": "Special Problems in Chemical Industrial Research",
                        "หน่วยกิต": "3(3-0-9)",
                        "คำอธิบายรายวิชา": "การวิจัยเชิงปฏิบัติการเพื่อแก้ปัญหาของอุตสาหกรรมเคมี"
                    },
                    "วค_794_ปฏิบัติการพิเศษทางอุตสาหกรรมเคมี": {
                        "รหัสวิชา": "วค 794",
                        "ชื่อวิชาภาษาไทย": "ปฏิบัติการพิเศษทางอุตสาหกรรมเคมี",
                        "ชื่อวิชาภาษาอังกฤษ": "Special Practical Training in Chemical Industries",
                        "หน่วยกิต": "3(0-6-6)",
                        "คำอธิบายรายวิชา": "การแก้ปัญหาเชิงปฏิบัติของโรงงานที่เกี่ยวข้องกับอุตสาหกรรมหรือกระบวนการทางเคมี"
                    }
                }
            },
            {
                "category": "วิทยานิพนธ์",
                "subcategories": {
                    "วค_803_วิทยานิพนธ์": {
                        "รหัสวิชา": "วค 803",
                        "ชื่อวิชาภาษาไทย": "วิทยานิพนธ์",
                        "ชื่อวิชาภาษาอังกฤษ": "Thesis",
                        "หน่วยกิต": "36 หน่วยกิต",
                        "คำอธิบายรายวิชา": "การสร้างโครงการวิจัยและการดำเนินการวิจัยอันก่อให้เกิดองค์ความรู้ใหม่ในสาขาวิศวกรรมเคมี กระบวนการผลิตภัณฑ์หรือนวัตกรรมต่างๆ ในสาขาของวิศวกรรมเคมี และนำเสนอวิทยานิพนธ์ การเขียนรายงาน การวิจัยเพื่อเผยแพร่ต่อสาธารณะโดยการวิจัยนั้นต้องไม่ขัดต่อศีลธรรมจริยธรรมและคงไว้ซึ่งจริยธรรมในการเผยแพร่ผลงานวิชาการ (สำหรับนักศึกษาแผน ก แบบ ก1)",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Preparation of research proposal; Research execution in the field of chemical engineering that lead to the innovation or novelty on chemical engineering knowledge; Research skills enhancement as well as communication skills as a role of competent chemical engineer; Article writing and research presentation, emphasizing on maintain the research ethics and morals upon every steps of the research execution."
                    },
                    "วค_804_วิทยานิพนธ์": {
                        "รหัสวิชา": "วค 804",
                        "ชื่อวิชาภาษาไทย": "วิทยานิพนธ์",
                        "ชื่อวิชาภาษาอังกฤษ": "Thesis",
                        "หน่วยกิต": "18 หน่วยกิต",
                        "วิชาบังคับก่อน": "ต้องลงทะเบียนเรียนแล้วไม่น้อยกว่า 12 หน่วยกิตหรือ 1 ภาคการศึกษา มีผลการเรียนเฉลี่ยสะสมไม่ต่ำกว่า 3.00"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 10,
        "details": [
            {
                "category": "โครงสร้างหลักสูตร",
                "subcategories": {
                    "วิชาเสริมพื้นฐาน": "ไม่นับหน่วยกิตรวม",
                    "วิชาบังคับ": "14 หน่วยกิต",
                    "วิชาเลือก": "6 หน่วยกิต",
                    "วิทยานิพนธ์": "18 หน่วยกิต"
                }
            },
            {
                "category": "รายวิชาในหลักสูตร",
                "subcategories": {
                    "รหัสวิชา": {
                        "อักษรย่อ": "วค/AE หมายถึง อักษรย่อของสาขาวิชาวิศวกรรมเคมี",
                        "เลขหลักหน่วย": {
                            "เลข 1-2": "วิชาบังคับ",
                            "เลข 3-9, 0": "วิชาเลือก"
                        },
                        "เลขหลักสิบ": {
                            "เลข 0": "หมวดวิชาพื้นฐาน และวิทยานิพนธ์",
                            "เลข 1": "หมวดวิชาอุณหพลศาสตร์ เทคโนโลยีพลังงานและการเผาไหม้",
                            "เลข 2": "หมวดวิชาปรากฏการณ์ถ่ายโอนและกระบวนการแยก",
                            "เลข 3": "หมวดวิชาวิศวกรรมปฏิกิริยาเคมีและปิโตรเคมี",
                            "เลข 4": "หมวดวิชาคณิตศาสตร์และการควบคุมระบบ",
                            "เลข 5": "หมวดวิชาสิ่งแวดล้อม",
                            "เลข 6": "หมวดวิชาวิศวกรรมชีวเคมีและเทคโนโลยีชีวภาพ",
                            "เลข 7": "หมวดวิชาเทคโนโลยีวัสดุและพอลิเมอร์",
                            "เลข 9": "หมวดวิชาสัมมนา และปัญหาพิเศษ"
                        },
                        "เลขหลักร้อย": {
                            "เลข 5": "วิชาเสริมพื้นฐาน",
                            "เลข 6-7": "วิชาบังคับ วิชาเลือก วิชาสัมมนาและปัญหาพิเศษ",
                            "เลข 8": "วิชาวิทยานิพนธ์"
                        }
                    }
                }
            },
            {
                "category": "วิชาเสริมพื้นฐาน",
                "subcategories": {
                    "รหัสวิชา": "วค 500",
                    "ชื่อวิชา": "สมดุลมวลสารและพลังงาน",
                    "ชื่อวิชาภาษาอังกฤษ": "Material and Energy Balances",
                    "หน่วยกิต": "3(3-0-9)"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 71,
        "details": [
            {
                "category": "รายชื่ออาจารย์และผลงานวิชาการ",
                "subcategories": {
                    "รองศาสตราจารย์ ดร.ภาณุ ด่านวานิชกุล": {
                        "บทความวิจัย": [
                            "Phungrassami, H. & Usubharatana, P. (2015). Life cycle assessment and eco-efficiency of para-rubber wood production in Thailand. Polish Journal of Environmental Studies, 24(5), 2113-2126.",
                            "Usubharatana, P. & Phungrassami, H. (2016). Life cycle assessment of the straw mushroom production. Applied Ecology and Environmental Research, 14(1), 189-200.",
                            "Usubharatana, P. & Phungrassami, H. (2016). Ecological footprint analysis of canned sweet corn. Journal of Ecological Engineering, 17(3), 22-29.",
                            "Usubharatana, P. & Phungrassami, H. (2016). Greenhouse gas emission in the chicken feed industry using life cycle considerations: Thailand case study. Journal of Chemical Engineering of Japan, 49(10), 943-950.",
                            "Usubharatana, P. & Phungrassami, H. (2017). Greenhouse gas emissions of one-day-old chick production. Polish Journal of Environmental Studies, 26(3), 1-9.",
                            "Usubharatana, P. & Phungrassami, H. (2017). Evaluation of opportunities to reduce the carbon footprint of fresh and canned pineapple processing in Central Thailand. Polish Journal of Environmental Studies, 26(4), 1725-1735."
                        ]
                    },
                    "รองศาสตราจารย์ ดร.มาลี สันติคุณาภรณ์": {
                        "บทความวิจัย": [
                            "Echaroj, S., Santikunaporn, M. & Chavadej, S. (2017). Transformation of bioderived 1-decanol to diesel-like fuel and biobased oil via dehydration and oligomerization reactions. Energy and Fuel, 31, 9465-9476.",
                            "Echaroj, S., Santikunaporn, M. & Chavadej, S. (2015). Micro-kinetic modeling of the catalytic dehydration of 1-decanol over precipitated Al2O3. Reaction Kinetics, Mechanisms and Catalysis, 114, 75-91.",
                            "Santikunaporn M., Echaroj S. & Rimpikul W. (2015). Evaluation of agricultural wastes for biogas production. Thammasat Int. J. Sc. Tech., 19, 1-8."
                        ]
                    },
                    "รองศาสตราจารย์ ดร.วรณี มังคละศิริ": {
                        "ตำรา": [
                            "วรณี แพ่งจันทึก. (2557) พลศาสตร์ของกระบวนการและการควบคุม. สำนักพิมพ์มหาวิทยาลัยธรรมศาสตร์."
                        ],
                        "บทความวิจัย": [
                            "Woranee Paengjuntuek, Jirasak Boonmak and Jitti Mungkalasiri. 2015. Environmental assessment of integrated biomass gasification fuel cell for power generation system. International Journal of Environmental Science and Development, Vol. 6. 445-460.",
                            "บุญช่วย ปานอินทร์, วรณี แพ่งจันทึก และจิตติ มังคละศิริ. 2560. การศึกษาความเหมาะสมของการผลิตเอทานอลจากน้ำตาลทรายดิบและกากน้ำตาล. วารสารวิทยาศาสตร์และเทคโนโลยี, ปีที่ 25 ฉบับที่ 1, หน้า 148-157.",
                            "จิตติ มังคละศิริ และวรณี แพ่งจันทึก. 2560. การศึกษาปัจจัยที่มีผลต่อระบบผลิตไฟฟ้าโดยกระบวนการผลิตก๊าซจากชีวมวลร่วมกับเซลล์เชื้อเพลิงชนิดออกไซด์แข็งด้วยโปรแกรม ASPEN PLUS. วารสาร"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 14,
        "details": [
            {
                "category": "หมวดวิชาวิศวกรรมสิ่งแวดล้อม",
                "subcategories": {
                    "วค_654": {
                        "ชื่อวิชา": "การประเมินวงชีวิตผลิตภัณฑ์",
                        "ชื่อวิชาภาษาอังกฤษ": "Product Life Cycle Assessment",
                        "หน่วยกิต": "3(3-0-9)"
                    },
                    "วค_655": {
                        "ชื่อวิชา": "การบำบัดมลพิษทางน้ำจากอุตสาหกรรม",
                        "ชื่อวิชาภาษาอังกฤษ": "Industrial Wastewater Treatment",
                        "หน่วยกิต": "3(3-0-9)"
                    },
                    "วค_656": {
                        "ชื่อวิชา": "การจัดการกากอุตสาหกรรม",
                        "ชื่อวิชาภาษาอังกฤษ": "Industrial Waste Management",
                        "หน่วยกิต": "3(3-0-9)"
                    },
                    "วค_657": {
                        "ชื่อวิชา": "การควบคุมมลพิษทางอากาศจากอุตสาหกรรม",
                        "ชื่อวิชาภาษาอังกฤษ": "Industrial Air Pollution Control",
                        "หน่วยกิต": "3(3-0-9)"
                    }
                }
            },
            {
                "category": "หมวดวิชาวิศวกรรมชีวเคมีและเทคโนโลยีชีวภาพ",
                "subcategories": {
                    "วค_663": {
                        "ชื่อวิชา": "วิศวกรรมชีวเคมี",
                        "ชื่อวิชาภาษาอังกฤษ": "Biochemical Engineering",
                        "หน่วยกิต": "3(3-0-9)"
                    },
                    "วค_664": {
                        "ชื่อวิชา": "การจำลองแบบสิ่งแวดล้อม",
                        "ชื่อวิชาภาษาอังกฤษ": "Environmental Modelling",
                        "หน่วยกิต": "3(3-0-9)"
                    }
                }
            },
            {
                "category": "หมวดวิชาปัญหาพิเศษ",
                "subcategories": {
                    "วค_793": {
                        "ชื่อวิชา": "ปัญหาพิเศษทางวิจัยอุตสาหกรรมเคมี",
                        "ชื่อวิชาภาษาอังกฤษ": "Special Problems in Chemical Industrial Research",
                        "หน่วยกิต": "3(3-0-9)"
                    },
                    "วค_794": {
                        "ชื่อวิชา": "ปฏิบัติการพิเศษทางอุตสาหกรรมเคมี",
                        "ชื่อวิชาภาษาอังกฤษ": "Special Practical Training in Chemical Industries",
                        "หน่วยกิต": "3(0-6-6)"
                    }
                }
            },
            {
                "category": "วิทยานิพนธ์",
                "subcategories": {
                    "วค_803": {
                        "ชื่อวิชา": "วิทยานิพนธ์",
                        "ชื่อวิชาภาษาอังกฤษ": "Thesis",
                        "หน่วยกิต": "36 หน่วยกิต",
                        "หมายเหตุ": "นักศึกษาแผน ก แบบ ก1 จำนวน 36 หน่วยกิต นักศึกษาแผน ก แบบ ก 2 จำนวน 18 หน่วยกิต"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 84,
        "details": [
            {
                "category": "หลักสูตรฉบับ พ.ศ. 2558 และ พ.ศ. 2561",
                "subcategories": {
                    "ความเกี่ยวข้องกับเทคโนโลยี": "บัณฑิตสาขาวิศวกรรมเคมีสามารถปรับตัวกับเทคโนโลยีสมัยใหม่ที่เกี่ยวข้องกับการพัฒนาเทคโนโลยีและกระบวนการทางเคมีและวัสดุศาสตร์จากอุตสาหกรรมเคมี และ/หรือ ปิโตรเคมี ได้โดยง่าย",
                    "การประยุกต์ใช้ทักษะ": "การพัฒนาด้านเทคโนโลยีพลังงาน หรือเทคโนโลยีด้านสิ่งแวดล้อม จำเป็นต้องใช้ทักษะด้านความคิดรวบยอดและกระบวนการทางเคมีมาประยุกต์ใช้",
                    "เป้าหมายของภาควิชา": "ภาควิชาวิศวกรรมเคมี คณะวิศวกรรมศาสตร์ มหาวิทยาลัยธรรมศาสตร์ เล็งเห็นความสำคัญในการผลิตบัณฑิตที่คิดเป็น และมีความรู้พื้นฐานทางด้านปรากฏการณ์ทางกระบวนการทางเคมีต่างๆ"
                }
            },
            {
                "category": "วัตถุประสงค์",
                "subcategories": {
                    "ลักษณะของมหาบัณฑิต": [
                        "1. เป็นวิศวกรและนักวิจัยระดับสูงในสาขาวิชาวิศวกรรมเคมีที่สามารถพัฒนาเทคโนโลยีในภาคอุตสาหกรรมและแก้ปัญหาภาคการผลิตในเชิงลึก",
                        "2. มีความรู้ความสามารถในการพัฒนากิจกรรมงานวิจัยในสาขาวิชาวิศวกรรมเคมีและสาขาอื่นที่เกี่ยวข้อง",
                        "3. เป็นผู้ที่สามารถปรับตัวกับเทคโนโลยีสมัยใหม่ที่มีการเปลี่ยนแปลงตามยุคสมัยได้ง่าย"
                    ]
                }
            },
            {
                "category": "คุณสมบัติของผู้เข้าศึกษา",
                "subcategories": {
                    "ข้อบังคับ": "คุณสมบัติของผู้เข้าศึกษาต้องเป็นไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ว่าด้วยการศึกษาระดับบัณฑิตศึกษา พ.ศ. 2561",
                    "แผน ก แบบ ก 1": [
                        "1. สำเร็จการศึกษาวิศวกรรมศาสตรบัณฑิต (วศ.บ.) สาขาวิศวกรรมเคมี ที่มีเกรดเฉลี่ยตลอดหลักสูตรไม่น้อยกว่า 2.75 จาก 4.00",
                        "2. สำเร็จการศึกษาวิศวกรรมศาสตรบัณฑิต (วศ.บ.) สาขาวิศวกรรมเคมี ที่มีเกรดเฉลี่ยตลอดหลักสูตรไม่น้อยกว่า 2.50 จาก 4.00 และมีเกรดในวิชาโครงงานในระดับ A",
                        "3. สำเร็จการศึกษาวิทยาศาสตรบัณฑิต (วท.บ.) หรือครุศาสตรอุตสาหกรรมบัณฑิต (คอ.บ.) หรือเทียบเท่า ที่มีเกรดเฉลี่ยไม่น้อยกว่า 3.00 จาก 4.00"
                    ],
                    "แผน ก แบบ ก 2": "ข้อมูลไม่ระบุในเอกสารที่ให้มา"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 80,
        "details": [
            {
                "category": "Publication Information",
                "subcategories": {
                    "Author": "อาจารย์ ดร.ศรุต อ ามาตย์โยธิน",
                    "Number_of_Publications": "10"
                }
            },
            {
                "category": "Research Articles",
                "subcategories": {
                    "Article_1": {
                        "Authors": "Bunnak N., Ummartyotin S., Laoratanakul P., Bhalla A.S., Manuspiya H.",
                        "Year": "2014",
                        "Title": "Synthesis and characterization of magnetic porous clay heterostructure",
                        "Journal": "Journal of Porous Materials",
                        "Volume": "21",
                        "Pages": "1-8"
                    },
                    "Article_2": {
                        "Authors": "O-Rak K., Phakdeepataraphan E., Bunnak N., Ummartyotin S., Sain M., Manuspiya H.",
                        "Year": "2014",
                        "Title": "Preparation and characterization of bacterial cellulose/ poly (vinylidene fluoride) (PVDF) blend",
                        "Journal": "Chemical Engineering Journal",
                        "Volume": "237",
                        "Pages": "396-402"
                    },
                    "Article_3": {
                        "Authors": "Ummartyotin S., Sain M.",
                        "Year": "2014",
                        "Title": "Preparation of cellulose and water based resin composite",
                        "Journal": "Materials Letters",
                        "Volume": "123",
                        "Pages": "70-74"
                    },
                    "Article_4": {
                        "Authors": "Ummartyotin S., Manuspiya H.",
                        "Year": "2015",
                        "Title": "A critical review on cellulose: From fundamental to sensor application",
                        "Journal": "Renewable and Sustainable Energy Review",
                        "Volume": "41",
                        "Pages": "402-412"
                    },
                    "Article_5": {
                        "Authors": "Ummartyotin S., Manuspiya H.",
                        "Year": "2015",
                        "Title": "An overview of feasibilities and challenge of conductive cellulose for rechargeable lithium based battery",
                        "Journal": "Renewable and Sustainable Energy Review",
                        "Volume": "50",
                        "Pages": "204-213"
                    },
                    "Article_6": {
                        "Authors": "Rittirong K., Uasopon S., Prachayawasin P., Euaphantasate N., Aiempanakit K., Ummartyotin S.",
                        "Year": "2015",
                        "Title": "CTAB as a soft template for modified clay as filler in active packaging",
                        "Journal": "Data in Brief",
                        "Volume": "3",
                        "Pages": "47-50"
                    },
                    "Article_7": {
                        "Authors": "Ummartyotin S., Tangnorawich B.",
                        "Year": "2015",
                        "Title": "Utilization of eggshell waste as raw material for synthesis of hydroxyapatite",
                        "Journal": "Colloids and Polymer Science",
                        "Volume": "293",
                        "Pages": "2477-2483"
                    },
                    "Article_8": {
                        "Authors": "Ummartyotin S., Infahsaeng Y.",
                        "Year": "2016",
                        "Title": "A comprehensive review on ZnS: From synthesis to an approach on solar cell",
                        "Journal": "Renewable and Sustainable Energy Reviews",
                        "Volume": "55",
                        "Pages": "17-24"
                    },
                    "Article_9": {
                        "Authors": "Ummartyotin S., Pechyen C.",
                        "Year": "2016",
                        "Title": "Microcrystalline-cellulose and polypropylene based composite: A simple, selective and effective material for microwavable packaging",
                        "Journal": "Carbohydrate Polymers",
                        "Volume": "142",
                        "Pages": "133-140"
                    }
                }
            },
            {
                "category": "Research Themes",
                "subcategories": {
                    "Theme_1": "Materials Science",
                    "Theme_2": "Composites",
                    "Theme_3": "Cellulose-based materials",
                    "Theme_4": "Renewable Energy",
                    "Theme_5": "Packaging Materials"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 5,
        "details": [
            {
                "category": "การพัฒนาที่สมดุลและยั่งยืน",
                "subcategories": {
                    "ระบบภูมิคุ้มกัน": "สอดคล้องกับภูมิสังคม",
                    "มิติการพัฒนา": "มีดุลยภาพทั้งมิติเศรษฐกิจ สังคม และระบบนิเวศน์",
                    "ความสัมพันธ์ระหว่างมิติ": "มีความสอดรับ เกื้อกูล และพึ่งพาอาศัยซึ่งกันและกัน",
                    "ผลกระทบ": "การพัฒนาในมิติหนึ่งต้องไม่ส่งผลกระทบทางลบต่อมิติอื่นๆ"
                }
            },
            {
                "category": "การพัฒนาคน",
                "subcategories": {
                    "แนวคิดหลัก": "คนเป็นศูนย์กลางการพัฒนา",
                    "เป้าหมาย": "พัฒนาคนทุกวัยให้เป็นคนดี คนเก่ง มีศักยภาพ และความคิดสร้างสรรค์",
                    "ผลลัพธ์ที่ต้องการ": "เพิ่มศักยภาพการแข่งขันทั้งในภาคการผลิตและภาคบริการ",
                    "คุณลักษณะที่พึงประสงค์": "มีคุณธรรมจริยธรรม มีจิตสำนึกรับผิดชอบต่อส่วนรวม"
                }
            },
            {
                "category": "การพัฒนาทางสังคมและวัฒนธรรม",
                "subcategories": {
                    "สถานการณ์ปัจจุบัน": "ก้าวเข้าสู่สังคมผู้สูงอายุและประเทศไทย 4.0",
                    "บทบาทของเทคโนโลยี": "เทคโนโลยีและนวัตกรรมทางวิศวกรรมเคมีเป็นเครื่องมือในการพัฒนาอย่างยั่งยืน",
                    "ความต้องการ": "ประชาชนไทยต้องมีความสามารถทางเทคโนโลยีที่ดี คิดเป็นทำเป็น",
                    "การปรับตัว": "สามารถปรับตัวให้เข้ากับสถานการณ์และนำความรู้มาแก้ปัญหาทางสังคม"
                }
            },
            {
                "category": "การพัฒนาหลักสูตร",
                "subcategories": {
                    "เหตุผลในการพัฒนา": "ผลิตบุคลากรที่เข้าใจสถานการณ์และมีภูมิคุ้มกันต่อการเปลี่ยนแปลง",
                    "เป้าหมาย": "พัฒนาศักยภาพในการประยุกต์ความรู้ทางวิศวกรรมเคมีเพื่อแก้ปัญหา",
                    "การปรับปรุง": "เน้นให้นักศึกษามีเวลาในการทำวิจัยเชิงลึกและติดตามความก้าวหน้าทางเทคโนโลยี",
                    "ผลที่คาดหวัง": "เตรียมพร้อมให้สังคมได้รับคำตอบและมีทางเลือกใหม่ๆในการพัฒนาประเทศ"
                }
            },
            {
                "category": "ความเกี่ยวข้องกับพันธกิจของสถาบัน",
                "subcategories": {
                    "พันธกิจด้านการเรียนการสอน": "เกี่ยวข้องโดยตรง",
                    "พันธกิจด้านการวิจัย": "เกี่ยวข้องโดยตรง",
                    "พันธกิจด้านการพัฒนาคุณภาพนักศึกษา": "เกี่ยวข้องโดยตรง",
                    "พันธกิจด้านการทำนุบำรุงศิลปะวัฒนธรรมไทย": "เกี่ยวข้องโดยตรง"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 33,
        "details": [
            {
                "category": "บุคลากรทางวิชาการ",
                "subcategories": [
                    {
                        "ลำดับ": "12",
                        "เลขประจำตัวประชาชน": "3100400836xxx",
                        "ตำแหน่งทางวิชาการ": "ผู้ช่วยศาสตราจารย์",
                        "ชื่อ-สกุล": "นายโปรดปราน สิริธีรศาสน์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "วท.ม.",
                                "สาขาวิชา": "เคมีวิศวกรรม",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2538"
                            },
                            {
                                "ระดับ": "วท.บ.",
                                "สาขาวิชา": "เคมีเทคนิค",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2534"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "13",
                        "เลขประจำตัวประชาชน": "3102001818xxx",
                        "ตำแหน่งทางวิชาการ": "อาจารย์",
                        "ชื่อ-สกุล": "นายธนิทธิ์ พิพัฒพันธุ์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "M.S.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "Washington University at St. Louis, U.S.A.",
                                "ปี": "2541"
                            },
                            {
                                "ระดับ": "วท.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี-เคมีเทคนิค",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2531"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "14",
                        "เลขประจำตัวประชาชน": "3100201289xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "นายไพรัช อุศุภรัตน์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Environmental System Engineering",
                                "สถาบัน": "University of Regina, Canada",
                                "ปี": "2552"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "มหาวิทยาลัยธรรมศาสตร์",
                                "ปี": "2540"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "15",
                        "เลขประจำตัวประชาชน": "3909800880xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "นายหาญพล พึ่งรัศมี",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Environmental Engineering",
                                "สถาบัน": "Ajou University, South Korea",
                                "ปี": "2550"
                            },
                            {
                                "ระดับ": "M.Eng.",
                                "สาขาวิชา": "Environmental Technology and Management-Cleaner Production",
                                "สถาบัน": "สถาบันเทคโนโลยีแห่งเอเชีย",
                                "ปี": "2544"
                            },
                            {
                                "ระดับ": "วศ.บ.",
                                "สาขาวิชา": "วิศวกรรมเคมี",
                                "สถาบัน": "มหาวิทยาลัยธรรมศาสตร์",
                                "ปี": "2540"
                            }
                        ]
                    },
                    {
                        "ลำดับ": "16",
                        "เลขประจำตัวประชาชน": "3120100583xxx",
                        "ตำแหน่งทางวิชาการ": "รองศาสตราจารย์",
                        "ชื่อ-สกุล": "นางสาวมาลี สันติคุณาภรณ์",
                        "คุณวุฒิ": [
                            {
                                "ระดับ": "Ph.D.",
                                "สาขาวิชา": "Chemical Engineering",
                                "สถาบัน": "University of Oklahoma, U.S.A",
                                "ปี": "2544"
                            },
                            {
                                "ระดับ": "วท.ม.",
                                "สาขาวิชา": "ไม่ระบุ",
                                "สถาบัน": "จุฬาลงกรณ์มหาวิทยาลัย",
                                "ปี": "2541"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 48,
        "details": [
            {
                "category": "รายวิชา",
                "subcategories": {
                    "วค_617": "เชื้อเพลิงสะอาด พลังงาน และสิ่งแวดล้อม",
                    "วค_623": "กระบวนการแยกขั้นกลาง",
                    "วค_625": "เทคโนโลยีอุตสาหกรรมปิโตรเคมี",
                    "วค_626": "กระบวนการผลิต แก๊สธรรมชาติและการทำบริสุทธิ์น้ำมัน",
                    "วค_630": "เทคนิคการหาลักษณะเฉพาะของพื้นผิวของแข็ง",
                    "วค_634": "วิทยาการตัวเร่งปฏิกิริยา",
                    "วค_637": "วิทยาการวัสดุศาสตร์ขั้นกลาง",
                    "วค_638": "รีโอโลยีและกระบวนการขึ้นรูปของพอลิเมอร์",
                    "วค_639": "เทคโนโลยียางและกาว",
                    "วค_643": "อุปกรณ์และเครื่องมือวัดในกระบวนการผลิตของอุตสาหกรรมเคมี",
                    "วค_645": "การคำนวณทางด้านวิศวกรรมเคมีเบื้องต้น",
                    "วค_646": "โปรแกรมสำเร็จรูปในงานอุตสาหกรรม",
                    "วค_648": "การออกแบบการทดลองสำหรับงานวิจัยทางวิศวกรรมเคมี",
                    "วค_654": "การประเมินวงชีวิตผลิตภัณฑ์"
                }
            },
            {
                "category": "ทักษะการเรียนรู้",
                "subcategories": {
                    "คุณธรรม_จริยธรรม": "1 2 3 4 5 6",
                    "ความรู้": "1 2 3 4 5 6",
                    "ทักษะทางปัญญา": "1 2 3 4",
                    "ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": "1 2 3 4 5 6",
                    "ทักษะการวิเคราะห์เชิงตัวเลขการสื่อสารและเทคโนโลยีสารสนเทศ": "1 2 3"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 1,
        "details": [
            {
                "category": "หลักสูตร",
                "subcategories": {
                    "ชื่อหลักสูตร": "หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต",
                    "สาขาวิชา": "วิศวกรรมเคมี",
                    "ประเภทหลักสูตร": "หลักสูตรปรับปรุง",
                    "ปีที่ปรับปรุง": "พ.ศ. 2561"
                }
            },
            {
                "category": "หน่วยงานที่รับผิดชอบ",
                "subcategories": {
                    "คณะ": "คณะวิศวกรรมศาสตร์",
                    "มหาวิทยาลัย": "มหาวิทยาลัยธรรมศาสตร์"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 47,
        "details": [
            {
                "category": "รายวิชา",
                "subcategories": {
                    "วค_500": "สมดุลมวลสารและพลังงาน",
                    "วค_501": "กลศาสตร์ของไหลสำหรับวิศวกรรมเคมี",
                    "วค_502": "การถ่ายเทความร้อน",
                    "วค_503": "วิศวกรรมปฏิกิริยา",
                    "วค_504": "การถ่ายโอนมวล",
                    "วค_506": "เธอร์โมไดนามิกส์วิศวกรรมเคมี",
                    "วค_611": "เธอร์โมไดนามิกส์วิศวกรรมเคมีขั้นกลาง",
                    "วค_621": "ปรากฏการณ์การถ่ายโอนขั้นกลาง",
                    "วค_631": "จลนพลศาสตร์เคมีและการออกแบบเครื่องปฏิกรณ์เคมีขั้นกลาง",
                    "วค_647": "การจำลองกระบวนการเคมีและการประเมินทางเศรษฐศาสตร์",
                    "วค_615": "เธอร์โมไดนามิกส์เชิงสถิติเบื้องต้น",
                    "วค_616": "การอนุรักษ์พลังงานและเทคโนโลยีพลังงาน"
                }
            },
            {
                "category": "มาตรฐานผลการเรียนรู้",
                "subcategories": {
                    "คุณธรรม_จริยธรรม": {
                        "จำนวนหัวข้อย่อย": 6
                    },
                    "ความรู้": {
                        "จำนวนหัวข้อย่อย": 6
                    },
                    "ทักษะทางปัญญา": {
                        "จำนวนหัวข้อย่อย": 4
                    },
                    "ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": {
                        "จำนวนหัวข้อย่อย": 6
                    },
                    "ทักษะการวิเคราะห์เชิงตัวเลข_การสื่อสาร_และเทคโนโลยีสารสนเทศ": {
                        "จำนวนหัวข้อย่อย": 3
                    }
                }
            },
            {
                "category": "ความรับผิดชอบ",
                "subcategories": {
                    "ความรับผิดชอบหลัก": "●",
                    "ความรับผิดชอบรอง": "○"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 62,
        "details": [
            {
                "category": "ภาคผนวก",
                "subcategories": {
                    "ภาคผนวก_1": "ผลงานทางวิชาการ (ย้อนหลัง 5 ปี) ของอาจารย์ประจ าหลักสูตร และอาจารย์ผู้รับผิดชอบหลักสูตร (จ าแนกตามรายชื่ออาจารย์ประจ าหลักสูตร)"
                }
            },
            {
                "category": "ผลงานทางวิชาการ (ย้อนหลัง 5 ปี) ของอาจารย์ผู้รับผิดชอบหลักสูตร",
                "subcategories": {
                    "รองศาสตราจารย์_ดร.วันวิสาข์_สกลภาพ": {
                        "บทความวิจัย": [
                            "Nanta, P., Skolpap W., Kasemwong, K. & Shimoyama, Y. (2018). Development of a diffusion-limited shrinking particle model of cellulose in a carbon dioxide switchable system. Chemical Engineering Science, 179(6), 214-220.",
                            "Nanta, P., Kasemwong, K. & Skolpap, W. (2018). Isotherm and kinetic modeling on superparamagnetic nanoparticles adsorption of polysaccharide. Journal of Environmental Chemical Engineering, 6(1), 794-802.",
                            "Nanta, P., Skolpap, W., Kasemwong, K. & Shimoyama. Y. (2017). Dissolution and modification of cellulose using high-pressure carbon dioxide switchable solution. Journal of Supercritical Fluids, 130, 84-90.",
                            "Santadkha, T. & Skolpap. W. (2017). Economic comparative evaluation of combination of activated carbon generated and spent activated carbon regeneration plants. Journal of Engineering Science and Technology , 12(12), 3329-3343.",
                            "Chuchat, N, & Skolpap, W. (2015). Biogas production from poultry slaughter house and food processing wastes by microwave thermal pretreatment. Chiang Mai Journal of Science, 42(2), 456-468. National Journal.",
                            "Wichitchan, C, & Skolpap, W. (2014). Optimum cost for ethanol production from cassava roots and cassava chips. Energy Procedia, 52, 190-203.",
                            "Kajonwattanakul C., & Skolpap, W. (2014). Development of C.B.T hot end yoke devices for hot line insulator replacement of 230-kV double suspension string for two bundles with arcing horn.Advanced Materials Research, 931-932, 862-866."
                        ]
                    },
                    "รองศาสตราจารย์_ดร.แคทลียา_ปัทมพรหม": {
                        "ตำรา": [
                            "แคทลียา ปัทมพรหม. (2557). พอลิเมอร์พื้นฐานส าหรับวิศวกรเคมี. ส านักพิมพ์มหาวิทยาลัยธรรมศาสตร์"
                        ],
                        "บทความวิจัย": [
                            "Somboonchai, S., Opaprakasit, P. & Pattamaprom, C. (2014) Value Adding of Skim Natural Rubber By Grafting With Maleic Anhydride. Advanced Material Research, 884, 41-44",
                            "Pattamaprom, C., Chareonsalung, W., Teerawattananon, C., Ausopron, S., Prachayawasin, P. van Puyveldeม P. (2016) Improvement of Impact and Thermal Properties of Polylactic Acid by Masticated Natural Rubber. Iranian Polymer Journal 25 (2),169-178",
                            "Pattamaprom, C., Saengklin, N. (2016) The Effect of Chain Scission Mechanism on the"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 79,
        "details": [
            {
                "category": "Research Publications",
                "subcategories": {
                    "Membrane_and_Packaging": {
                        "title": "membrane as absorbent material in active packaging",
                        "journal": "International Journal of Polymer Science",
                        "impact_factor": 1.0
                    },
                    "Bio-based_Materials": {
                        "title": "Strategies for development and implementation of bio-based materials as effective renewable resources of energy: A comprehensive review on adsorbent technology",
                        "authors": [
                            "Ummartyotin, S.",
                            "Pechyen C."
                        ],
                        "year": 2016,
                        "journal": "Renewable and Sustainable Energy Reviews",
                        "volume": 62,
                        "pages": "654-664",
                        "impact_factor": 8.05
                    },
                    "Poly-γ-glutamic_Acid_Production": {
                        "title": "Production of poly-γ-glutamic acid by glutamic acid-independent Bacillus licheniformis TISTR 1010 using different feeding strategies",
                        "authors": [
                            "Kongklom, N.",
                            "Luo, H.",
                            "Shi, Z.",
                            "Pechyen, C.",
                            "Chisti, Y.",
                            "Sirisansaneeyakul, S."
                        ],
                        "year": 2015,
                        "journal": "Biochemical Engineering Journal",
                        "volume": 100,
                        "pages": "67-75",
                        "impact_factor": 2.467
                    },
                    "Rice_Flour_Gel_Retrogradation": {
                        "title": "Retrogradation of rice flour gel and dough: Plasticization effects of some food additives",
                        "authors": [
                            "Ploypetchara, T.",
                            "Suwannaporn, P.",
                            "Pechyen, C.",
                            "Gohtani, S."
                        ],
                        "year": 2015,
                        "journal": "Cereal Chemistry",
                        "volume": 92,
                        "pages": "198-203",
                        "impact_factor": 1.231
                    },
                    "Cationic_Surfactants_Effect": {
                        "title": "Effect of cationic surfactants on characteristics and colorimetric behavior",
                        "authors": [
                            "Nopwinyuwong, A.",
                            "Kitaoka, T.",
                            "Boonsupthip, W.",
                            "Pechyen, C.",
                            "Suppakul, P."
                        ],
                        "year": 2014,
                        "additional_info": "The details of this publication are incomplete in the provided document."
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 89,
        "details": [
            {
                "category": "แผน ก แบบ ก2",
                "subcategories": {
                    "วิชาบังคับ": {
                        "จำนวนหน่วยกิต": "14 หน่วยกิต",
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "วค.611",
                                "ชื่อวิชา": "เธอร์โมไดนามิกส์วิศวกรรมเคมีขั้นกลาง",
                                "หน่วยกิต": "3(3-0-9)",
                                "สถานะ": "คงเดิม"
                            },
                            {
                                "รหัสวิชา": "วค.621",
                                "ชื่อวิชา": "ปรากฏการณ์การถ่ายโอนขั้นกลาง",
                                "หน่วยกิต": "3(3-0-9)",
                                "สถานะ": "คงเดิม"
                            },
                            {
                                "รหัสวิชา": "วค.631",
                                "ชื่อวิชา": "จลนพลศาสตร์เคมีและการออกแบบเครื่องปฏิกรณ์เคมีขั้นกลาง",
                                "หน่วยกิต": "3(3-0-9)",
                                "สถานะ": "คงเดิม"
                            },
                            {
                                "รหัสวิชา": "วค.647",
                                "ชื่อวิชา": "การจำลองกระบวนการเคมีและการประเมินทางเศรษฐศาสตร์",
                                "หน่วยกิต": "3(3-0-9)",
                                "สถานะ": "ปรับคำอธิบายรายวิชา"
                            },
                            {
                                "รหัสวิชา": "วค.692",
                                "ชื่อวิชา": "ระเบียบวิธีวิจัย",
                                "หน่วยกิต": "1(1-0-3)",
                                "สถานะ": "มาจากวิชาบังคับแผน ก1 และปรับคำอธิบายรายวิชา"
                            }
                        ],
                        "วิชาที่ปิด": [
                            {
                                "รหัสวิชา": "วค.791",
                                "ชื่อวิชา": "สัมมนาบัณฑิตศึกษา",
                                "หน่วยกิต": "1(0-3-3)"
                            },
                            {
                                "รหัสวิชา": "วค.792",
                                "ชื่อวิชา": "ทักษะการวิจัยและการสื่อสารสำหรับวิศวกรเคมี",
                                "หน่วยกิต": "1(1-0-3)"
                            }
                        ]
                    },
                    "วิชาเลือก": {
                        "จำนวนหน่วยกิต": "6 หน่วยกิต",
                        "เงื่อนไข": "เลือกศึกษา 2 วิชา โดยเลือกศึกษาจากรายวิชาในหมวดใดก็ได้ไม่เกิน 2 หมวดวิชา",
                        "หมวดวิชา": [
                            {
                                "ชื่อหมวด": "หมวดวิชาอุณหพลศาสตร์ เทคโนโลยีพลังงาน การเผาไหม้",
                                "รายวิชา": [
                                    {
                                        "รหัสวิชา": "วค.615",
                                        "ชื่อวิชา": "เธอร์โมไดนามิกส์เชิงสถิติเบื้องต้น",
                                        "หน่วยกิต": "3(3-0-9)",
                                        "สถานะ": "คงเดิม"
                                    },
                                    {
                                        "รหัสวิชา": "วค.616",
                                        "ชื่อวิชา": "การอนุรักษ์พลังงานและเทคโนโลยีพลังงาน",
                                        "หน่วยกิต": "3(3-0-9)",
                                        "สถานะ": "คงเดิม"
                                    },
                                    {
                                        "รหัสวิชา": "วค.617",
                                        "ชื่อวิชา": "เชื้อเพลิงสะอาด",
                                        "หน่วยกิต": "3(3-0-9)",
                                        "สถานะ": "ปรับชื่อและคำอธิบายรายวิชา"
                                    }
                                ]
                            },
                            {
                                "ชื่อหมวด": "หมวดวิชาปรากฏการณ์ถ่ายโอน กระบวนการแยก และวิศวกรรมปิโตรเคมี",
                                "รายวิชา": [
                                    {
                                        "รหัสวิชา": "วค.623",
                                        "ชื่อวิชา": "กระบวนการแยกขั้นกลาง",
                                        "หน่วยกิต": "3(3-0-9)",
                                        "สถานะ": "คงเดิม"
                                    },
                                    {
                                        "รหัสวิชา": "วค.625",
                                        "ชื่อวิชา": "เทคโนโลยีอุตสาหกรรมปิโตรเคมี",
                                        "หน่วยกิต": "3(3-0-9)",
                                        "สถานะ": "คงเดิม"
                                    },
                                    {
                                        "รหัสวิชา": "วค.626",
                                        "ชื่อวิชา": "กระบวนการผลิตแก๊สธรรมชาติและการทำบริสุทธิ์น้ำมัน",
                                        "หน่วยกิต": "3(3-0-9)",
                                        "สถานะ": "คงเดิม"
                                    }
                                ]
                            },
                            {
                                "ชื่อหมวด": "หมวดวิชาวิศวกรรมพอลิเมอร์ และวัสดุศาสตร์",
                                "รายวิชา": [
                                    {
                                        "รหัสวิชา": "วค.630",
                                        "ชื่อวิชา": "เทคนิคการหาลักษณะเฉพาะของพื้นผิวของแข็ง",
                                        "หน่วยกิต": "3(3-0-9)",
                                        "สถานะ": "คงเดิม"
                                    },
                                    {
                                        "รหัสวิชา": "วค.634",
                                        "ชื่อวิชา": "วิทยาการตัวเร่งปฏิกิริยา",
                                        "หน่วยกิต": "3(3-0-9)",
                                        "สถานะ": "คงเดิม"
                                    },
                                    {
                                        "รหัสวิชา": "วค.637",
                                        "ชื่อวิชา": "วิทยาการวัสดุศาสตร์ขั้นกลาง",
                                        "หน่วยกิต": "3(3-0-9)",
                                        "สถานะ": "คงเดิม"
                                    },
                                    {
                                        "รหัสวิชา": "วค.638",
                                        "ชื่อวิชา": "รีโอโลยีและกระบวนการขึ้นรูปของพอลิเมอร์",
                                        "หน่วยกิต": "3(3-0-9)",
                                        "สถานะ": "คงเดิม"
                                    },
                                    {
                                        "รหัสวิชา": "วค.639",
                                        "ชื่อวิชา": "เทคโนโลยียางและกาว",
                                        "หน่วยกิต": "3(3-0-9)",
                                        "สถานะ": "คงเดิม"
                                    }
                                ]
                            },
                            {
                                "ชื่อหมวด": "หมวดวิชาคณิตศาสตร์และการควบคุมระบบ",
                                "รายวิชา": [
                                    {
                                        "รหัสวิชา": "วค.643",
                                        "ชื่อวิชา": "อุปกรณ์และเครื่องมือวัดในกระบวนการผลิตของอุตสาหกรรมเคมี",
                                        "หน่วยกิต": "3(3-0-9)",
                                        "สถานะ": "คงเดิม"
                                    }
                                ],
                                "วิชาที่ปิด": [
                                    {
                                        "รหัสวิชา": "วค.644",
                                        "ชื่อวิชา": "การประเมินจุดความเหมาะสมของกระบวนการและความไวต่อผลกระทบต่างๆ",
                                        "หน่วยกิต": "3(3-0-9)"
                                    }
                                ]
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 22,
        "details": [
            {
                "category": "วค 637 วิทยาการวัสดุศาสตร์ขั้นกลาง",
                "subcategories": {
                    "รหัสวิชา": "วค 637",
                    "ชื่อวิชาภาษาไทย": "วิทยาการวัสดุศาสตร์ขั้นกลาง",
                    "ชื่อวิชาภาษาอังกฤษ": "Intermediate Material Sciences",
                    "หน่วยกิต": "3(3-0-9)",
                    "คำอธิบายรายวิชาภาษาไทย": "วิธีการสังเคราะห์และวิเคราะห์วัสดุ แนะนำเกี่ยวกับวัสดุอินทรีย์และวัสดุอนินทรีย์ซึ่งมีคุณสมบัติพิเศษต่างๆ เช่น สารกึ่งตัวนำ แม่เหล็ก สารเรืองแสง วัสดุคาร์บอน วัสดุนาโนเป็นต้น รวมทั้งศึกษาหัวข้ออื่นๆ ที่น่าสนใจ",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "The lecture describes the methods for preparation and characterization of materials. It gives an introduction to organic and inorganic functional materials such as semiconductors, magnetic materials, luminescent materials, carbon materials, nanomaterials and other interesting topics."
                }
            },
            {
                "category": "วค 638 รีโอโลยีและกระบวนการขึ้นรูปของพอลิเมอร์",
                "subcategories": {
                    "รหัสวิชา": "วค 638",
                    "ชื่อวิชาภาษาไทย": "รีโอโลยีและกระบวนการขึ้นรูปของพอลิเมอร์",
                    "ชื่อวิชาภาษาอังกฤษ": "Rheology and Processing of Polymer",
                    "หน่วยกิต": "3(3-0-9)",
                    "คำอธิบายรายวิชาภาษาไทย": "นิยามสมบัติทางรีโอโลยี ทฤษฎีทางรีโอโลยี สมบัติทางรีโอโลยีของของแข็ง ของเหลวอุดมคติและพอลิเมอร์ ทั้งพอลิเมอร์ชนิดเทอร์โมพลาสติก และเทอร์โมเซต การทดสอบสมบัติทางรีโอโลยี การขึ้นรูปและรีโอโลยีในกระบวนการขึ้นรูปต่างๆของพอลิเมอร์",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Definition of rheological properties. Rheological theory. Rheology of ideal solid, ideal liquid, and polymers, including thermoplastics and thermosets. Rheological testings. Polymer processing and rheological aspects in polymer processing."
                }
            },
            {
                "category": "วค 639 เทคโนโลยียางและกาว",
                "subcategories": {
                    "รหัสวิชา": "วค 639",
                    "ชื่อวิชาภาษาไทย": "เทคโนโลยียางและกาว",
                    "ชื่อวิชาภาษาอังกฤษ": "Rubber and Adhesive Technology",
                    "หน่วยกิต": "3(3-0-9)",
                    "คำอธิบายรายวิชาภาษาไทย": "ประเภทของยางและกาวชนิดต่างๆ ทฤษฏีการคงรูปของยางและกาวชนิดต่างๆ เทคโนโลยีในการผลิตน้ำยางข้น และยางแห้ง การทดสอบสมบัติทางรีโอโลยี สมบัติการคงรูป สมบัติเชิงกลและสมบัติการยึดติด ของยางและกาว",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Various types of rubbers and adhesives. Vulcanization/curing theory of rubber and adhesive. Rubber latex and solid rubber production. Rheological and cure characterization. Mechanical and adhesion properties of rubbers and adhesives."
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 20,
        "details": [
            {
                "category": "วค 621 การถ่ายโอนโมเมนตัม พลังงานและมวลขั้นสูง",
                "subcategories": {
                    "ทบทวนพื้นฐาน": "การถ่ายโอนโมเมนตัม พลังงานและมวลของระบบปริมาตรควบคุม",
                    "ประเภทการถ่ายโอน": "การถ่ายโอนในสภาวะคงตัวและไม่คงตัว การขนส่งแบบทิศทางเดียวและหลายทิศทาง",
                    "คุณสมบัติ": "ความสัมพันธ์ระหว่างคุณสมบัติระดับจุลภาคและมหภาค",
                    "การแก้ปัญหา": "การแก้ปัญหาค่าขอบและค่าเริ่มต้น",
                    "วิธีการแก้ปัญหา": "การแก้ปัญหาปรากฏการณ์ถ่ายโอนเพื่อหาคำตอบเชิงวิเคราะห์และคำตอบโดยประมาณด้วยวิธีเชิงตัวเลขโดยใช้โปรแกรมคอมพิวเตอร์ที่เหมาะสม"
                }
            },
            {
                "category": "วค 623 กระบวนการแยกขั้นกลาง",
                "subcategories": {
                    "การวิเคราะห์": "การถ่ายโอนในเครื่องแยกและทำบริสุทธิ์ทางเคมี",
                    "การสร้างแบบจำลอง": "การประเมินประสิทธิภาพของการแยก และการหาจุดเหมาะสมของกระบวนการ",
                    "การออกแบบ": "การเลือกใช้และออกแบบระบบแผ่นเยื่อเลือกผ่านในกระบวนการแยกทางอุตสาหกรรมเคมี"
                }
            },
            {
                "category": "วค 625 เทคโนโลยีอุตสาหกรรมปิโตรเคมี",
                "subcategories": {
                    "ขอบเขต": "อุตสาหกรรมเกี่ยวกับปิโตรเคมีในประเทศไทย",
                    "การจำแนก": "การจำแนกวัตถุดิบและผลิตภัณฑ์ตามแหล่งที่มา และกระบวนการสำหรับผลิต",
                    "วัตถุดิบพื้นฐาน": "มีเทน เอทิลีน โพรพีลีน C4-โอเลฟินส์ และอะโรเมติกส์"
                }
            },
            {
                "category": "วค 626 กระบวนการผลิตแก๊สธรรมชาติและการทำบริสุทธิ์น้ำมัน",
                "subcategories": {
                    "หลักการพื้นฐาน": "หลักการทางฟิสิกส์ เคมีและวิศวกรรมศาสตร์ที่จำเป็นสำหรับการออกแบบของโรงงานปรับสภาพแก๊สธรรมชาติและการกลั่นน้ำมัน",
                    "กระบวนการ": "การกำจัดกำมะถันรวมทั้งสารอื่นๆ กระบวนการกำจัดน้ำ กระบวนการแยกแก๊สธรรมชาติ และปิโตรเลียม"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 16,
        "details": [
            {
                "category": "หลักสูตร",
                "subcategories": {
                    "แผน_ก_แบบ_ก_1": {
                        "ภาคการศึกษาที่_1": {
                            "วค_803_วิทยานิพนธ์": "9 หน่วยกิต",
                            "รวม": "9 หน่วยกิต"
                        },
                        "ภาคการศึกษาที่_2": {
                            "วค_803_วิทยานิพนธ์": "9 หน่วยกิต",
                            "รวม": "9 หน่วยกิต"
                        }
                    },
                    "แผน_ก_แบบ_ก_2": {
                        "ภาคการศึกษาที่_1": {
                            "วค_804_วิทยานิพนธ์": "6 หน่วยกิต",
                            "รวม": "6 หน่วยกิต"
                        },
                        "ภาคการศึกษาที่_2": {
                            "วค_804_วิทยานิพนธ์": "9 หน่วยกิต",
                            "รวม": "9 หน่วยกิต"
                        }
                    }
                }
            },
            {
                "category": "คำอธิบายรายวิชา",
                "subcategories": {
                    "วค_500_สมดุลมวลสารและพลังงาน": {
                        "รหัสวิชา": "วค 500",
                        "ชื่อวิชา": "สมดุลมวลสารและพลังงาน",
                        "หน่วยกิต": "3(3-0-9)",
                        "คำอธิบายภาษาไทย": "คำนวณสมดุลมวลและพลังงาน ทั้งกระบวนการที่มีและไม่มีปฏิกิริยาเกิดขึ้น การนำคุณสมบัติทางเธอร์โมไดนามิกส์ต่างๆ ไปใช้ในการคำนวณ การหาข้อมูล ขั้นตอนการคำนวณสมดุลมวลสารและพลังงานอย่างเป็นระบบ ความรู้พื้นฐานเกี่ยวกับเธอร์โมเคมี",
                        "คำอธิบายภาษาอังกฤษ": "Elementary principles of material and energy balances for chemical processes, both with and without chemical reactions. Fundamentals of selected unit operations. Collection, determination, and calculations of data required for material and energy balances. Applications of fundamental thermodynamic principles on material and energy balance problems"
                    },
                    "วค_501_กลศาสตร์ของไหลสำหรับวิศวกรรมเคมี": {
                        "รหัสวิชา": "วค 501",
                        "ชื่อวิชา": "กลศาสตร์ของไหลสำหรับวิศวกรรมเคมี",
                        "หน่วยกิต": "3(3-0-9)",
                        "คำอธิบายภาษาไทย": "สมดุลมวล สมดุลโมเมนตัม และสมดุลพลังงาน ทั้งของระบบไฟไนต์และระบบอนุพันธ์ ลักษณะการไหลในท่อและตัวกลางที่มีรูพรุน สมการของเนเวียร์-สโตคส์ สมการของเบอร์นิวลีย์ การไหลของสารประเภทนอน-นิวโตเนียน การตกตะกอน และการกรอง",
                        "คำอธิบายภาษาอังกฤษ": "Fluid statics. Compressible and incompressible fluids. Mass, momentum, and energy balances for macroscopic and microscopic systems. Flow in pipes. Flow around submerged objects. Flow through"
                    },
                    "วค_502_การถ่ายเทความร้อน": {
                        "รหัสวิชา": "วค 502",
                        "ชื่อวิชา": "การถ่ายเทความร้อน",
                        "หน่วยกิต": "3(3-0-9)",
                        "คำอธิบายภาษาไทย": "ทฤษฎีและการประยุกต์ใช้ปรากฏการณ์ที่มีการถ่ายเทความร้อน กฎของฟูเรียร์ การนำความร้อนในสภาวะคงตัว การถ่ายเทความร้อนจากพื้นผิวต่อขยาย สัมประสิทธิ์การนำความร้อน เครื่องแลกเปลี่ยนความร้อน การกลั่นตัวและการเดือด การพารังสีความร้อนและการพาความร้อน"
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 70,
        "details": [
            {
                "category": "ผลงานทางวิชาการ",
                "subcategories": {
                    "ตำรา": [
                        {
                            "ชื่อผู้แต่ง": "ไพรัช อุศุภรัตน์",
                            "ปีที่พิมพ์": "2559",
                            "ชื่อหนังสือ": "การวิเคราะห์ปัจจัยการผลิตและผลผลิต สำหรับการจัดการของเสีย Waste Input-Output Analysis",
                            "สำนักพิมพ์": "สำนักพิมพ์มหาวิทยาลัยธรรมศาสตร์",
                            "เดือนที่พิมพ์": "สิงหาคม 2559"
                        },
                        {
                            "ชื่อผู้แต่ง": "หาญพล พึ่งรัศมี",
                            "ปีที่พิมพ์": "2559",
                            "ชื่อหนังสือ": "การประเมินวัฏจักรชีวิต หลักการและการประยุกต์",
                            "สำนักพิมพ์": "สำนักพิมพ์มหาวิทยาลัยธรรมศาสตร์"
                        }
                    ],
                    "บทความวิจัย": [
                        {
                            "ชื่อผู้แต่ง": "Usubharatana, P. & Phungrassami, H.",
                            "ปีที่พิมพ์": "2015",
                            "ชื่อบทความ": "Carbon footprint of cassava starch production in North-Eastern Thailand",
                            "ชื่อวารสาร": "Procedia CIRP",
                            "ฉบับที่": "29",
                            "หน้า": "462-467"
                        },
                        {
                            "ชื่อผู้แต่ง": "ไพรัช อุศุภรัตน์, เภคูน พูลสวัสดิ์, วริศ บุญหมื่นไวย์, และหาญพล พึ่งรัศมี",
                            "ปีที่พิมพ์": "2557",
                            "ชื่อบทความ": "การศึกษาความเป็นไปได้ของการผลิตแผ่นฟิล์มยางธรรมชาติโดยการฉายรังสีลำอิเล็กตรอน",
                            "ชื่อวารสาร": "วารสารวิทยาศาสตร์และเทคโนโลยี",
                            "ฉบับที่": "22(5)",
                            "หน้า": "755-766"
                        },
                        {
                            "ชื่อผู้แต่ง": "ไพรัช อุศุภรัตน์และหาญพล พึ่งรัศมี",
                            "ปีที่พิมพ์": "2557",
                            "ชื่อบทความ": "การประเมินคาร์บอนฟุตพริ้นท์องค์กรของมหาวิทยาลัยธรรมศาสตร์ ศูนย์รังสิต",
                            "ชื่อวารสาร": "วารสารวิทยาศาสตร์และเทคโนโลยี",
                            "ฉบับที่": "22(1)",
                            "หน้า": "1-12"
                        },
                        {
                            "ชื่อผู้แต่ง": "Phungrassami, H. & Usubharatana, P.",
                            "ปีที่พิมพ์": "2015",
                            "ชื่อบทความ": "Life cycle assessment and eco-efficiency of para-rubber wood production in Thailand",
                            "ชื่อวารสาร": "Polish Journal of Environmental Studies",
                            "ฉบับที่": "24(5)",
                            "หน้า": "2113-2126"
                        },
                        {
                            "ชื่อผู้แต่ง": "Usubharatana, P. & Phungrassami, H.",
                            "ปีที่พิมพ์": "2016",
                            "ชื่อบทความ": "Life cycle assessment of the straw mushroom production",
                            "ชื่อวารสาร": "Applied Ecology and Environmental Research",
                            "ฉบับที่": "14(1)",
                            "หน้า": "189-200"
                        },
                        {
                            "ชื่อผู้แต่ง": "Usubharatana, P. & Phungrassami, H.",
                            "ปีที่พิมพ์": "2016",
                            "ชื่อบทความ": "Ecological footprint analysis of canned sweet corn",
                            "ชื่อวารสาร": "Journal of Ecological Engineering",
                            "ฉบับที่": "17(3)",
                            "หน้า": "22-29"
                        },
                        {
                            "ชื่อผู้แต่ง": "Usubharatana, P. & Phungrassami, H.",
                            "ปีที่พิมพ์": "2016",
                            "ชื่อบทความ": "Greenhouse gas emission in the chicken feed industry using life cycle considerations: Thailand case study",
                            "ชื่อวารสาร": "Journal of Chemical Engineering of Japan",
                            "ฉบับที่": "49(10)",
                            "หน้า": "943-950"
                        },
                        {
                            "ชื่อผู้แต่ง": "Usubharatana, P. & Phungrassami, H.",
                            "ปีที่พิมพ์": "2017",
                            "ชื่อบทความ": "Greenhouse gas emissions of one-day-old chick production",
                            "ชื่อวารสาร": "Polish Journal of Environmental Studies",
                            "ฉบับที่": "26(3)",
                            "หน้า": "1-9"
                        },
                        {
                            "ชื่อผู้แต่ง": "Usubharatana, P. & Phungrassami, H.",
                            "ปีที่พิมพ์": "2017",
                            "ชื่อบทความ": "Evaluation of opportunities to reduce the carbon footprint of fresh and canned pineapple processing in Central Thailand",
                            "ชื่อวารสาร": "Polish Journal of Environmental Studies",
                            "ฉบับที่": "26(4)",
                            "หน้า": "1725-1735"
                        }
                    ]
                }
            },
            {
                "category": "ข้อมูลอาจารย์",
                "subcategories": {
                    "ผู้ช่วยศาสตราจารย์ ดร.หาญพล พึ่งรัศมี": {
                        "ตำแหน่ง": "ผู้ช่วยศาสตราจารย์",
                        "คุณวุฒิ": "ดร."
                    }
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 18,
        "details": [
            {
                "category": "Thermodynamics Fundamentals",
                "subcategories": {
                    "Thermodynamic_Properties": "Properties of real and ideal gases, fundamental thermodynamic equations and property relations",
                    "Residual_Properties": "Determination using equation of state or generalized correlation",
                    "Differential_Equations": "Thermodynamic property determination using differential equations",
                    "Solution_Thermodynamics": "Thermodynamics of solution and partial properties"
                }
            },
            {
                "category": "Non-Ideal Systems",
                "subcategories": {
                    "Fugacity": "Fugacity and fugacity coefficient",
                    "Solutions": "Ideal solution and non-ideal solution",
                    "Excess_Properties": "Excess properties and activity coefficient"
                }
            },
            {
                "category": "Equilibria",
                "subcategories": {
                    "Phase_Equilibria": "Equilibria between solid, liquid and vapor, focusing on vapor-liquid equilibrium",
                    "Chemical_Equilibria": "Chemical reaction equilibria",
                    "Stability": "Principles of equilibrium condition and stability of mixtures and phases"
                }
            },
            {
                "category": "Advanced Thermodynamics",
                "subcategories": {
                    "Molecular_Thermodynamics": "Microscopic thermodynamics and thermodynamic potentials of solution",
                    "Equation_of_State": "Theory and application of equation of state for chemical process design",
                    "Statistical_Thermodynamics": "Calculation of thermodynamic properties using molecular interactions",
                    "Computer_Simulations": "Computer simulations of liquid or gas systems, Monte Carlo simulations, 2D simulations like surface adsorption"
                }
            },
            {
                "category": "Specific Topics",
                "subcategories": {
                    "Potential_Functions": "Pair Potential function",
                    "Liquid_Theory": "Introduction to Equilibrium Liquid theory",
                    "Ensembles": "Various types of ensembles",
                    "Gas_Properties": "Properties of ideal and real gases, including monatomic and polyatomic"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 2,
        "details": [
            {
                "category": "ข้อมูลทั่วไป",
                "subcategories": {
                    "รหัสหลักสูตรและชื่อหลักสูตร": {
                        "รหัสหลักสูตร": "25450051100308",
                        "ชื่อหลักสูตรภาษาไทย": "หลักสูตรวิศวกรรมศาสตรมหาบัณฑิต สาขาวิชาวิศวกรรมเคมี",
                        "ชื่อหลักสูตรภาษาอังกฤษ": "Master of Engineering Program in Chemical Engineering"
                    },
                    "ชื่อปริญญาและสาขาวิชา": {
                        "ภาษาไทย": {
                            "ชื่อเต็ม": "วิศวกรรมศาสตรมหาบัณฑิต (วิศวกรรมเคมี)",
                            "ชื่อย่อ": "วศ.ม. (วิศวกรรมเคมี)"
                        },
                        "ภาษาอังกฤษ": {
                            "ชื่อเต็ม": "Master of Engineering (Chemical Engineering)",
                            "ชื่อย่อ": "M.Eng. (Chemical Engineering)"
                        }
                    },
                    "วิชาเอก": "ไม่มี",
                    "จำนวนหน่วยกิตที่เรียนตลอดหลักสูตร": {
                        "แผน ก แบบ ก1": "36 หน่วยกิต",
                        "แผน ก แบบ ก2": "38 หน่วยกิต"
                    },
                    "รูปแบบของหลักสูตร": {
                        "รูปแบบ": "หลักสูตรระดับปริญญาโท ศึกษา 2 ปี",
                        "ภาษาที่ใช้": "จัดการเรียนการสอนเป็นภาษาไทย และภาษาอังกฤษ",
                        "การรับเข้าศึกษา": "รับนักศึกษาไทย และนักศึกษาต่างชาติที่สามารถใช้ภาษาไทยได้เป็นอย่างดี",
                        "ความร่วมมือกับสถาบันอื่น": "เป็นหลักสูตรเฉพาะของสถาบันที่จัดการเรียนการสอนโดยตรง",
                        "การให้ปริญญาแก่ผู้สำเร็จการศึกษา": "ให้ปริญญาเพียงสาขาวิชาเดียว"
                    }
                }
            },
            {
                "category": "ข้อมูลสถาบัน",
                "subcategories": {
                    "ชื่อสถาบันอุดมศึกษา": "มหาวิทยาลัยธรรมศาสตร์",
                    "วิทยาเขต": "ศูนย์รังสิต",
                    "คณะ": "คณะวิศวกรรมศาสตร์",
                    "ภาควิชา": "ภาควิชาวิศวกรรมเคมี"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 81,
        "details": [
            {
                "category": "Materials Science Research",
                "subcategories": {
                    "Nanocomposites": "Studies on ZnO nanorods on nylon 6 and their photocatalytic activity",
                    "Modified Clay Composites": "Comprehensive review on modified clay-based composites for energy applications",
                    "Polymer Composites": "Development of isotactic polypropylene and stearic acid-modified calcium carbonate composite for microwavable packaging",
                    "Bio-based Materials": "Research on eggshell and bacterial cellulose composite membranes for active packaging",
                    "Electroactive Materials": "Study on strontium-modified bacterial cellulose and poly vinylidene fluoride composite"
                }
            },
            {
                "category": "Environmental Applications",
                "subcategories": {
                    "Photocatalysis": "Investigation of ZnO on nylon 6 surface for photocatalytic efficiency in methylene blue degradation for wastewater treatment",
                    "Adsorbent Technology": "Review on strategies for developing bio-based materials as effective renewable resources of energy through adsorbent technology",
                    "Biodegradable Packaging": "Research on fish water soluble protein composite film with montmorillonite as a prototype for biodegradable packaging materials"
                }
            },
            {
                "category": "Synthesis and Characterization",
                "subcategories": {
                    "Nanoparticle Synthesis": "Soft template-assisted synthesis of polyvinylpyrrolidone-functionalized nano-scale ZnO particles",
                    "Composite Development": "Study on ZnO and chitosan composite for packaging material applications"
                }
            },
            {
                "category": "Renewable Energy",
                "subcategories": {
                    "Energy Materials": "Review on modified clay-based composites for energy-based materials",
                    "Sustainable Energy": "Comprehensive review on adsorbent technology for renewable and sustainable energy applications"
                }
            }
        ]
    },
    {
        "link": "https://che.engr.tu.ac.th/syllabus/file-detail-master/File-Che20231021-43",
        "document": "file-che20231021-43_2",
        "page": 58,
        "details": [
            {
                "category": "การจัดการทรัพยากรการเรียนการสอน",
                "subcategories": {
                    "การจัดหาทรัพยากร": "อาจารย์พิเศษมีส่วนในการเสนอแนะรายชื่อหนังสือสำหรับให้หอสมุดกลางจัดซื้อ",
                    "ห้องสมุดคณะ": "มีห้องสมุดย่อยเพื่อบริการหนังสือ ตำรา หรือวารสารเฉพาะทาง",
                    "สื่อการสอน": "คณะจัดสื่อการสอนอื่นเพื่อใช้ประกอบการสอน เช่น เครื่องมัลติมีเดียโปรเจคเตอร์ คอมพิวเตอร์ เครื่องฉายสไลด์",
                    "การประเมินความเพียงพอของทรัพยากร": {
                        "เจ้าหน้าที่ห้องสมุด": "ประสานงานกับคณาจารย์ในการจัดซื้อหนังสือและประเมินความพอเพียง",
                        "เจ้าหน้าที่โสตทัศนอุปกรณ์": "อำนวยความสะดวกในการใช้สื่อและประเมินความพอเพียง"
                    },
                    "เป้าหมายงบประมาณ": "มีงบประมาณที่สนับสนุนการศึกษาที่เพียงพอ โดยใช้ข้อมูลการใช้งบประมาณที่ผ่านมาประกอบการจัดงบประมาณในปีถัดไป"
                }
            },
            {
                "category": "การบริหารบุคลากรสนับสนุนการเรียนการสอน",
                "subcategories": {
                    "คุณสมบัติเฉพาะสำหรับตำแหน่ง": "บุคลากรสายสนับสนุนควรมีวุฒิปริญญาตรีที่เกี่ยวข้องกับภาระงานที่รับผิดชอบ และมีความรู้ด้านวิศวกรรมเคมีหรือสาขาที่เกี่ยวข้อง",
                    "การเพิ่มทักษะความรู้": "บุคลากรต้องเข้าใจโครงสร้างและธรรมชาติของหลักสูตร และได้รับการฝึกอบรมเฉพาะทาง เช่น การเตรียมห้องปฏิบัติการคอมพิวเตอร์"
                }
            },
            {
                "category": "ความต้องการของตลาดแรงงานและความพึงพอใจของผู้ใช้บัณฑิต",
                "subcategories": {
                    "ความต้องการกำลังคน": "คาดว่ามีความต้องการสูงสำหรับสาขาวิศวกรรมเคมี",
                    "ความพึงพอใจของผู้ใช้บัณฑิต": "กำหนดระดับความพึงพอใจของผู้ใช้บัณฑิตโดยเฉลี่ยอยู่ในระดับดี-ดีมาก",
                    "การสำรวจและปรับปรุง": "คณะร่วมกับมหาวิทยาลัยจัดการสำรวจความต้องการแรงงานและความพึงพอใจของผู้ใช้บัณฑิตเพื่อนำข้อมูลมาปรับปรุงหลักสูตร",
                    "การวางแผนรับนักศึกษา": "ศึกษาข้อมูลวิจัยเกี่ยวกับความต้องการของตลาดแรงงานเพื่อวางแผนการรับนักศึกษา"
                }
            }
        ]
    }
]