[
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 41,
        "details": [
            {
                "category": "EL172 English Course 3",
                "subcategories": {
                    "Course_Code": "สษ.172",
                    "Course_Name_Thai": "ภาษาอังกฤษพื้นฐาน 3",
                    "Credits": "3 (3-0-6)",
                    "Prerequisite": "Have earned credits of EL171 or Language Institute placement",
                    "Description": "An upper-intermediate English course to enable students to use integrated skills at a more sophisticated level than the prior course especially in speaking and writing."
                }
            },
            {
                "category": "SC123 Fundamental Chemistry",
                "subcategories": {
                    "Course_Code": "วท.123",
                    "Course_Name_Thai": "เคมีพื้นฐาน",
                    "Credits": "3 (3-0-6)",
                    "Topics": [
                        "Atomic structure",
                        "Stoichiometry",
                        "Chemical bonds",
                        "Properties of Representative and Transition Elements",
                        "Gases",
                        "Liquids and Solutions",
                        "Solids",
                        "Thermodynamics",
                        "Chemical Kinetics",
                        "Chemical Equilibrium and Acid-Base Equilibrium",
                        "Electrochemistry",
                        "Organic Chemistry"
                    ]
                }
            },
            {
                "category": "SC173 Fundamental Chemistry Laboratory",
                "subcategories": {
                    "Course_Code": "วท.173",
                    "Course_Name_Thai": "ปฏิบัติการเคมีพื้นฐาน",
                    "Credits": "1 (0-3-0)",
                    "Prerequisite": "Have taken SC 123 or taking SC 123 in the same semester",
                    "Description": "Experiments related to the contents in SC 123"
                }
            },
            {
                "category": "EL202 English for work",
                "subcategories": {
                    "Course_Code": "สษ.202",
                    "Course_Name_Thai": "ภาษาอังกฤษสำหรับการทำงาน",
                    "Credits": "3 (3-0-6)",
                    "Prerequisite": "Have earned credits of EL172",
                    "Description": "Preparing and training students for careers; using business English reading, writing, speaking and listening in the work-related contexts"
                }
            },
            {
                "category": "AE106 Sustainability of Natural Resources and Energy",
                "subcategories": {
                    "Course_Code": "วค.106",
                    "Course_Name_Thai": "ความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน",
                    "Credits": "3 (3-0-6)",
                    "Course_Type": "บังคับเลือก 1 วิชา ไม่น้อยกว่า 2 หน่วยกิต",
                    "Topics": [
                        "Basics of ecology for environment and natural resource conservation",
                        "Characterisation of pollutions and their impacts on the society",
                        "Concepts about sustainability of natural resources and energy",
                        "Decision analysis",
                        "Environmental ethics",
                        "Sustainable design",
                        "Energy consumption in Thailand",
                        "Energy consumption in transportation, industries, and buildings",
                        "Sustainability of energy for Thailand",
                        "Electricity generation in Thailand",
                        "Energy conservation",
                        "Alternative energy",
                        "Solar energy",
                        "Biomass for energy",
                        "Ethanol production",
                        "Biodiesel production",
                        "Clean coal technology",
                        "Nuclear energy"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 19,
        "details": [
            {
                "category": "โปรแกรมสำหรับนักศึกษา",
                "subcategories": {
                    "รูปแบบที่เลือกเรียน": "รูปแบบที่1 วิชาฝึกงาน/โครงงานทางด้านวิศวกรรมคอมพิวเตอร์",
                    "เงื่อนไข": "ศึกษาวิชาเลือกเฉพาะรูปแบบที่คณะกำหนด ไม่น้อยกว่า 12 หน่วยกิต"
                }
            },
            {
                "category": "ปีการศึกษาที่4",
                "subcategories": {
                    "ภาคเรียนที่1": {
                        "สษ.202": {
                            "ชื่อวิชา": "ภาษาอังกฤษสำหรับการทำงาน",
                            "หน่วยกิต": 3
                        },
                        "มธ.120": {
                            "ชื่อวิชา": "สหวิทยาการสังคมศาสตร์",
                            "หน่วยกิต": 2
                        },
                        "วิชาบังคับเลือกศึกษาทั่วไปส่วนที่2": {
                            "หน่วยกิต": "ไม่น้อยกว่า 2"
                        },
                        "วิชาเลือกเฉพาะรูปแบบ": {
                            "หน่วยกิต": 3
                        },
                        "วิชาเลือกเสรี": [
                            {
                                "หน่วยกิต": 3
                            },
                            {
                                "หน่วยกิต": 3
                            }
                        ],
                        "วพ.404": {
                            "ชื่อวิชา": "โครงงานทางวิศวกรรมคอมพิวเตอร์ 1",
                            "หน่วยกิต": 1
                        },
                        "รวม": {
                            "หน่วยกิต": 17
                        }
                    },
                    "ภาคเรียนที่2": {
                        "วพ.405": {
                            "ชื่อวิชา": "โครงงานทางวิศวกรรมคอมพิวเตอร์ 2",
                            "หน่วยกิต": 2
                        },
                        "วิชาเลือกเฉพาะรูปแบบ": [
                            {
                                "หน่วยกิต": 3
                            },
                            {
                                "หน่วยกิต": 3
                            }
                        ],
                        "รวม": {
                            "หน่วยกิต": 8
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 29,
        "details": [
            {
                "category": "วพ.342 การพัฒนาโปรแกรมประยุกต์บนเว็บ",
                "subcategories": {
                    "รหัสวิชา": "CN342",
                    "ชื่อภาษาอังกฤษ": "Web Application Development",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ มธ.156",
                    "เนื้อหา": "หลักการพัฒนาโปรแกรมประยุกต์บนเว็บเบื้องต้น, ระบบของเครื่องแม่ข่ายเว็บ, พื้นฐานของภาษาเอชทีเอ็มแอลและแคสเคดดิงสไตล์ชีตส์, การพัฒนาโปรแกรมประยุกต์บนเว็บในฝั่งของเครื่องแม่ข่าย, การเข้าถึงและจัดการฐานข้อมูลผ่านทางเว็บ, การจัดการช่วงเวลาสื่อสาร, ความปลอดภัยของโปรแกรมประยุกต์บนเว็บ"
                }
            },
            {
                "category": "กลุ่มโครงสร้างพื้นฐานของระบบ",
                "subcategories": {
                    "วพ.200": {
                        "ชื่อวิชา": "คณิตศาสตร์แบบไม่ต่อเนื่อง",
                        "รหัสวิชา": "CN200",
                        "ชื่อภาษาอังกฤษ": "Discrete Mathematics",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "-",
                        "เนื้อหา": "ตรรกศาสตร์, เทคนิคต่าง ๆ ในการเขียนข้อพิสูจน์, ทฤษฏีเซต, ความสัมพันธ์ และฟังก์ชัน, อุปนัยเชิงคณิตศาสตร์, การนับ, การเรียงสับเปลี่ยนและการจัดหมู่พื้นฐาน, ทฤษฎีการเพิ่มเข้าและการตัดออก, ทฤษฎีความน่าจะเป็นพื้นฐาน, หัวข้อต่าง ๆ ในทฤษฎีกราฟ (สมสัณฐาน, กราฟเชิงระบบ, วงจร, แผนภาพต้นไม้, และกราฟระบุทิศทาง)"
                    },
                    "วพ.202": {
                        "ชื่อวิชา": "โครงสร้างข้อมูลและขั้นตอนวิธี 1",
                        "รหัสวิชา": "CN202",
                        "ชื่อภาษาอังกฤษ": "Data Structures and Algorithms I",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ วพ.201",
                        "เนื้อหา": "การวิเคราะห์ความซับซ้อนของขั้นตอนวิธี, ขั้นตอนวิธีพื้นฐานสำหรับการจัดเรียงข้อมูล, ชนิดข้อมูลแบบนามธรรม, ดิกชันนารี, ขั้นตอนวิธีสำหรับการค้นหาข้อมูล, กองซ้อน, แถวคอย, รายการ, การเขียนโปรแกรมแบบเรียกซ้ำ, ต้นไม้ค้นหาแบบทวิภาค"
                    },
                    "วพ.260": {
                        "ชื่อวิชา": "ทฤษฎีความน่าจะเป็นและกระบวนการสุ่มทางวิศวกรรมคอมพิวเตอร์",
                        "รหัสวิชา": "CN260",
                        "ชื่อภาษาอังกฤษ": "Probability Theory and Random Processes for Computer Engineering",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ ค.111",
                        "เนื้อหา": "ความน่าจะเป็น, ตัวแปรสุ่ม, สถิติ, กระบวนการสุ่ม, การนับ, ความเป็นอิสระต่อกัน, การมีเงื่อนไข, การคาดหวัง, ฟังก์ชันความหนาแน่น, การกระจาย, กฎจำนวนมาก, ทฤษฎีขีดจำกัดกลาง, อันตรภาคความไว้วางใจ, การทดสอบสมมติฐาน, การประมาณค่าเชิงสถิติ, กระบวนการคงที่, ลูกโซ่มาร์คอฟ, อัตลักษณ์ และ เอนโทรปี"
                    },
                    "วพ.301": {
                        "ชื่อวิชา": "โครงสร้างข้อมูลและขั้นตอนวิธี 2",
                        "รหัสวิชา": "CN301",
                        "ชื่อภาษาอังกฤษ": "Data Structures and Algorithms II",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ วพ.202",
                        "เนื้อหา": "ฮีพและแถวคอยลำดับความสำคัญ, การจัดเรียงข้อมูลโดยใช้โครงสร้างฮีพ, ขั้นตอนวิธีขั้นสูงที่ใช้ในการจัดเรียงข้อมูล, โครงสร้างต้นไม้แบบได้ดุลแบบต่าง ๆ และขั้นตอนวิธีที่เกี่ยวข้อง, ตารางแฮช, กราฟและขั้นตอนวิธีที่เกี่ยวข้อง"
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 44,
        "details": [
            {
                "category": "ค.112 เรขาคณิตวิเคราะห์และแคลคูลัสประยุกต์",
                "subcategories": {
                    "รหัสวิชา": "ค.112",
                    "ชื่อภาษาอังกฤษ": "MA112 Analytic Geometry and Applied Calculus",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "Have earned credits of MA111",
                    "เนื้อหา": "Analytic geometry for conic sections and second degree equations, vectors, transformation of coordinates, polar coordinates and graph drawing, functions of several variables, partial derivatives, multiple integrals, scalar fields and vector fields, derivative of vector valued functions, integration in the vector fields, Gauss's Theorem, Green's Theorem and Stokes' Theorem, Fourier and Laplace analysis and theirs applications."
                }
            },
            {
                "category": "ค.214 สมการเชิงอนุพันธ์",
                "subcategories": {
                    "รหัสวิชา": "ค.214",
                    "ชื่อภาษาอังกฤษ": "MA214 Differential Equations",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "Have earned credits of MA112 or MA113",
                    "เนื้อหา": "First order differential equations, second order differential equations, homogeneous linear differential equations, nonhomogeneous linear differential equations, differential equations of higher order, series solution of linear differential equations, special functions, partial differential equations, the Laplace transform and Fourier transform, introduction to nonlinear differential equations, applications engineering problem solving."
                }
            },
            {
                "category": "วิชาพื้นฐานทางวิศวกรรม",
                "subcategories": {
                    "วก.100 กราฟิกวิศวกรรม": {
                        "รหัสวิชา": "วก.100",
                        "ชื่อภาษาอังกฤษ": "ME100 Engineering Graphics",
                        "หน่วยกิต": "3 (2-3-4)",
                        "วิชาบังคับก่อน": "-",
                        "เนื้อหา": "The significance of drawing. Instruments and their uses. Lining and lettering. Work preparation. Applied geometry. Dimensioning and description. Orthographic drawing. Pictorial drawing. Freehand sketching. Sectioning. Computer aided drawing."
                    },
                    "วย.100 จริยธรรมสำหรับวิศวกร": {
                        "รหัสวิชา": "วย.100",
                        "ชื่อภาษาอังกฤษ": "CE100 Ethics for Engineers",
                        "หน่วยกิต": "0 (0-0-0)",
                        "วิชาบังคับก่อน": "-",
                        "เนื้อหา": "Ethical issues relevant to the engineering profession. Potential impact of technology transfers and implementation with respect to society and its members. Potential problems that may arise are studied along with possible ways to prevent them from occurring and ways to deal with them once they occur."
                    },
                    "วย.101 ความรู้เบื้องต้นทางวิชาชีพวิศวกรรมศาสตร์": {
                        "รหัสวิชา": "วย.101",
                        "ชื่อภาษาอังกฤษ": "CE101 Introduction to Engineering Profession",
                        "หน่วยกิต": "1(1-0-2)",
                        "เนื้อหา": "Engineering profession, Role and responsibility, Engineering fields, Curriculum and courses in engineering, Problem solving in engineering, Mathematical and scientific tools, Tests and experiments, Engineers and society and environment, Computers in engineering."
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 39,
        "details": [
            {
                "category": "วฟ.455 เทคโนโลยีฮาร์ดไดร์ฟ และการผลิต",
                "subcategories": {
                    "รหัสวิชา": "วฟ.455",
                    "ชื่อวิชาภาษาไทย": "เทคโนโลยีฮาร์ดไดร์ฟ และการผลิต",
                    "ชื่อวิชาภาษาอังกฤษ": "LE455 Hard Drive Technology and Manufacturing",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วฟ.241",
                    "เนื้อหารายวิชา": {
                        "บทนำเกี่ยวกับฮาร์ดไดร์ฟ": "รายละเอียด",
                        "โครงสร้างของฮาร์ดไดร์ฟ": "รายละเอียด",
                        "การเขียนและอ่านข้อมูล": "รายละเอียด",
                        "โครงสร้างของหัวอ่าน/เขียนและแผ่นเก็บข้อมูล": "รายละเอียด",
                        "การแปลงสนามแม่เหล็กเป็นข้อมูลทางไฟฟ้า": "รายละเอียด",
                        "สายการผลิตฮาร์ดไดร์ฟและวิธีทดสอบ": "รายละเอียด",
                        "Electrostatic discharge (ESD)": "รายละเอียด",
                        "ห้องสะอาด (cleanroom) และการควบคุม": "รายละเอียด",
                        "การติดต่อกับคอมพิวเตอร์ (Interface)": "รายละเอียด",
                        "การเยี่ยมชมโรงงานผลิต": "รายละเอียด"
                    }
                }
            },
            {
                "category": "วฟ.487 โครงข่ายประสาทและระบบฟัซซี่",
                "subcategories": {
                    "รหัสวิชา": "วฟ.487",
                    "ชื่อวิชาภาษาไทย": "โครงข่ายประสาทและระบบฟัซซี่",
                    "ชื่อวิชาภาษาอังกฤษ": "LE487 Neural Networks and Fuzzy Systems",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วฟ.200",
                    "เนื้อหารายวิชา": {
                        "ทฤษฎีและการประยุกต์ใช้ระบบโครงข่ายประสาทและระบบฟัซซี่": "รายละเอียด",
                        "ระบบฟัซซี่แบบปรับค่า": "รายละเอียด",
                        "โครงสร้างและพลศาสตร์ของหน่วยประสาท": "รายละเอียด",
                        "การเรียนรู้แบบมีการแนะนำและไม่มีการแนะนำ": "รายละเอียด"
                    }
                }
            },
            {
                "category": "วิชาศึกษาทั่วไป",
                "subcategories": {
                    "มธ.100 พลเมืองกับความรับผิดชอบต่อสังคม": {
                        "รหัสวิชา": "มธ.100",
                        "ชื่อวิชาภาษาไทย": "พลเมืองกับความรับผิดชอบต่อสังคม",
                        "ชื่อวิชาภาษาอังกฤษ": "TU100 Civic Education",
                        "หน่วยกิต": "3(3-0-6)",
                        "คำอธิบายรายวิชา": "Study of principles of democracy and government by rule of law. Students will gain understanding of the concept of 'citizenship' in a democratic rule and will have opportunity for self-development to become a citizen in a democratic society and to take responsibility in addressing issues in their society through real-life practices."
                    },
                    "มธ.110 สหวิทยาการมนุษยศาสตร์": {
                        "รหัสวิชา": "มธ.110",
                        "ชื่อวิชาภาษาไทย": "สหวิทยาการมนุษยศาสตร์",
                        "ชื่อวิชาภาษาอังกฤษ": "TU110 Integrated Humanities",
                        "หน่วยกิต": "2(2-0-4)",
                        "คำอธิบายรายวิชา": "To study the history of human beings in different periods, reflecting their beliefs, ideas, intellectual and creative development. To instill analytical thinking, with an awareness of the problems that humanities are confronting, such as the impacts of: technological development, violence, wars, and various world crises so that we can live well in a changing world."
                    },
                    "มธ.120 สหวิทยาการสังคมศาสตร์": {
                        "รหัสวิชา": "มธ.120",
                        "ชื่อวิชาภาษาไทย": "สหวิทยาการสังคมศาสตร์",
                        "ชื่อวิชาภาษาอังกฤษ": "TU120 Integrated Social Sciences",
                        "หน่วยกิต": "2(2-0-4)",
                        "คำอธิบายรายวิชา": "This interdisciplinary course focuses on the fact that social sciences play an important role for society. The course explains the origins of the social sciences and the modern world, the separation of social sciences from pure sciences, and the acceptance of the scientific paradigm for the explanation of social phenomenon. It also involves the analysis of important disciplines, concepts, and major theories of social sciences by pointing out strengths and weaknesses of each one. Included is the analysis of contemporary social problems, using knowledge and various perspectives—-individual, group, macro-social, national and world perspectives-- to view those problems."
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 45,
        "details": [
            {
                "category": "วอ.121 วัสดุวิศวกรรม 1",
                "subcategories": {
                    "รหัสวิชา": "วอ.121",
                    "ชื่อวิชาภาษาไทย": "วัสดุวิศวกรรม 1",
                    "ชื่อวิชาภาษาอังกฤษ": "Engineering Materials I",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "-",
                    "คำอธิบายรายวิชา": "Properties and structure of engineering materials such as metal, alloy, ceramics, plastics, rubber, wood and concrete. Phase diagram. Materials characteristics. Materials properties testing. Relation of microstructure and macrostructure with material properties. Manufacturing processes of materials. Effects of heat treatment on microstructure and properties of material."
                }
            },
            {
                "category": "วิชาเฉพาะด้าน",
                "subcategories": {
                    "กลุ่มเทคโนโลยีเพื่องานประยุกต์": {
                        "วพ.330 ระบบฐานข้อมูล": {
                            "รหัสวิชา": "วพ.330",
                            "ชื่อวิชาภาษาไทย": "ระบบฐานข้อมูล",
                            "ชื่อวิชาภาษาอังกฤษ": "Database Systems",
                            "หน่วยกิต": "3(3-0-6)",
                            "วิชาบังคับก่อน": "-",
                            "คำอธิบายรายวิชา": "Purposes of database systems. Levels of data abstraction. Entity-relationship model. Relational model. Database management languages. Relational database design. Normalization theory. File system structure. Query and transaction processing. Concurrency control. Database security. Distributed databases and design. Object-oriented databases."
                        },
                        "วพ.350 ปัญญาประดิษฐ์": {
                            "รหัสวิชา": "วพ.350",
                            "ชื่อวิชาภาษาไทย": "ปัญญาประดิษฐ์",
                            "ชื่อวิชาภาษาอังกฤษ": "Artificial Intelligence",
                            "หน่วยกิต": "3(3-0-6)",
                            "วิชาบังคับก่อน": "Have earned credits of CN260 or LE211",
                            "คำอธิบายรายวิชา": "Basic principles and related research in artificial intelligence. Topics includes simple representation schemes, problem solving paradigms, constraint propagation, game playing, machine learning, and search strategies. Areas of application such as knowledge representation, natural language processing, expert systems, computer vision and robotics will be explored."
                        },
                        "วฟ.210 สัญญาณและระบบ": {
                            "รหัสวิชา": "วฟ.210",
                            "ชื่อวิชาภาษาไทย": "สัญญาณและระบบ",
                            "ชื่อวิชาภาษาอังกฤษ": "Signals and Systems",
                            "หน่วยกิต": "3(3-0-6)",
                            "วิชาบังคับก่อน": "Have earned credits of MA111",
                            "คำอธิบายรายวิชา": "Continuous-time and discrete-time signal and system; linear time-invariant system (LTI); signal analysis using Fourier transform, Laplace transform, and Z-transform; applications of signal and system; modern techniques in signal and system analysis."
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 35,
        "details": [
            {
                "category": "วพ.325 ความมั่นคงในการสื่อสารเบื้องต้น",
                "subcategories": {
                    "รหัสวิชา": "CN325",
                    "ชื่อภาษาอังกฤษ": "Introduction to Cryptography",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.200 และ วพ.304 หรือผู้สอนอนุมัติ",
                    "เนื้อหา": "ความมั่นคงในการสื่อสารแนวใหม่เบื้องต้น ระบบการรักษาความมั่นคงในการสื่อสารเบื้องต้น ทั้งแบบกุญแจสมมาตรและอสมมาตร การคำนวณ การวิเคราะห์วิธีการต่าง ๆ และนิยามความปลอดภัยสำหรับการเข้ารหัสเพื่อรักษาความลับและความแท้จริงของข้อมูลในระบบความมั่นคงทั้งแบบที่มีพื้นฐานเป็นบล็อคไซเฟอร์ เช่น ดีอีเอสและเออีเอส และแบบที่มีพื้นฐานอยู่บนทฤษฎีจำนวน เช่น ฟังก์ชันลอการิทึมในระบบจำนวนเต็ม วิธีการหลักที่ใช้ในการวิเคราะห์จะเป็นแบบการเขียนข้อพิสูจน์เพื่อสรุปผลในเชิงปริมาณเพื่อให้นำไปใช้ประโยชน์ได้จริง"
                }
            },
            {
                "category": "วพ.326 โพรโทคอลและการวิเคราะห์โพรโทคอลด้านความมั่นคงในการสื่อสาร",
                "subcategories": {
                    "รหัสวิชา": "CN326",
                    "ชื่อภาษาอังกฤษ": "Cryptographic protocols and analyses",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.325 หรือผู้สอนอนุมัติ",
                    "เนื้อหา": "ระบบการรักษาความมั่นคงในการสื่อสารขั้นสูง การคำนวณ การวิเคราะห์วิธีการต่าง ๆ และนิยามความปลอดภัยสำหรับโพรโทคอลชนิดต่าง ๆ ทางด้านความมั่นคงในการสื่อสาร เช่น การยืนยันตัวตน โพรโทคอลเพื่อสร้างกุญแจร่วม เป็นต้น วิธีการหลักในการวิเคราะห์จะเป็นแบบการเขียนข้อพิสูจน์เพื่อสรุปผลในเชิงปริมาณเพื่อให้นำไปใช้ประโยชน์ได้จริง"
                }
            },
            {
                "category": "วพ.327 หัวข้อพิเศษทางความมั่นคงสารสนเทศ",
                "subcategories": {
                    "รหัสวิชา": "CN327",
                    "ชื่อภาษาอังกฤษ": "Special Topics in Information Security and Cryptography",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.325 ความมั่นคงในการสื่อสารเบื้องต้น",
                    "เนื้อหา": "หัวข้อหรือการพัฒนาใหม่ๆที่เป็นที่น่าสนใจในขณะนั้นในสาขาความมั่นคงสารสนเทศ"
                }
            },
            {
                "category": "วพ.343 การพัฒนาแอพพลิเคชันแบบเคลื่อนที่",
                "subcategories": {
                    "รหัสวิชา": "CN343",
                    "ชื่อภาษาอังกฤษ": "Mobile Application Development",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.201",
                    "เนื้อหา": "ภาพรวมของแพลตฟอร์มคอมพิวเตอร์เคลื่อนที่ สถาปัตยกรรมของอุปกรณ์เคลื่อนที่ เทคโนโลยีการสื่อสารไร้สายส่วนบุคคล แพลตฟอร์มพัฒนาโปรแกรมประยุกต์สำหรับอุปกรณ์เคลื่อนที่ การพัฒนาซอฟต์แวร์สำหรับอุปกรณ์เคลื่อนที่ แนวทางการออกแบบส่วนติดต่อผู้ใช้ แนวคิดในการพัฒนาโปรแกรมประยุกต์สำหรับอุปกรณ์เคลื่อนที่ได้แก่ การให้บริการตามพื้นที่"
                }
            },
            {
                "category": "วพ.344 การรักษาความปลอดภัยสำหรับโปรแกรมประยุกต์บนเว็บ",
                "subcategories": {
                    "รหัสวิชา": "CN344",
                    "ชื่อภาษาอังกฤษ": "Web Application Security",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.342",
                    "เนื้อหา": "สถานะด้านความมั่นคงของโปรแกรมประยุกต์บนเว็บในปัจจุบันกลไกหลักในการรักษาความมั่นคงสำหรับโปรแกรมประยุกต์บนเว็บ ตัวควบคุมที่ใช้กันทั่วไปทั้งทางฝั่งผู้ใช้และผู้ให้บริการช่องโหว่ที่พบมากในโปรแกรมประยุกต์เว็บ และแนวทางป้องกัน"
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 53,
        "details": [
            {
                "category": "วพ.326 โพรโทคอลและการวิเคราะห์โพรโทคอลด้านความมั่นคงในการสื่อสาร",
                "subcategories": {
                    "Course_Code": "CN326",
                    "Course_Name_English": "Cryptographic protocols and analyses",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of CN325 or approval by instructor",
                    "Description": "More advanced concepts in modern cryptography. Topics include constructions, analyses, and security definitions of more advanced cryptographic primitives and protocols such as entity authentication and key exchange protocols. The main approach used in analyzing cryptographic constructs will be the practice-oriented provable security approach."
                }
            },
            {
                "category": "วพ.327 หัวข้อพิเศษทางความมั่นคงสารสนเทศ",
                "subcategories": {
                    "Course_Code": "CN327",
                    "Course_Name_English": "Special Topics in Information Security and Cryptography",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Pass CN325",
                    "Description": "Topics of current interest and new developments in various fields in information security and cryptography."
                }
            },
            {
                "category": "วพ.343 การพัฒนาแอพพลิเคชันแบบเคลื่อนที่",
                "subcategories": {
                    "Course_Code": "CN343",
                    "Course_Name_English": "Mobile Application Development",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of CN201",
                    "Description": "Overview of mobile computing platform. Architecture of mobile computing devices. Wireless and personal communication technologies. Application development platform for mobile devices. Software development for mobile device. User interface design guidelines. Concepts in mobile application development including location-based services."
                }
            },
            {
                "category": "วพ.344 การรักษาความปลอดภัยสําหรับโปรแกรมประยุกต์บนเว็บ",
                "subcategories": {
                    "Course_Code": "CN344",
                    "Course_Name_English": "Web Application Security",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Pass CN342 Web application Development",
                    "Description": "Current state of security in web applications. Key security mechanisms for web applications. Client and server side controls. Common vulnerabilities of web-based applications and how to protect against the attacks."
                }
            },
            {
                "category": "วพ.353 การรู้จํารูปแบบ",
                "subcategories": {
                    "Course_Code": "CN353",
                    "Course_Name_English": "Pattern Recognition",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of CN260 or LE211",
                    "Description": "Basic problems and systematic views of pattern recognition systems. Statistical pattern recognition techniques. Syntactic pattern recognition techniques. Feature extraction of binary value images. Texture features. Extraction of 3D information."
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 59,
        "details": [
            {
                "category": "การทวนสอบมาตรฐานผลการเรียนรู้หลังจากนักศึกษาสำเร็จการศึกษา",
                "subcategories": {
                    "ภาวะการมีงานทำของบัณฑิต": "ประเมินจากบัณฑิตแต่ละรุ่นที่จบการศึกษา ในด้านของระยะเวลาในการหางานทำ ความเห็นต่อความรู้ ความสามารถ ความมั่นใจของบัณฑิตในการประกอบการงานอาชีพ",
                    "การตรวจสอบจากผู้ประกอบการ": "โดยการขอเข้าสัมภาษณ์ หรือ การส่งแบบสอบถาม เพื่อประเมินความพึงพอใจในบัณฑิตที่จบการศึกษาและเข้าทำงานในสถานประกอบการนั้น ๆ ในคาบระยะเวลาต่าง ๆ เช่น ปีที่ 1 ปีที่ 5 เป็นต้น",
                    "การประเมินตำแหน่งและความก้าวหน้า": "การประเมินตำแหน่ง และหรือความก้าวหน้าในสายงานของบัณฑิต",
                    "การประเมินจากบัณฑิต": "การประเมินจากบัณฑิตที่ไปประกอบอาชีพ ในแง่ของความพร้อมและความรู้จากสาขาวิชาที่เรียน รวมทั้งสาขาอื่น ๆ ที่กำหนดในหลักสูตร ที่เกี่ยวเนื่องกับการประกอบอาชีพของบัณฑิต รวมทั้งเปิดโอกาสให้เสนอข้อคิดเห็นในการปรับหลักสูตรให้ดียิ่งขึ้นด้วย",
                    "ความเห็นจากผู้ทรงคุณวุฒิภายนอก": "ความเห็นจากผู้ทรงคุณวุฒิภายนอก ที่มาประเมินหลักสูตร หรือ เป็นอาจารย์พิเศษ ต่อความพร้อมของนักศึกษาในการเรียน และสมบัติอื่น ๆ ที่เกี่ยวข้องกับกระบวนการเรียนรู้ และการพัฒนาองค์ความรู้ของนักศึกษา"
                }
            },
            {
                "category": "เกณฑ์การสำเร็จการศึกษาตามหลักสูตร",
                "subcategories": {
                    "จำนวนหน่วยกิต": "ได้ศึกษารายวิชาต่างๆ ครบตามโครงสร้างหลักสูตร และมีหน่วยกิตสะสมไม่ต่ำกว่า 145 หน่วยกิต",
                    "เกรดเฉลี่ยสะสม": "ได้ค่าระดับเฉลี่ยสะสมไม่ต่ำกว่า 2.00 (จากระบบ 4 ระดับคะแนน)",
                    "เงื่อนไขอื่นๆ": "ต้องปฏิบัติตามเงื่อนไขอื่นๆ ที่คณะวิศวกรรมศาสตร์ และมหาวิทยาลัยธรรมศาสตร์กำหนด"
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 38,
        "details": [
            {
                "category": "วิชาเฉพาะที่เปิดสอนโดยสาขาอื่น",
                "subcategories": {
                    "วฟ.320_ทฤษฎีการสื่อสาร": {
                        "รหัสวิชา": "LE320",
                        "ชื่อภาษาอังกฤษ": "Fundamentals of Communication Systems",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ วฟ.210",
                        "เนื้อหา": "สัญญาณและระบบ; สเปกตรัมของสัญญาณ; การประยุกต์ใช้อนุกรมฟูเรียร์และการแปลงฟูเรียร์; การมอดูเลตแบบแอนะล็อก, AM, DSB, SSB, FM, NBFM, PM; สัญญาณรบกวนในการสื่อสารแอนะล็อก; การมอดูเลตแบบไบนารีเบสแบนด์ ทฤษฎีการชักตัวอย่างของไนควิสและการแบ่งนับ; การมอดูเลตพัลส์แบบแอนะล็อก; การมอดูเลตแบบรหัสพัลส์ (PCM); การมอดูเลตแบบเดลต้า (DM); การส่งสัญญาณร่วมสื่อ, การส่งสัญญาณร่วมสื่อเชิงเวลา (TDM), การส่งสัญญาณร่วมสื่อเชิงความถี่ (FDM); สายนำสัญญาณ; การแพร่กระจายคลื่นวิทยุ; องค์ประกอบของการสื่อสารไมโครเวฟ; การสื่อสารดาวเทียม; การสื่อสารเชิงแสง"
                    },
                    "วฟ.340_วงจรอิเล็กทรอนิกส์": {
                        "รหัสวิชา": "LE 340",
                        "ชื่อภาษาอังกฤษ": "Electronic Circuits",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ วฟ.241",
                        "เนื้อหา": "ผลตอบสนองความถี่ของวงจรขยายไบโพลาร์และซีมอส วงจรขยายป้อนกลับและเสถียรภาพ วงจรสะท้อนกระแส วงจรขยายผลต่าง ภาคเอาต์พุตและวงจรขยายกำลัง วงจรขยายป้อนกลับและเสถียรภาพ การป้อนกลับแบบบวกและออสซิลเลเตอร์ แอนะล็อกฟิลเตอร์"
                    },
                    "วฟ.323_การสื่อสารดิจิตอล": {
                        "รหัสวิชา": "LE323",
                        "ชื่อภาษาอังกฤษ": "Digital Communications",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ วฟ.320",
                        "เนื้อหา": "ทฤษฎีการชักตัวอย่าง ความน่าจะเป็นและขบวนการสุ่ม รหัสข้อมูลดิจิตอลและการปรับรูปพัลส์ การตรวจจับสัญญาณ การมอดูเลชันแบบดิจิตอล การวิเคราะห์สมรรถนะ ทฤษฎีข่าวสาร รหัสข้อมูลจากแหล่งกำเนิด รหัสช่องสัญญาณ"
                    },
                    "วฟ.314_การประมวลผลสัญญาณดิจิตอล": {
                        "รหัสวิชา": "LE314",
                        "ชื่อภาษาอังกฤษ": "Digital Signal Processing",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ วฟ.210",
                        "เนื้อหา": "ทบทวนเกี่ยวกับสัญญาณและระบบแบบไม่ต่อเนื่องทางเวลา ทฤษฎีไนควิสต์ การแปลงฟูเรียร์แบบไม่ต่อเนื่องทางเวลา การแปลงแบบฟาสต์ฟูเรียร์ การแปลง z โครงสร้างระบบแบบไม่ต่อเนื่องทางเวลา เทคนิคการออกแบบวงจรกรองสัญญาณแบบดิจิตอล (วงจรกรองแบบ IIR และ FIR) แนะนำการแปลงเวฟเล็ทเบื้องต้น การประมวลสัญญาณแบบหลายความเร็ว"
                    },
                    "วฟ.415_การประมวลผลภาพ": {
                        "รหัสวิชา": "LE415",
                        "ชื่อภาษาอังกฤษ": "Digital Image Processing",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ วฟ.210",
                        "เนื้อหา": "ประวัติการพัฒนาการประมวลผลภาพ โครงสร้างข้อมูลของภาพทางดิจิตอล เทคนิคต่างๆ ก่อนการประมวลผล การทำให้ภาพมีคุณภาพดีขึ้น การจำลองรูปภาพ การจำลองภาพเคลื่อนไหวโดยใช้คอมพิวเตอร์ การเปลี่ยนตาข่ายคอนทัวร์ แผนที่และระบบพิกัด การประยุกต์ของการประมวลผลภาพ ความรู้เบื้องต้นเกี่ยวกับคอมพิวเตอร์วิชัน"
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 26,
        "details": [
            {
                "category": "ค.112 เรขาคณิตวิเคราะห์และแคลคูลัสประยุกต์",
                "subcategories": {
                    "รหัสวิชา": "ค.112",
                    "ชื่อภาษาไทย": "เรขาคณิตวิเคราะห์และแคลคูลัสประยุกต์",
                    "ชื่อภาษาอังกฤษ": "Analytic Geometry and Applied Calculus",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ ค.111",
                    "เนื้อหา": [
                        "เรขาคณิตวิเคราะห์ในเรื่องภาคตัดกรวยและสมการกำลังสอง",
                        "เวกเตอร์",
                        "การแปลงเชิงพิกัด",
                        "พิกัดเชิงขั้วและการร่างกราฟ",
                        "ฟังก์ชันหลายตัวแปร",
                        "อนุพันธ์ย่อย",
                        "ปริพันธ์ฟังก์ชันหลายตัวแปร",
                        "สนามสเกลาร์และสนามเวกเตอร์",
                        "อนุพันธ์ของเวกเตอร์",
                        "ปริพันธ์ในสนามของเวกเตอร์",
                        "ทฤษฎีบทของเกาส์ กรีน และสโตกส์",
                        "การวิเคราะห์ฟูเรียร์และลาปลาซและการประยุกต์"
                    ]
                }
            },
            {
                "category": "ค.214 สมการเชิงอนุพันธ์",
                "subcategories": {
                    "รหัสวิชา": "ค.214",
                    "ชื่อภาษาไทย": "สมการเชิงอนุพันธ์",
                    "ชื่อภาษาอังกฤษ": "Differential Equations",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ ค.112 หรือ ค.113",
                    "เนื้อหา": [
                        "สมการเชิงอนุพันธ์อันดับที่หนึ่ง",
                        "สมการเชิงอนุพันธ์อันดับที่สอง",
                        "สมการเชิงอนุพันธ์เชิงเส้นเอกพันธ์",
                        "สมการเชิงอนุพันธ์เชิงเส้นไม่เอกพันธ์",
                        "สมการเชิงอนุพันธ์อันดับสูง",
                        "สมการเชิงอนุพันธ์เชิงเส้นที่มีผลเฉลยเป็นอนุกรม",
                        "ฟังก์ชันพิเศษ",
                        "สมการเชิงอนุพันธ์ย่อย",
                        "การหาผลเฉลยโดยการแปลงลาปลาซและผลการแปลงฟูเรียร์",
                        "สมการเชิงอนุพันธ์ไม่เชิงเส้นเบื้องต้น",
                        "การนำไปใช้แก้ปัญหาทางวิศวกรรม"
                    ]
                }
            },
            {
                "category": "วิชาพื้นฐานทางวิศวกรรม",
                "subcategories": {
                    "วก.100 กราฟิกวิศวกรรม": {
                        "รหัสวิชา": "วก.100",
                        "ชื่อภาษาไทย": "กราฟิกวิศวกรรม",
                        "ชื่อภาษาอังกฤษ": "Engineering Graphics",
                        "หน่วยกิต": "3 (2-3-4)",
                        "วิชาบังคับก่อน": "-",
                        "เนื้อหา": [
                            "ความสำคัญของการเขียนแบบ",
                            "เครื่องมือและวิธีใช้",
                            "การเขียนเส้นและตัวอักษร",
                            "การเตรียมงานเขียนแบบ",
                            "เรขาคณิตประยุกต์",
                            "การระบุขนาดและรายละเอียด",
                            "การเขียนภาพออโธกราฟิก",
                            "ภาพพิคทอเรียล",
                            "การเขียนภาพด้วยมือเปล่า",
                            "การเขียนภาพตัด",
                            "การใช้คอมพิวเตอร์ช่วยในงานเขียนแบบ"
                        ]
                    },
                    "วย.100 จริยธรรมสำหรับวิศวกร": {
                        "รหัสวิชา": "วย.100",
                        "ชื่อภาษาไทย": "จริยธรรมสำหรับวิศวกร",
                        "ชื่อภาษาอังกฤษ": "Ethics for Engineers",
                        "หน่วยกิต": "0 (0-0-0)",
                        "วิชาบังคับก่อน": "-",
                        "เนื้อหา": [
                            "จรรยาบรรณวิศวกรรม",
                            "ผลกระทบของเทคโนโลยีต่อสังคม",
                            "ปัญหาและประเด็นทางด้านจริยธรรมและคุณธรรม",
                            "แนวทางแก้ไขและการป้องกัน",
                            "การเข้าร่วมโครงการอบรมจริยธรรม",
                            "วัดผลเป็นระดับ S หรือ U"
                        ],
                        "หมายเหตุ": "เข้าร่วมกิจกรรมกับที่ทางคณะวิศวกรรมศาสตร์จัดขึ้น"
                    },
                    "วย.101 ความรู้เบื้องต้นทางวิชาชีพวิศวกรรมศาสตร์": {
                        "รหัสวิชา": "วย.101",
                        "ชื่อภาษาไทย": "ความรู้เบื้องต้นทางวิชาชีพวิศวกรรมศาสตร์",
                        "ชื่อภาษาอังกฤษ": "Introduction to Engineering Profession",
                        "หน่วยกิต": "1 (1-0-2)",
                        "วิชาบังคับก่อน": "-",
                        "เนื้อหา": [
                            "วิชาชีพวิศวกรรม",
                            "บทบาทและหน้าที่ของวิศวกร",
                            "วิศวกรรมสาขาต่างๆ",
                            "หลักสูตรและการเรียนการสอนด้านวิศวกรรมศาสตร์",
                            "วิชาพื้นฐานทางวิทยาศาสตร์และวิศวกรรมศาสตร์",
                            "ความรับผิดชอบและจรรยาบรรณของวิศวกร",
                            "วิธีการสื่อสารสำหรับงานทางวิศวกรรม",
                            "เทคโนโลยีสารสนเทศสำหรับงานทางวิศวกรรม",
                            "การแก้ปัญหาทางวิศวกรรม",
                            "ความสำคัญของการทดสอบ"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 25,
        "details": [
            {
                "category": "วิชาเฉพาะ",
                "subcategories": {
                    "วิชาแกน": {
                        "วิชาพื้นฐานทางคณิตศาสตร์และวิทยาศาสตร์": [
                            {
                                "รหัสวิชา": "วท.133",
                                "ชื่อวิชา": "ฟิสิกส์สำหรับวิศวกร 1",
                                "หน่วยกิต": "3 (3-0-6)",
                                "วิชาบังคับก่อน": "-",
                                "คำอธิบายรายวิชา": "การเคลื่อนที่แรง ความโน้มถ่วง งานและพลังงาน การชน การเคลื่อนที่แบบหมุน วัตถุในสภาพสมดุล ความยืดหยุ่นและการแตกหัก ของไหล การแกว่งกวัด คลื่นเสียงและการประยุกต์ ความร้อนและทฤษฎีจลน์ของก๊าซ กฎข้อ 1 และ 2 ของอุณหพลศาสตร์"
                            },
                            {
                                "รหัสวิชา": "วท.134",
                                "ชื่อวิชา": "ฟิสิกส์สำหรับวิศวกร 2",
                                "หน่วยกิต": "3 (3-0-6)",
                                "วิชาบังคับก่อน": "เคยศึกษา วท.133",
                                "คำอธิบายรายวิชา": "ประจุไฟฟ้าและสนามไฟฟ้า กฎของเกาส์ ศักย์ไฟฟ้า ความจุไฟฟ้า ไดอิเล็กทริก กระแสไฟฟ้า วงจรไฟฟ้ากระแสตรงและอุปกรณ์ แม่เหล็กและแม่เหล็กไฟฟ้า การเหนี่ยวนำแม่เหล็กและกฎของฟาราเดย์ ตัวเหนี่ยวนำ วงจรไฟฟ้ากระแสสลับ ทฤษฎีคลื่นแม่เหล็กไฟฟ้าและการประยุกต์ แสง เลนส์และทัศนูปกรณ์ การสะท้อน การหักเหการเลี้ยวเบน การแทรกสอดและโพลาไรเซชัน ฟิสิกส์แผนใหม่"
                            },
                            {
                                "รหัสวิชา": "วท.183",
                                "ชื่อวิชา": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 1",
                                "หน่วยกิต": "1 (0-3-0)",
                                "วิชาบังคับก่อน": "-",
                                "คำอธิบายรายวิชา": "ปฏิบัติการเกี่ยวกับการวัดและความคลาดเคลื่อน แรงและการเคลื่อนที่ พลังงาน โมเมนตัม คลื่น และความร้อน"
                            },
                            {
                                "รหัสวิชา": "วท.184",
                                "ชื่อวิชา": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 2",
                                "หน่วยกิต": "1 (0-3-0)",
                                "วิชาบังคับก่อน": "-",
                                "คำอธิบายรายวิชา": "ปฏิบัติการเกี่ยวกับสนามแม่เหล็กไฟฟ้า วงจรและเครื่องมือวัดทางไฟฟ้า ทัศนศาสตร์ และฟิสิกส์แผนใหม่"
                            },
                            {
                                "รหัสวิชา": "ค.111",
                                "ชื่อวิชา": "แคลคูลัสพื้นฐาน",
                                "หน่วยกิต": "3 (3-0-6)",
                                "วิชาบังคับก่อน": "-",
                                "คำอธิบายรายวิชา": "ระบบจำนวนและฟังก์ชันเบื้องต้น แคลคูลัส อนุพันธ์และปริพันธ์ของฟังก์ชันที่มีตัวแปรเดียว ลิมิต ความต่อเนื่อง อนุพันธ์ และการประยุกต์อนุพันธ์ ปฏิยานุพันธ์ เทคนิคการหาปริพันธ์ การประยุกต์ปริพันธ์ อนุกรม ทฤษฎีบทของเทย์เลอร์และการประยุกต์",
                                "หมายเหตุ": "ไม่นับหน่วยกิตให้ผู้ที่กำลังศึกษาหรือสอบได้ ค.211 หรือ ค.216 หรือ ค.218"
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 42,
        "details": [
            {
                "category": "วย.106 เทคนิคในการสื่อสารและการน าเสนอ",
                "subcategories": {
                    "Course_Code": "CE106",
                    "Course_Name": "Communication and Presentation Technique",
                    "Credits": "2 (2-0-4)",
                    "Topics": [
                        "Proficient reading comprehension techniques",
                        "Report writing",
                        "Methods of compiling data",
                        "Units, Symbols and Mathematical equations",
                        "Terminology and transliterate",
                        "Presentation skills and techniques"
                    ]
                }
            },
            {
                "category": "น.209 หลักกฎหมายแพ่งและพาณิชย์",
                "subcategories": {
                    "Course_Code": "LA209",
                    "Course_Name": "Civil and Commercial Law",
                    "Credits": "3 (3-0-6)",
                    "Topics": [
                        "General principles in the Civil and Commercial Code",
                        "Persons",
                        "Property (types of property and proprietary rights)",
                        "Juristic acts (general principles, declaration of will, void and voidable acts)",
                        "Obligations and contracts"
                    ]
                }
            },
            {
                "category": "น.249 ความรู้เบื้องต้นเกี่ยวกับทรัพย์สินทางปัญญา",
                "subcategories": {
                    "Course_Code": "LA249",
                    "Course_Name": "Introduction to Intellectual Property",
                    "Credits": "3 (3-0-6)",
                    "Topics": [
                        "Fundamental knowledge of intellectual property protection",
                        "Justifications and needs for protection",
                        "Benefits of protection",
                        "Enforcement of rights",
                        "Examples from existing intellectual property law",
                        "Copyright law",
                        "Trademarks law"
                    ]
                }
            },
            {
                "category": "พบ.291 ธุรกิจเบื้องต้น",
                "subcategories": {
                    "Course_Code": "BA291",
                    "Course_Name": "Introduction of Business",
                    "Credits": "3 (3-0-6)",
                    "Topics": [
                        "Key operations of business",
                        "Finance",
                        "Accounting",
                        "Marketing",
                        "Human resource management",
                        "Production management",
                        "Management information system",
                        "Organizational forms of businesses",
                        "Business environment",
                        "Legal context",
                        "Managerial context",
                        "Real-world examples",
                        "Fundamental business plans"
                    ]
                }
            },
            {
                "category": "ทม.201 หลักการบริหาร",
                "subcategories": {
                    "Course_Code": "HR201",
                    "Course_Name": "Principles of Management",
                    "Credits": "3 (3-0-6)",
                    "Topics": [
                        "Management concepts",
                        "Evolution of management",
                        "Roles and skills of managers",
                        "Planning",
                        "Organizing",
                        "Leading",
                        "Controlling",
                        "Managerial decision making",
                        "Ethics"
                    ]
                }
            },
            {
                "category": "ศ.213 เศรษฐศาสตร์จุลภาคเบื้องต้น",
                "subcategories": {
                    "Course_Code": "EC213",
                    "Course_Name": "Introductory Microeconomics",
                    "Credits": "3 (3-0-6)",
                    "Topics": [
                        "Principles of economics",
                        "Allocation of scarce resources",
                        "Theory of value and price determination",
                        "Theory of consumption and production",
                        "Determination of supply"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 36,
        "details": [
            {
                "category": "วพ.353 การรู้จำรูปแบบ",
                "subcategories": {
                    "รหัสวิชา": "CN353 Pattern Recognition",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.260 หรือ วฟ.211",
                    "เนื้อหา": [
                        "ปัญหาพื้นฐานและแนวความคิดเกี่ยวกับระบบรู้จำรูปแบบ",
                        "เทคนิคการรู้จำโดยใช้หลักสถิติ",
                        "เทคนิคการรู้จำโดยใช้ไวยากรณ์",
                        "การดึงลักษณะเด่นจากภาพมีค่าเป็นเลขฐานสอง",
                        "คุณลักษณะของเทคส์เจอร์",
                        "การคำนวณหาข้อมูล 3 มิติ",
                        "หัวข้อการพัฒนาใหม่ ๆ เกี่ยวกับการรู้จำรูปแบบ"
                    ]
                }
            },
            {
                "category": "วพ.355 การประมวลผลภาษาธรรมชาติเชิงสถิติ",
                "subcategories": {
                    "รหัสวิชา": "CN355 Statistical Natural Language Processing",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.260 หรือ วฟ.211",
                    "คำอธิบาย": "เป็นสาขาย่อยของปัญญาประดิษฐ์และภาษาศาสตร์คอมพิวเตอร์",
                    "เนื้อหา": [
                        "การสร้างอย่างอัตโนมัติและการเข้าใจภาษามนุษย์ด้วยคอมพิวเตอร์",
                        "กลวิธีทางสถิติและการประมวลผลทางภาษา",
                        "แบบอย่างจากทฤษฎีสารสนเทศ",
                        "แบบจำลองภาษาโดยการคาดคะเน",
                        "ขั้นตอนวิธีอีเอ็ม",
                        "แบบจำลองมาร์คอฟซ่อนเร้น",
                        "เอนโทรปีสูงสุด",
                        "เทคนิคการจำแนกประเภทและการถดถอย"
                    ]
                }
            },
            {
                "category": "วพ.356 การประมวลผลสัญญาณเสียงพูด",
                "subcategories": {
                    "รหัสวิชา": "CN356 Speech Signal Processing",
                    "หน่วยกิต": "3(3-0-6)",
                    "เนื้อหา": [
                        "ทฤษฎีการประมวลผลสัญญาณดิจิทัล",
                        "การนำ MATLAB ไปใช้งานในการประมวลผลสัญญาณเสียงพูด",
                        "พื้นฐานการสร้างและการเข้าใจเสียงพูด",
                        "เทคนิคพื้นฐานต่างๆของการประมวลผลสัญญาณเสียงพูดดิจิทัล",
                        "วิธีการประมาณค่าต่างๆของเสียงพูด",
                        "การประยุกต์ใช้งานของการประมวลผลสัญญาณเสียงพูด"
                    ],
                    "เทคนิคพื้นฐาน": [
                        "พลังงานในช่วงเวลาสั้น",
                        "ขนาดสหสัมพันธ์ตัวเอง",
                        "การวิเคราะห์ฟูริเยร์ในช่วงเวลาสั้น",
                        "สเปกโตรแกรม",
                        "วิธีสาทิสสัณฐาน",
                        "การคาดคะเนเชิงเส้น"
                    ],
                    "วิธีการประมาณค่า": [
                        "การตรวจจับสัญญาณเสียงพูดและที่ไม่ใช่เสียงพูด",
                        "การแบ่งและจำแนกเสียงโฆษะ/อโฆษะ/เสียงที่ไม่ใช่เสียงพูด",
                        "การตรวจจับความถี่มูลฐาน",
                        "การตรวจจับความถี่สั่นพ้อง"
                    ],
                    "การประยุกต์ใช้งาน": [
                        "การเข้ารหัสเสียงพูด",
                        "การสังเคราะห์เสียงพูด",
                        "การปรับปรุงเสียงพูด",
                        "การรู้จำเสียงพูด/การประมวลผลภาษาธรรมชาติ"
                    ]
                }
            },
            {
                "category": "วพ.408 หัวข้อพิเศษทางวิศวกรรมคอมพิวเตอร์ 1",
                "subcategories": {
                    "รหัสวิชา": "CN408 Special Topics in Computer Engineering I",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "นักศึกษาชั้นปีที่ 4 หรือได้รับอนุมัติจากอาจารย์ผู้สอน",
                    "คำอธิบาย": "หัวข้อหรือการพัฒนาใหม่ ๆ ที่เป็นที่น่าสนใจในขณะนั้นในสาขาทางวิศวกรรมคอมพิวเตอร์"
                }
            },
            {
                "category": "วพ.409 หัวข้อพิเศษทางวิศวกรรมคอมพิวเตอร์ 2",
                "subcategories": {
                    "รหัสวิชา": "CN409 Special Topics in Computer Engineering II",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "นักศึกษาชั้นปีที่ 4 หรือได้รับอนุมัติจากอาจารย์ผู้สอน",
                    "คำอธิบาย": "หัวข้อหรือการพัฒนาใหม่ ๆ ที่เป็นที่น่าสนใจในขณะนั้นในสาขาทางวิศวกรรมคอมพิวเตอร์"
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 56,
        "details": [
            {
                "category": "วฟ.340 วงจรอิเล็กทรอนิกส์",
                "subcategories": {
                    "Course_Code": "LE340",
                    "Course_Name_English": "Electronic Circuits",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of LE241",
                    "Course_Description": "Frequency response of bipolar and CMOS amplifiers; current mirrors, differential amplifiers, output stages and power amplifiers; feedback amplifiers and stability; positive feedback and oscillators; analog filters."
                }
            },
            {
                "category": "วฟ.323 การสื่อสารดิจิตอล",
                "subcategories": {
                    "Course_Code": "LE323",
                    "Course_Name_English": "Digital Communications",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of LE320",
                    "Course_Description": "Review of sampling theorem; probability and random processes; line coding and pulse shaping; signal detection; digital modulation techniques; performance analysis; introduction to information theory; source coding; channel coding."
                }
            },
            {
                "category": "วฟ.314 การประมวลผลสัญญาณดิจิตอล",
                "subcategories": {
                    "Course_Code": "LE314",
                    "Course_Name_English": "Digital Signal Processing",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of LE210",
                    "Course_Description": "Review of discrete-time signals and systems, the Nyquist theorem, the discrete Fourier transform (DFT), fast Fourier transform (FFT) and z-transform; structures of discrete-time systems; digital filter design techniques (IIR and FIR filter); introduction to wavelet transform; multirate signal processing."
                }
            },
            {
                "category": "วฟ.415 การประมวลผลภาพ",
                "subcategories": {
                    "Course_Code": "LE415",
                    "Course_Name_English": "Digital Image Processing",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of LE210",
                    "Course_Description": "Historical development of image processing. Image data structures. Image preprocessing. Image enhancement. Image classification. Image postprocessing. Image compression and restoration. Figure modeling. Computer animation. Contour mesh conversion. Applications of image processing. Introduction to computer vision."
                }
            },
            {
                "category": "วฟ.455 เทคโนโลยีฮาร์ดไดร์ฟ และการผลิต",
                "subcategories": {
                    "Course_Code": "LE455",
                    "Course_Name_English": "Hard Drive Technology and Manufacturing",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of LE241",
                    "Course_Description": "Hard drive introduction. Hard disk drive's construction. Writing and reading data. Magnetic recording head & disc. Recording channels & head positioning system. Drive manufacturing and testing. Electrostatic discharge (ESD). Cleanroom and contamination control. Interface. Hard drive Manufacturing visit."
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 51,
        "details": [
            {
                "category": "Computer Engineering Project II",
                "subcategories": {
                    "Course_Code": "CN405",
                    "Thai_Course_Code": "วพ.405",
                    "Credits": "2(0-6-0)",
                    "Prerequisite": "Have earned credits of CN404",
                    "Description": "A continuation of Computer Engineering Project I to the final stage. Students are required to submit a complete summary report and give a final presentation."
                }
            },
            {
                "category": "Preparation for Co-Operative Education in Computer Engineering",
                "subcategories": {
                    "Course_Code": "CN406",
                    "Thai_Course_Code": "วพ.406",
                    "Credits": "1(0-3-0)",
                    "Prerequisites": [
                        "Senior standing",
                        "Have passed CN 201",
                        "Have earned at least 22 credits of CN courses",
                        "Have passed the English training program arranged by the Faculty or have obtained the score of at least 300 in the TU-GET exam"
                    ],
                    "Description": "Working in companies or industries related to computer engineering for at least 80 hours under supervision of industrial supervisors and the faculty staffs. Students are required to submit a report and give an oral presentation."
                }
            },
            {
                "category": "Co-operative Education in Computer Engineering",
                "subcategories": {
                    "Course_Code": "CN407",
                    "Thai_Course_Code": "วพ.407",
                    "Credits": "8(0-40-0)",
                    "Prerequisite": "Have earned credits of CN406",
                    "Description": "A continuation of preparation for Co-Operative Education in Computer Engineering by working in companies or industries related to computer engineering for at least 560 hours under supervision of industrial supervisors and the faculty staffs. Students are required to submit a complete summary report and give an oral presentation."
                }
            },
            {
                "category": "Theory of Computation",
                "subcategories": {
                    "Course_Code": "CN304",
                    "Thai_Course_Code": "วพ.304",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of CN200",
                    "Description": "Computability and models of computation. Regular languages. Regular grammars. Regular expressions. Finite automata. Nondeterminism. Context-free languages. Context-free grammars. Turing machines. Computability. The Church-Turing thesis. Other models of computation."
                }
            },
            {
                "category": "VHDL Programming",
                "subcategories": {
                    "Course_Code": "CN313",
                    "Thai_Course_Code": "วพ.313",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of CN210 or LE242",
                    "Description": "Using the VHSIC (Very High Speed Integrated Circuit) Hardware Description Language (VHDL) for modeling and top level design of digital systems. Structural and behavioral models, concurrent and sequential language elements, resolved signals, generics, configurations, test benches, guarded signals, and case studies will be studied. With the use of the industry standard compiler, simulation and synthesis tools, designs will be constructed and synthesized, ultimately being configured on CPLD and FPGA chip."
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 4,
        "details": [
            {
                "category": "ภาษาอังกฤษ",
                "subcategories": {
                    "สษ.070": "ภาษาอังกฤษพื้นฐาน 1 (0 หน่วยกิต)",
                    "EL070": "English Course 1",
                    "สษ.171": "ภาษาอังกฤษพื้นฐาน 2 (3 หน่วยกิต)",
                    "EL171": "English Course 2",
                    "สษ.172": "ภาษาอังกฤษพื้นฐาน 3 (3 หน่วยกิต)",
                    "EL172": "English Course 3",
                    "สษ.202": "ภาษาอังกฤษสำหรับการทำงาน (3 หน่วยกิต)",
                    "EL202": "English for Work"
                }
            },
            {
                "category": "วิทยาศาสตร์",
                "subcategories": {
                    "วท.123": "เคมีพื้นฐาน (3 หน่วยกิต)",
                    "SC123": "Fundamental Chemistry",
                    "วท.173": "ปฏิบัติการเคมีพื้นฐาน (1 หน่วยกิต)",
                    "SC173": "Fundamental Chemistry Laboratory",
                    "วท.133": "ฟิสิกส์สำหรับวิศวกร 1 (3 หน่วยกิต)",
                    "SC133": "Physics for Engineers 1",
                    "วท.134": "ฟิสิกส์สำหรับวิศวกร 2 (3 หน่วยกิต)",
                    "SC134": "Physics for Engineers 2",
                    "วท.183": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 1 (1 หน่วยกิต)",
                    "SC183": "Physics for Engineers Laboratory 1",
                    "วท.184": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 2 (1 หน่วยกิต)",
                    "SC184": "Physics for Engineers Laboratory 2"
                }
            },
            {
                "category": "กฎหมาย",
                "subcategories": {
                    "น.209": "หลักกฎหมายแพ่งและพาณิชย์ (3 หน่วยกิต)",
                    "LA209": "Civil and Commercial Law",
                    "น.249": "ความรู้เบื้องต้นเกี่ยวกับทรัพย์สินทางปัญญา (3 หน่วยกิต)",
                    "LA249": "Introduction to Intellectual Property"
                }
            },
            {
                "category": "บริหารธุรกิจ",
                "subcategories": {
                    "พบ.291": "ธุรกิจเบื้องต้น (3 หน่วยกิต)",
                    "BA291": "Introduction of Business",
                    "ทม.201": "หลักการบริหาร (3 หน่วยกิต)",
                    "HR201": "Principles of Management"
                }
            },
            {
                "category": "เศรษฐศาสตร์",
                "subcategories": {
                    "ศ.213": "เศรษฐศาสตร์จุลภาคเบื้องต้น (3 หน่วยกิต)",
                    "EC213": "Introductory Microeconomics"
                }
            },
            {
                "category": "คณิตศาสตร์",
                "subcategories": {
                    "ค.111": "แคลคูลัสพื้นฐาน (3 หน่วยกิต)",
                    "MA111": "Fundamentals of Calculus",
                    "ค.112": "เรขาคณิตวิเคราะห์และแคลคูลัสประยุกต์ (3 หน่วยกิต)",
                    "MA112": "Analytic Geometry and Applied Calculus",
                    "ค.214": "สมการเชิงอนุพันธ์ (3 หน่วยกิต)",
                    "MA214": "Differential Equations"
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 15,
        "details": [
            {
                "category": "วิชาเลือกเสรี",
                "subcategories": {
                    "จำนวนหน่วยกิต": "6 หน่วยกิต",
                    "เงื่อนไขการเลือก": "นักศึกษาสามารถเลือกศึกษาวิชาใดก็ได้ โดยเป็นวิชาระดับ 200 ขึ้นไป ที่เปิดสอนในมหาวิทยาลัยธรรมศาสตร์",
                    "ข้อกำหนดเพิ่มเติม": "ให้หมายรวมถึงวิชาศึกษาทั่วไป หมวดภาษาต่างประเทศด้วย"
                }
            },
            {
                "category": "วิชาที่ไม่สามารถนับเป็นวิชาเลือกเสรี",
                "subcategories": {
                    "วิชาพื้นฐาน": "วิชาพื้นฐานทางวิทยาศาสตร์และคณิตศาสตร์ทุกวิชา (รวมทั้งวิชาที่ไม่ได้กำหนดไว้ในวิชาศึกษาทั่วไปส่วนที่ 2)",
                    "วิชาศึกษาทั่วไป": "วิชาในหลักสูตรวิชาศึกษาทั่วไปทั้งส่วนที่ 1 และส่วนที่ 2 ที่ใช้รหัสย่อ 'มธ.' ทุกวิชา",
                    "วิชาเฉพาะ": "วิชา ท.162 การเขียนรายงานทางวิชาการ และ ท.163 การเขียนเพื่อการสื่อสารในองค์กร"
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 7,
        "details": [
            {
                "category": "ระบบการศึกษา",
                "subcategories": {
                    "แบบชั้นเรียน": "",
                    "แบบทางไกลผ่านสื่อสิ่งพิมพ์เป็นหลัก": "",
                    "แบบทางไกลผ่านสื่อแพร่ภาพและเสียงเป็นสื่อหลัก": "",
                    "แบบทางไกลทางอิเล็กทรอนิกส์เป็นสื่อหลัก": "(E-learning)",
                    "แบบทางไกลทางอินเตอร์เน็ต": "",
                    "อื่นๆ": "(ระบุ)"
                }
            },
            {
                "category": "การเทียบโอนหน่วยกิต รายวิชาและการลงทะเบียนเรียนข้ามมหาวิทยาลัย",
                "subcategories": {
                    "ข้อบังคับมหาวิทยาลัยธรรมศาสตร์": "ว่าด้วยการศึกษาชั้นปริญญาตรี พ.ศ. 2540 (แก้ไขเพิ่มเติมถึงปัจจุบัน ฉบับที่ 3 พ.ศ.2555) ข้อ 10.10 และข้อ 15",
                    "หลักเกณฑ์การลงทะเบียนเรียนข้ามมหาวิทยาลัย": "ให้เป็นไปตามประกาศมหาวิทยาลัยธรรมศาสตร์ เรื่อง หลักเกณฑ์และเงื่อนไขการจดทะเบียนศึกษารายวิชาข้ามโครงการและการจดทะเบียนศึกษารายวิชาข้ามสถาบันอุดมศึกษาในหลักสูตรระดับปริญญาตรี พ.ศ. 2552"
                }
            },
            {
                "category": "หลักสูตร",
                "subcategories": {
                    "จำนวนหน่วยกิตรวม": "ไม่น้อยกว่า 145 หน่วยกิต",
                    "ระยะเวลาศึกษา": "เป็นหลักสูตรแบบเต็มเวลา นักศึกษาต้องใช้ระยะเวลาการศึกษาตลอดหลักสูตรอย่างน้อย 7 ภาคการศึกษาปกติ และอย่างมากไม่เกิน 14 ภาคการศึกษาปกติ",
                    "โครงสร้างหลักสูตร": {
                        "วิชาศึกษาทั่วไป": "30 หน่วยกิต",
                        "วิชาเฉพาะ": {
                            "รวม": "109 หน่วยกิต",
                            "วิชาแกน": {
                                "รวม": "24 หน่วยกิต",
                                "วิชาพื้นฐานทางคณิตศาสตร์และวิทยาศาสตร์": "17 หน่วยกิต",
                                "วิชาพื้นฐานทางวิศวกรรม": "7 หน่วยกิต"
                            },
                            "วิชาเฉพาะด้าน": {
                                "รวม": "64 หน่วยกิต",
                                "กลุ่มเทคโนโลยีเพื่องานประยุกต์": "9 หน่วยกิต",
                                "กลุ่มเทคโนโลยีและวิธีการทางซอฟต์แวร์": "15 หน่วยกิต",
                                "กลุ่มโครงสร้างพื้นฐานระบบ": "21 หน่วยกิต",
                                "กลุ่มฮาร์ดแวร์และสถาปัตยกรรมคอมพิวเตอร์": "19 หน่วยกิต"
                            },
                            "วิชาเลือก": {
                                "รวม": "21 หน่วยกิต",
                                "วิชาเลือกด้านการออกแบบและพัฒนา": "6 หน่วยกิต",
                                "วิชาเลือกเฉพาะรูปแบบ": "15 หน่วยกิต"
                            }
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 31,
        "details": [
            {
                "category": "วพ.212 สถาปัตยกรรมคอมพิวเตอร์",
                "subcategories": {
                    "รหัสวิชา": "CN212",
                    "ชื่อภาษาอังกฤษ": "Fundamentals of Computer Architecture",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "-",
                    "เนื้อหา": [
                        "ตรรกะในระบบดิจิตอลเบื้องต้น",
                        "การออกแบบและการสร้างเอแอลยู",
                        "เลขฐานสอง",
                        "การเก็บจำนวนลบในคอมพิวเตอร์",
                        "จำนวนที่มีจุดลอยตัว",
                        "ชุดคำสั่งพื้นฐานสำหรับคอมพิวเตอร์ลดทอนคำสั่ง (ริสก์)",
                        "การโปรแกรมภาษาแอสเซมบลี",
                        "การสร้างเครื่องคอมพิวเตอร์ขั้นพื้นฐานภายใต้เงื่อนไขของสัญญาณนาฬิกาแบบต่างๆ",
                        "โปรเซสเซอร์แบบไปป์ไลน์",
                        "ลำดับชั้นของหน่วยความจำ",
                        "หน่วยความจำแคช",
                        "หน่วยความจำเสมือน",
                        "สถาปัตยกรรมอินพุตเอาต์พุต"
                    ]
                }
            },
            {
                "category": "วพ.310 การออกแบบระบบไมโครโปรเซสเซอร์",
                "subcategories": {
                    "รหัสวิชา": "CN310",
                    "ชื่อภาษาอังกฤษ": "Microprocessor Systems Design",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.210 หรือ วฟ.242",
                    "เนื้อหา": [
                        "ไมโครโปรเซสเซอร์เบื้องต้น",
                        "สถาปัตยกรรมของซีพียู",
                        "ระบบบัส",
                        "การเชื่อมต่อหน่วยความจำ",
                        "ชุดคำสั่ง",
                        "ภาษาแอสเซมบลี้",
                        "อินเตอร์เฟสอินพุทและเอาท์พุท",
                        "พอร์ทขนาน",
                        "พอร์ทอนุกรม",
                        "การเชื่อมต่อกับสัญญาณแอนะล็อก",
                        "ภาษาซีสำหรับไมโครโปรเซสเซอร์",
                        "เทคนิคการโปรแกรม",
                        "การจัดการอินเตอร์รัพต์",
                        "การประยุกต์ใช้งานไมโครโปรเซสเซอร์และไมโครคอนโทรลเลอร์"
                    ]
                }
            },
            {
                "category": "วฟ.201 ปฏิบัติการพื้นฐานทางวิศวกรรมไฟฟ้า 1",
                "subcategories": {
                    "รหัสวิชา": "LE201",
                    "ชื่อภาษาอังกฤษ": "Basic Electrical Engineering Laboratory I",
                    "หน่วยกิต": "1(0-3-0)",
                    "วิชาบังคับก่อน": "สอบได้หรือศึกษาพร้อมกับ วฟ.240",
                    "เนื้อหา": [
                        "รายวิชาปฏิบัติการเพื่อเป็นพื้นฐานให้แก่นักศึกษา",
                        "การใช้เครื่องมือวัดและอุปกรณ์ต่างๆ ในงานวิศวกรรมไฟฟ้า"
                    ]
                }
            },
            {
                "category": "วฟ.240 การวิเคราะห์วงจรไฟฟ้า",
                "subcategories": {
                    "รหัสวิชา": "LE240",
                    "ชื่อภาษาอังกฤษ": "Electric Circuit Analysis",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "-",
                    "เนื้อหา": [
                        "นิยาม และกฎของอุปกรณ์ในการวิเคราะห์วงจรไฟฟ้า",
                        "การวิเคราะห์แบบโหนดและเมช",
                        "ทฤษฎีของเทเวนินและนอร์ตัน",
                        "ตัวเก็บประจุ, ตัวเหนี่ยวนำ",
                        "วงจรอันดับหนึ่งและอันดับสอง",
                        "ผลตอบของสัญญาณกระตุ้นแบบไซน์",
                        "การแสดงด้วยเฟสเซอร์",
                        "การวิเคราะห์ไฟสามเฟส",
                        "โครงข่ายสองขั้ว",
                        "ทฤษฎีโครงข่าย"
                    ]
                }
            },
            {
                "category": "วฟ.241 อุปกรณ์และวงจรอิเล็กทรอนิกส์พื้นฐาน",
                "subcategories": {
                    "รหัสวิชา": "LE241",
                    "ชื่อภาษาอังกฤษ": "Basic Electronic Circuits and Devices",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วฟ.240",
                    "เนื้อหา": [
                        "โครงสร้าง คุณลักษณะ และโหมดของการทำงานของไดโอด",
                        "วงจรประยุกต์ของไดโอด",
                        "วงจรแหล่งจ่ายไฟกระแสตรง",
                        "โครงสร้าง คุณลักษณะ และโหมดของการทำงานของทรานซิสเตอร์แบบ BJT และ FET",
                        "ทรานซิสเตอร์ในวงจรขยายสัญญาณ และสวิตช์",
                        "การไบแอสทรานซิสเตอร์",
                        "หลักการวิเคราะห์วงจรสัญญาณขนาดเล็ก",
                        "แบบจำลองอุปกรณ์แบบ 2 และ 3 ขา",
                        "ออปแอมป์และวงจรประยุกต์",
                        "อุปกรณ์อิเล็กทรอนิกส์กำลังเบื้องต้น"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 34,
        "details": [
            {
                "category": "วพ.313 การโปรแกรมภาษาวีเอชดีแอล",
                "subcategories": {
                    "รหัสวิชา": "CN313",
                    "ชื่อวิชาภาษาอังกฤษ": "VHDL Programming",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.210 หรือ วฟ.242",
                    "เนื้อหา": "การใช้ภาษาวีเอชดีแอลออกแบบระบบดิจิตอลด้วยเทคนิคการออกแบบเป็นระบบในระดับสูง โดยการอธิบายเป็นแบบโครงสร้างและแบบอธิบายพฤติกรรมทางฮาร์ดแวร์ รวมถึงการทดสอบระบบ และการศึกษาด้วยการทำโครงงานขนาดเล็ก การใช้เครื่องมือสำหรับการออกแบบ การสังเคราะห์ และการทำเป็นของจริงด้วยอุปกรณ์ประเภท ซีพีแอลดีและเอฟพีจีเอ"
                }
            },
            {
                "category": "วพ.315 ผู้ดูแลระบบคอมพิวเตอร์ขั้นสูง",
                "subcategories": {
                    "รหัสวิชา": "CN315",
                    "ชื่อวิชาภาษาอังกฤษ": "Advanced System Administration",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "-",
                    "เนื้อหา": "ครอบคลุมการจัดสร้าง และบริหารจัดการระบบคอมพิวเตอร์เครือข่าย ระบบเนมเซิร์ฟเวอร์ ระบบเว็บเซิร์ฟเวอร์ เอคทีฟไดเร็กทรอรี่ ระบบ SMTP ระบบไฟล์ซิสเต็มแบบเครือข่าย การบริหารเครือข่ายขั้นสูง การจัดการระบบไฟล์วอร์ ความเข้าใจการทำงานของโปรเซส การจัดการเพ็คเกจโปรแกรม และการแก้ปัญหาระบบ"
                }
            },
            {
                "category": "วพ.316 การประมวลผลแบบกลุ่มเมฆ และการจัดการข้อมูลขนาดใหญ่",
                "subcategories": {
                    "รหัสวิชา": "CN316",
                    "ชื่อวิชาภาษาอังกฤษ": "Cloud Computing and Big Data",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "-",
                    "เนื้อหา": "ครอบคลุมเทคโนโลยีที่เกี่ยวข้องกับการประมวลผลแบบกลุ่มเมฆ และการจัดการข้อมูลขนาดใหญ่ ศึกษาถึงแนวทาง และการออกแบบระบบเครือข่ายคอมพิวเตอร์ขนาดใหญ่ ทั้งแบบเน้นการประมวลผล และการวิเคราะห์ข้อมูล เนื้อหาครอบคลุมพื้นฐานของระบบคอมพิวเตอร์เสมือนการพัฒนาระบบ และการบริหารจัดการระบบ การจัดสร้างระบบการประมวลผลกลุ่มเมฆ และการจัดการข้อมูลขนาดใหญ่ อาทิ VMware ESX, KVM, Cloudera, OpenStack, vCloud director และระบบอื่นที่เกี่ยวข้อง"
                }
            },
            {
                "category": "วพ.323 การสื่อสารข้อมูลและเครือข่ายคอมพิวเตอร์ 2",
                "subcategories": {
                    "รหัสวิชา": "CN323",
                    "ชื่อวิชาภาษาอังกฤษ": "Data Communication and Computer Networks II",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.320",
                    "เนื้อหา": "โพรโทคอลในการเลือกเส้นทาง การส่งข้อมูลแบบมัลติคาสท์และบรอดคาสท์ ระบบเครือข่ายไร้สายและอุปกรณ์เคลื่อนที่ เครือข่ายคอมพิวเตอร์สำหรับการรับส่งข้อมูลแบบสื่อประสม ความปลอดภัยในระบบเครือข่ายคอมพิวเตอร์ การบริหารเครือข่าย เครือข่ายคอมพิวเตอร์แบบรับรองคุณภาพการให้บริการ"
                }
            },
            {
                "category": "วพ.324 เทคโนโลยีอินเตอร์เน็ต",
                "subcategories": {
                    "รหัสวิชา": "CN324",
                    "ชื่อวิชาภาษาอังกฤษ": "Internet Technologies",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "-",
                    "เนื้อหา": "เทคโนโลยีอินเตอร์เน็ตในโลกปัจจุบัน ศึกษาหน้าที่ตลอดจนวิธีการใช้และการสร้างเครื่องมือช่วยในระบบอินเตอร์เน็ต ความรู้เบื้องต้นเกี่ยวกับทีซีพี/ไอพีและอินเตอร์เน็ต เทคนิคเอชทีเอ็มแอลสำหรับตัวอักษรและรูปภาพ การเชื่อมต่อข้อมูล และรูปแบบ หัวข้อเกี่ยวกับระบบความปลอดภัย หัวข้อเกี่ยวกับเทคโนโลยีอินเตอร์เน็ตในปัจจุบัน"
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 37,
        "details": [
            {
                "category": "วพ.413 การคำนวณแบบขนาน",
                "subcategories": {
                    "รหัสวิชา": "CN413",
                    "ชื่อวิชาภาษาอังกฤษ": "Parallel Computing",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.202",
                    "เนื้อหา": [
                        "เทคนิคในการวิเคราะห์และออกแบบขั้นตอนวิธีแบบขนาน",
                        "เทคนิคการเขียนโปรแกรมบนเครื่องคอมพิวเตอร์ที่มีสภาพแวดล้อมการทำงานแบบขนาน",
                        "แบบจำลองการเขียนโปรแกรมแบบขนานในรูปแบบต่าง ๆ เช่น เอ็มพีไอ โพสิกซ์เทรด โอเพนเอ็มพี โอเพนซีแอล จีพียู",
                        "การประยุกต์ขั้นตอนวิธีแบบขนานในเรื่องต่าง ๆ ได้แก่ การจัดเรียงข้อมูล ขั้นตอนวิธีของกราฟ เทคนิคการออฟติไมซ์แบบดีสครีต การทำเหมืองข้อมูล การคำนวณทางวิทยาศาสตร์"
                    ]
                }
            },
            {
                "category": "วพ.414 ระบบคอมพิวเตอร์แบบกระจาย",
                "subcategories": {
                    "รหัสวิชา": "CN.414",
                    "ชื่อวิชาภาษาอังกฤษ": "Distributed System",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.331 หรือได้รับอนุมัติจากอาจารย์ผู้สอน",
                    "เนื้อหา": [
                        "การเชื่อต่อระบบแบบกระจายกับโปรโตคอลสำหรับเครือข่าย",
                        "ปัญหาในการจัดการหน่วยความจำเสมือน",
                        "การติดต่อกันระหว่างโปรเซส",
                        "สถาปัตยกรรมคอมพิวเตอร์แบบกระจาย",
                        "ขั้นตอนวิธีการคำนวณแบบกระจาย",
                        "การออกแบบระบบแฟ้มข้อมูล",
                        "ความปลอดภัยในระบบคอมพิวเตอร์และเครือข่ายแบบกระจาย"
                    ]
                }
            },
            {
                "category": "วพ.415 การพัฒนาระบบฝังตัว",
                "subcategories": {
                    "รหัสวิชา": "CN415",
                    "ชื่อวิชาภาษาอังกฤษ": "Embedded System Development",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ. 310",
                    "เนื้อหา": [
                        "ทบทวนความรู้เกี่ยวกับไมโครโปรเซสเซอร์",
                        "วัฎจักรของการพัฒนาระบบฝังตัว",
                        "โครงสร้าง และอุปกรณ์ของไมโครคอนโทรลเลอร์",
                        "การเชื่อมต่อหน่วยความจำ และอุปกรณ์ภายนอก",
                        "การวิเคราะห์ฐานเวลา และวงรอบของบัส",
                        "เครื่องมือสำหรับการพัฒนาซอฟต์แวร์ข้ามแพลทฟอร์ม",
                        "การออกแบบและเขียนซอฟต์แวร์ฝังตัว",
                        "การโปรแกรมแบบหลายงานด้วยระบบปฏิบัติการทันเวลา",
                        "การจัดลำดับและการสื่อสารระหว่างงาน",
                        "กรณีศึกษาของการพัฒนาระบบฝังตัว"
                    ]
                }
            },
            {
                "category": "วพ.433 ระบบทำงานแบบทันที",
                "subcategories": {
                    "รหัสวิชา": "CN433",
                    "ชื่อวิชาภาษาอังกฤษ": "Real-Time Systems",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.331",
                    "เนื้อหา": [
                        "แนวคิดของระบบทำงานแบบทันที",
                        "เงื่อนไขของการทำงานแบบทันที",
                        "หัวข้อในเรื่องระบบปฏิบัติการสำหรับระบบทำงานแบบทันที ได้แก่ การจัดลำดับงาน การสื่อสารระหว่างกระบวนงานงาน",
                        "เทคนิคของการโปรแกรมชนิดทำงานแบบทันที",
                        "การประเมินประสิทธิภาพการทำงานแบบทันที ได้แก่ การวิเคราะห์อัตราทางเดียว การวิเคราะห์เวลาทำงานกรณีแย่ที่สุด",
                        "กรณีศึกษาของระบบคอมพิวเตอร์ชนิดทำงานแบบทันที"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 46,
        "details": [
            {
                "category": "กลุ่มเทคโนโลยีและวิธีการทางซอฟท์แวร์",
                "subcategories": {
                    "วพ.201 การโปรแกรมเชิงวัตถุ": {
                        "ชื่อภาษาอังกฤษ": "CN201 Object-Oriented Programming",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "Have earned credits of TU156",
                        "คำอธิบายรายวิชา": "Algorithm Design. Introduction to object-oriented programming. Fundamentals of Computer Programming. Objects, classes and methods. Decisions. Iterations. Inheritance. Polymorphism. Abstract classes and interfaces. Arrays. Array Lists. Exception Handling. Streams."
                    },
                    "วพ.300 การฝึกฝนการโปรแกรม 1": {
                        "ชื่อภาษาอังกฤษ": "CN300 Programming Practice I",
                        "หน่วยกิต": "1(0-3-0)",
                        "วิชาบังคับก่อน": "Have earned credits of or taking TU 156 in the same semester",
                        "คำอธิบายรายวิชา": "Practice using development tools and programming on given problems."
                    },
                    "วพ.302 การฝึกฝนการโปรแกรม 2": {
                        "ชื่อภาษาอังกฤษ": "CN302 Programming Practice II",
                        "หน่วยกิต": "1(0-3-0)",
                        "วิชาบังคับก่อน": "Have earned credits of or taking CN 201in the same semester",
                        "คำอธิบายรายวิชา": "Practice using development tools and programming on given problems."
                    },
                    "วพ.340 วิศวกรรมซอฟต์แวร์": {
                        "ชื่อภาษาอังกฤษ": "CN340 Software Engineering",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "-",
                        "คำอธิบายรายวิชา": "Fundamentals of software engineering. Software development life cycle Techniques and tools for software development. Requirement analysis. Software architecture and detailed design. Coding and debugging techniques. Documentation and release. Computer-aided software engineering. Software testing. Software reuse. Configuration management."
                    },
                    "วพ.341 การวิเคราะห์และออกแบบโปรแกรมเชิงวัตถุ": {
                        "ชื่อภาษาอังกฤษ": "CN341 Object-Oriented Analysis and Design",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "Have earned credits of CN201",
                        "คำอธิบายรายวิชา": "Software analysis and design using the object-oriented paradigm. Object-oriented programming languages will be covered with the goal of applying materials for analysis, design, and implementation of real applications."
                    },
                    "วพ.342 การพัฒนาโปรแกรมประยุกต์บนเว็บ": {
                        "ชื่อภาษาอังกฤษ": "CN342 Web Application Development",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "Have earned credits of TU156",
                        "คำอธิบายรายวิชา": "Information not provided in the given document."
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 23,
        "details": [
            {
                "category": "รายวิชา",
                "subcategories": {
                    "วท.173": {
                        "ชื่อวิชา": "ปฏิบัติการเคมีพื้นฐาน 1",
                        "ชื่อภาษาอังกฤษ": "SC173 Fundamental Chemistry Laboratory",
                        "หน่วยกิต": "(0-3-0)",
                        "วิชาบังคับก่อน": "เคยศึกษา หรือศึกษาพร้อมกับ วท.123",
                        "คำอธิบายรายวิชา": "ปฏิบัติการเสริมความรู้ทางทฤษฎีรายวิชา วท.123"
                    },
                    "สษ.202": {
                        "ชื่อวิชา": "ภาษาอังกฤษสำหรับการทำงาน",
                        "ชื่อภาษาอังกฤษ": "EL202 English for work",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ สษ.172",
                        "คำอธิบายรายวิชา": "เตรียมความพร้อมและฝึกฝนนักศึกษาเพื่อเข้าสู่การทำงาน ฝึกใช้ทักษะการฟัง พูด อ่านและเขียน ในบริบทการทำงาน"
                    }
                }
            },
            {
                "category": "วิชาบังคับเลือก",
                "subcategories": {
                    "จำนวนหน่วยกิต": "1 วิชา ไม่น้อยกว่า 2 หน่วยกิต",
                    "รายวิชา": {
                        "วค.106": {
                            "ชื่อวิชา": "ความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน",
                            "ชื่อภาษาอังกฤษ": "AE106 Sustainability of Natural Resources and Energy",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คำอธิบายรายวิชา": "พื้นฐานเกี่ยวกับนิเวศวิทยา เพื่อประโยชน์สำหรับการอนุรักษ์ทรัพยากรธรรมชาติและสิ่งแวดล้อม ลักษณะของมลพิษสิ่งแวดล้อมและผลกระทบต่อสังคม แนวคิดต่างๆ เกี่ยวกับความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน การวิเคราะห์การตัดสินใจ จริยธรรมสิ่งแวดล้อม การออกแบบที่ยั่งยืน การใช้พลังงานของประเทศไทย การใช้พลังงานในภาคการขนส่ง การใช้พลังงานในภาคอุตสาหกรรม และอาคารธุรกิจ แนวทางการพัฒนาพลังงานที่ยั่งยืนสำหรับประเทศไทย การผลิตไฟฟ้าสำหรับประเทศไทย การประหยัดพลังงาน พลังงานทางเลือก พลังงานแสงอาทิตย์ ชีวมวลเพื่อพลังงาน การผลิตเอทานอล การผลิตไบโอดีเซล เทคโนโลยีถ่านหินสะอาด พลังงานนิวเคลียร์"
                        },
                        "วย.106": {
                            "ชื่อวิชา": "เทคนิคในการสื่อสารและการนำเสนอ",
                            "ชื่อภาษาอังกฤษ": "CE106 Communication and Presentation Technique",
                            "หน่วยกิต": "2 (2-0-4)",
                            "คำอธิบายรายวิชา": "เทคนิคการอ่านจับใจความ และประเด็นสำคัญ รวมทั้งการสรุป การเขียนรายงาน การเขียนสรุปผลการทดลอง การนำเสนอข้อมูลในแบบตาราง รูป หน่วย สัญลักษณ์และสมการทางคณิตศาสตร์ ศัพท์บัญญัติและการทับศัพท์ รูปแบบของรายงาน การนำเสนอผลงานและเทคนิคในการนำเสนอผลงาน"
                        },
                        "น.209": {
                            "ชื่อวิชา": "หลักกฎหมายแพ่งและพาณิชย์",
                            "ชื่อภาษาอังกฤษ": "LA209 Civil and Commercial Law",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คำอธิบายรายวิชา": "ศึกษาหลักทั่วไปของกฎหมายแพ่งและพาณิชย์ในลักษณะ 1. บุคคล (1. บุคคลธรรมดา-สภาพบุคคล, ความสามารถ, สถานะและการจดทะเบียน, ภูมิลำเนา, การสิ้นสภาพบุคคล 2. นิติบุคคล) 2. ทรัพย์ (ประเภทและทรัพยสิทธิ) 3. นิติกรรม (หลักทั่วไป, การแสดงเจตนา, โมฆะและโมฆียะกรรม, เงื่อนไข, เงื่อนเวลา, ระยะเวลาอายุความ) 4. หนี้และสัญญา"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 6,
        "details": [
            {
                "category": "วัตถุประสงค์",
                "subcategories": {
                    "1.2.3": "เพื่อผลิตบัณฑิตที่มีความใฝ่รู้ หมั่นแสวงหาความรู้ด้วยตนเอง และมีความคิดริเริ่มสร้างสรรค์",
                    "1.2.4": "เพื่อผลิตบัณฑิตที่มีคุณธรรมและมีความซื่อสัตย์ในวิชาชีพ"
                }
            },
            {
                "category": "ระบบการจัดการศึกษา",
                "subcategories": {
                    "ระบบ": "ใช้ระบบการศึกษาแบบทวิภาค โดย 1 ปีการศึกษา แบ่งออกเป็น 2 ภาคการศึกษาปกติ 1 ภาคการศึกษาปกติมีระยะเวลาศึกษาไม่น้อยกว่า 16 สัปดาห์ และอาจเปิดภาคฤดูร้อนได้โดยใช้เวลาการศึกษา ไม่น้อยกว่า 6 สัปดาห์",
                    "การคิดหน่วยกิต": {
                        "วิชาบรรยาย": "1 ชั่วโมงต่อสัปดาห์มีค่าเท่ากับ 1 หน่วยกิต",
                        "วิชาฝึกหรือทดลอง": "2 หรือ 3 ชั่วโมงต่อสัปดาห์มีค่าเท่ากับ 1 หน่วยกิต",
                        "การฝึกงานหรือฝึกภาคสนาม": "ใช้เวลาฝึก 3-6 ชั่วโมงต่อสัปดาห์ ตลอดภาคการศึกษาปกติรวม 45-90 ชั่วโมง มีค่าเท่ากับ 1 หน่วยกิต",
                        "โครงงานทางด้านวิศวกรรม": "นักศึกษาใช้เวลาฝึกปฏิบัติ 3 ชั่วโมงต่อสัปดาห์ ตลอดภาคการศึกษาปกติรวม 45 ชั่วโมง มีค่าเท่ากับ 1 หน่วยกิต"
                    },
                    "การจัดการศึกษาภาคฤดูร้อน": "มีการจัดการศึกษาภาคฤดูร้อน ในการเรียนชั้นปีที่ 3",
                    "การเทียบเคียงหน่วยกิตในระบบทวิภาค": "ไม่มี"
                }
            },
            {
                "category": "การดำเนินการหลักสูตร",
                "subcategories": {
                    "วัน-เวลาในการดำเนินการเรียนการสอน": {
                        "ภาคการศึกษาที่ 1": "เดือนมิถุนายน – ตุลาคม",
                        "ภาคการศึกษาที่ 2": "เดือนพฤศจิกายน – มีนาคม",
                        "ภาคฤดูร้อน": "เดือนมีนาคม – พฤษภาคม"
                    },
                    "คุณสมบัติของผู้เข้าศึกษา": "คุณสมบัติของผู้เข้าศึกษาต้องเป็นไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ ว่าด้วยการศึกษาชั้นปริญญาตรี พ.ศ. 2540 (แก้ไขเพิ่มเติมถึงปัจจุบัน ฉบับที่ 3 พ.ศ.2555) ข้อ 7",
                    "วิธีการคัดเลือกผู้เข้าศึกษา": "ผู้เข้าศึกษาต้องผ่านการสอบคัดเลือก และ/หรือ การสอบสัมภาษณ์ ตามระเบียบกฎเกณฑ์ที่คณะวิศวกรรมศาสตร์ และมหาวิทยาลัยธรรมศาสตร์กำหนดโดยความเห็นชอบของสภามหาวิทยาลัย"
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 32,
        "details": [
            {
                "category": "วิชาเลือก",
                "subcategories": {
                    "วิชาเลือกด้านการออกแบบและพัฒนา": {
                        "วพ.311 การพัฒนาระบบไมโครโปรเซสเซอร์": {
                            "รหัสวิชา": "CN311",
                            "ชื่อภาษาอังกฤษ": "Microprocessor Systems Development",
                            "หน่วยกิต": "3(3-0-6)",
                            "วิชาบังคับก่อน": "สอบได้หรือศึกษาพร้อมกับ วพ.310",
                            "คำอธิบายรายวิชา": "แนวทางการพัฒนาส่วนต่าง ๆ ของระบบไมโครโปรเซสเซอร์ ได้แก่ ส่วนการเชื่อมต่อกับอุปกรณ์อินพุทและเอาท์พุท วงจรนับและจับเวลา การจัดการสัญญาณขัดจังหวะ ส่วนการติดต่อแบบอนุกรม การเชื่อมต่อสัญญาณแอนะล็อก"
                        },
                        "วพ.312 การพัฒนาโปรแกรมคอมพิวเตอร์ประยุกต์": {
                            "รหัสวิชา": "CN312",
                            "ชื่อภาษาอังกฤษ": "Computer Application Development",
                            "หน่วยกิต": "3(3-0-6)",
                            "วิชาบังคับก่อน": "สอบได้ มธ.156",
                            "คำอธิบายรายวิชา": "แนวทางการพัฒนาโปรแกรมคอมพิวเตอร์ประยุกต์ในด้านต่าง ๆ ได้แก่ โปรแกรมในส่วนที่ติดต่อกับผู้ใช้ โปรแกรมเพื่อใช้งานพอร์ตสื่อสาร โปรแกรมเพื่อเชื่อมต่อกับอุปกรณ์ฮาร์ดแวร์ภายนอก โปรแกรมในการรวบรวมข้อมูล"
                        },
                        "วพ.322 การออกแบบเครือข่ายคอมพิวเตอร์": {
                            "รหัสวิชา": "CN322",
                            "ชื่อภาษาอังกฤษ": "Computer Network Design",
                            "หน่วยกิต": "3(3-0-6)",
                            "วิชาบังคับก่อน": "สอบได้หรือศึกษาพร้อมกับ วพ.320",
                            "คำอธิบายรายวิชา": "ความรู้พื้นฐานในการปรับแต่งและออกแบบเครือข่ายคอมพิวเตอร์ ได้แก่ พื้นฐานเครือข่าย TCP/IP การตรวจจับข้อมูลในเครือข่าย การทำงานกับอุปกรณ์เชื่อมต่อเครือข่าย เช่น อุปกรณ์จัดเส้นทาง กลไกการหาเส้นทางในเครือข่าย IP แลนเสมือน การควบคุมการรับส่งกลุ่มข้อมูล IP การแปลงหมายเลขเครือข่าย หลักในการออกแบบระบบเครือข่าย"
                        },
                        "วพ.332 การปรับแต่งคอมพิวเตอร์แม่ข่าย": {
                            "รหัสวิชา": "CN332",
                            "ชื่อภาษาอังกฤษ": "Computer Server Configuration",
                            "หน่วยกิต": "3(3-0-6)",
                            "วิชาบังคับก่อน": "-",
                            "คำอธิบายรายวิชา": "การปรับแต่งค่าของคอมพิวเตอร์แม่ข่ายเพื่อให้บริการในด้านต่าง ๆ ได้แก่ บริการชื่อโดเมน บริการถ่ายโอนแฟ้ม บริการเว็บ บริการไปรษณีย์อิเล็กทรอนิกส์ บริการฐานข้อมูล"
                        }
                    },
                    "วิชาเลือกเฉพาะรูปแบบ": {
                        "วพ.403 การฝึกงานทางวิศวกรรมคอมพิวเตอร์": {
                            "รหัสวิชา": "CN403",
                            "ชื่อภาษาอังกฤษ": "Computer Engineering Internship",
                            "หน่วยกิต": "0 (ไม่น้อยกว่า 240 ชั่วโมงต่อภาคการศึกษา)",
                            "วิชาบังคับก่อน": "นักศึกษาชั้นปีที่3 ขึ้นไป และผ่านการทดสอบภาษาอังกฤษตามที่คณะวิศวกรรมศาสตร์กำหนด",
                            "คำอธิบายรายวิชา": "ฝึกงานด้านวิศวกรรมคอมพิวเตอร์ในภาคการศึกษาฤดูร้อน ในห้องปฏิบัติงานวิจัย หน่วยงานราชการ รัฐวิสาหกิจ บริษัทหรือโรงงานที่ภาควิชาให้ความเห็นชอบ โดยมีกำหนดระยะเวลาฝึกงานไม่น้อยกว่า 240 ชั่วโมง นักศึกษาจะต้องส่งรายงานการฝึกงานต่อภาควิชาฯ วิชานี้วัดผลเป็นระดับคะแนน S หรือ U"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 13,
        "details": [
            {
                "category": "วิชาเลือกเฉพาะรูปแบบ",
                "subcategories": {
                    "จำนวนหน่วยกิต": "15 หน่วยกิต",
                    "รูปแบบที่เลือกศึกษา": "เลือกศึกษารูปแบบใดแบบหนึ่ง ดังต่อไปนี้"
                }
            },
            {
                "category": "รูปแบบที่ 1",
                "subcategories": {
                    "วิชาที่ต้องศึกษา": [
                        {
                            "รหัสวิชา": "วพ.403",
                            "ชื่อวิชา": "ฝึกงานทางวิศวกรรมคอมพิวเตอร์",
                            "หน่วยกิต": "0 (ไม่น้อยกว่า 240 ชั่วโมงต่อภาคการศึกษา)"
                        },
                        {
                            "รหัสวิชา": "วพ.404",
                            "ชื่อวิชา": "โครงงานทางวิศวกรรมคอมพิวเตอร์ 1",
                            "หน่วยกิต": "1 (0-3-0)"
                        },
                        {
                            "รหัสวิชา": "วพ.405",
                            "ชื่อวิชา": "โครงงานทางวิศวกรรมคอมพิวเตอร์ 2",
                            "หน่วยกิต": "2 (0-6-0)"
                        }
                    ],
                    "วิชาเลือกเฉพาะรูปแบบ": "เลือกศึกษาวิชาเลือกเฉพาะรูปแบบที่คณะกำหนดไม่น้อยกว่า 12 หน่วยกิต"
                }
            },
            {
                "category": "รูปแบบที่ 2",
                "subcategories": {
                    "วิชาที่ต้องศึกษา": [
                        {
                            "รหัสวิชา": "วพ.406",
                            "ชื่อวิชา": "การเตรียมสหกิจศึกษาวิศวกรรมคอมพิวเตอร์",
                            "หน่วยกิต": "1 (0-3-0)"
                        },
                        {
                            "รหัสวิชา": "วพ.407",
                            "ชื่อวิชา": "สหกิจศึกษาวิศวกรรมคอมพิวเตอร์",
                            "หน่วยกิต": "8 (ไม่น้อยกว่า 16 สัปดาห์ใน 1 ภาคการศึกษา)"
                        }
                    ],
                    "วิชาเลือกเฉพาะรูปแบบ": "เลือกศึกษาวิชาเลือกเฉพาะรูปแบบที่คณะกำหนดไม่น้อยกว่า 6 หน่วยกิต"
                }
            },
            {
                "category": "วิชาเลือกสำหรับวิชาเลือกเฉพาะรูปแบบ",
                "subcategories": {
                    "รายวิชา": [
                        {
                            "รหัสวิชา": "วพ.304",
                            "ชื่อวิชา": "ทฤษฎีการคำนวณ",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วพ.313",
                            "ชื่อวิชา": "การโปรแกรมภาษาวีเอชดีแอล",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วพ.315",
                            "ชื่อวิชา": "ผู้ดูแลระบบคอมพิวเตอร์ชั้นสูง",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วพ.316",
                            "ชื่อวิชา": "การประมวลผลแบบกลุ่มเมฆ และการจัดการข้อมูลขนาดใหญ่",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วพ.323",
                            "ชื่อวิชา": "การสื่อสารข้อมูลและเครือข่ายคอมพิวเตอร์ 2",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วพ.324",
                            "ชื่อวิชา": "เทคโนโลยีอินเตอร์เน็ต",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วพ.325",
                            "ชื่อวิชา": "ความมั่นคงในการสื่อสารเบื้องต้น",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วพ.326",
                            "ชื่อวิชา": "โพรโทคอลและการวิเคราะห์โพรโทคอลด้านความมั่นคงในการสื่อสาร",
                            "หน่วยกิต": "3 (3-0-6)"
                        },
                        {
                            "รหัสวิชา": "วพ.327",
                            "ชื่อวิชา": "หัวข้อพิเศษทางความมั่นคงสารสนเทศ",
                            "หน่วยกิต": "3 (3-0-6)"
                        }
                    ]
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 8,
        "details": [
            {
                "category": "รายวิชาในหลักสูตร",
                "subcategories": {
                    "รหัสวิชา": {
                        "อักษรย่อ": "วพ. /CN หมายถึง อักษรย่อของสาขาวิชาวิศวกรรมคอมพิวเตอร์",
                        "ตัวเลข": {
                            "เลขหลักหน่วย": {
                                "เลข 0-2": "หมายถึง วิชาบังคับ",
                                "เลข 3-9": "หมายถึง วิชาเลือกของสาขา"
                            },
                            "เลขหลักสิบ": {
                                "เลข 0": "หมายถึง วิชาในหมวดวิชาทั่วไปทางวิศวกรรมคอมพิวเตอร์",
                                "เลข 1": "หมายถึง วิชาในหมวดวิชาระบบคอมพิวเตอร์",
                                "เลข 2": "หมายถึง วิชาในหมวดวิชาระบบเครือข่าย",
                                "เลข 3": "หมายถึง วิชาในหมวดวิชาระบบซอฟต์แวร์",
                                "เลข 4": "หมายถึง วิชาในหมวดวิชาวิศวกรรมซอฟต์แวร์",
                                "เลข 5": "หมายถึง วิชาในหมวดวิชาปัญญาประดิษฐ์",
                                "เลข 6": "หมายถึง วิชาในหมวดวิชาอื่นๆ"
                            },
                            "เลขหลักร้อย": {
                                "เลข 1-4": "หมายถึง ชั้นปีที่ควรเรียน"
                            }
                        }
                    },
                    "รายวิชาและข้อกำหนดของหลักสูตร": {
                        "วิชาศึกษาทั่วไป": {
                            "จำนวนหน่วยกิต": "30 หน่วยกิต",
                            "โครงสร้าง": {
                                "ส่วนที่ 1": {
                                    "จำนวนหน่วยกิต": "21 หน่วยกิต",
                                    "หมวดมนุษยศาสตร์": {
                                        "บังคับ": "1 วิชา 2 หน่วยกิต",
                                        "รายวิชา": {
                                            "มธ.110": {
                                                "ชื่อวิชา": "สหวิทยาการมนุษยศาสตร์",
                                                "หน่วยกิต": "2 (2-0-4)"
                                            }
                                        }
                                    },
                                    "หมวดสังคมศาสตร์": {
                                        "บังคับ": "2 วิชา 5 หน่วยกิต",
                                        "รายวิชา": {
                                            "มธ.100": {
                                                "ชื่อวิชา": "พลเมืองกับความรับผิดชอบต่อสังคม",
                                                "หน่วยกิต": "3 (3-0-6)"
                                            },
                                            "มธ.120": {
                                                "ชื่อวิชา": "สหวิทยาการสังคมศาสตร์",
                                                "หน่วยกิต": "2 (2-0-4)"
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            },
            {
                "category": "วิชาเลือกเสรี",
                "subcategories": {
                    "จำนวนหน่วยกิต": "6 หน่วยกิต"
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 55,
        "details": [
            {
                "category": "วพ.414 ระบบคอมพิวเตอร์แบบกระจาย",
                "subcategories": {
                    "รหัสวิชา": "CN414",
                    "ชื่อภาษาอังกฤษ": "Distributed System",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "Pass CN331",
                    "เนื้อหา": "Interface to network protocols, Distributed run-time binding, Advanced virtual memory issues, Advanced means of interprocess communication, File system design, Design for extensibility, and security in a distributed environment."
                }
            },
            {
                "category": "วพ.415 การพัฒนาระบบฝังตัว",
                "subcategories": {
                    "รหัสวิชา": "CN415",
                    "ชื่อภาษาอังกฤษ": "Embedded System Development",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "Pass CN310",
                    "เนื้อหา": "Review on microprocessor-based system, Embedded system development life cycle, Microcontroller architecture and peripherals, Memory and I/O interfacing, Timing and bus cycle analysis, Toolchain for cross-platform software development, Embedded software design and implementation, Multitasking programming with real-time operating system, Scheduling and inter-process communication, Case studies of embedded system development."
                }
            },
            {
                "category": "วพ.433 ระบบทำงานแบบทันที",
                "subcategories": {
                    "รหัสวิชา": "CN433",
                    "ชื่อภาษาอังกฤษ": "Real-Time Systems",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "Have earned credits of CN331",
                    "เนื้อหา": "Concepts of real-time systems, Real-time constraints, Real-time operating systems: scheduling, inter-process communication, Real-time programming techniques, Evaluation of real-time performance: rate monotonic analysis, worst-case execution time analysis, Case studies of real-time computer systems."
                }
            },
            {
                "category": "วฟ.320 ทฤษฎีการสื่อสาร",
                "subcategories": {
                    "รหัสวิชา": "LE320",
                    "ชื่อภาษาอังกฤษ": "Fundamentals of Communication Systems",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "Have earned credits of LE210",
                    "เนื้อหา": "Introduction to signal and system, Spectrum of signal and applications of Fourier Series and transform, Analog modulation (AM, DSB, SSB, FM, NBFM, PM), Noise in analog communication, Binary baseband modulation, Nyquist's sampling theory and quantization, Pulse analog modulation (PCM, DM), Multiplexing (TDM, FDM), Introduction to transmission lines, radio wave propagation, microwave components and satellite communications, and optical communication."
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 28,
        "details": [
            {
                "category": "กลุ่มเทคโนโลยีและวิธีการทางซอฟต์แวร์",
                "subcategories": {
                    "วพ.201_การโปรแกรมเชิงวัตถุ": {
                        "รหัสวิชาภาษาอังกฤษ": "CN201",
                        "ชื่อวิชาภาษาอังกฤษ": "Object-Oriented Programming",
                        "หน่วยกิต": "4(4-0-8)",
                        "วิชาบังคับก่อน": "สอบได้ มธ.156",
                        "เนื้อหา": "การออกแบบขั้นตอนวิธี การแก้ปัญหาด้วยแนวคิดเชิงวัตถุ ภาษาที่สนับสนุนการเขียนโปรแกรมเชิงวัตถุ ความรู้พื้นฐานที่ใช้ในการเขียนโปรแกรม วัตถุ คลาส และการกระทำ โครงสร้างการตัดสินใจ โครงสร้างการทำซ้ำ การสืบทอดคุณสมบัติ โพลีมอฟิซึม คลาสนามธรรมและอินเตอร์เฟส แถวลำดับ รายการแถวลำดับ การจัดการสิ่งผิดปกติ กระแสข้อมูล"
                    },
                    "วพ.300_การฝึกฝนการโปรแกรม_1": {
                        "รหัสวิชาภาษาอังกฤษ": "CN300",
                        "ชื่อวิชาภาษาอังกฤษ": "Programming Practice I",
                        "หน่วยกิต": "1(0-3-0)",
                        "วิชาบังคับก่อน": "สอบได้หรือศึกษาพร้อมกับ มธ.156",
                        "เนื้อหา": "ฝึกฝนใช้เครื่องมือพัฒนาซอฟต์แวร์และเขียนโปรแกรมตามโจทย์ที่กำหนด"
                    },
                    "วพ.302_การฝึกฝนการโปรแกรม_2": {
                        "รหัสวิชาภาษาอังกฤษ": "CN302",
                        "ชื่อวิชาภาษาอังกฤษ": "Programming Practice II",
                        "หน่วยกิต": "1(0-3-0)",
                        "วิชาบังคับก่อน": "สอบได้หรือศึกษาพร้อมกับ วพ.201",
                        "เนื้อหา": "ฝึกฝนใช้เครื่องมือพัฒนาซอฟต์แวร์และเขียนโปรแกรมตามโจทย์ที่กำหนด"
                    },
                    "วพ.340_วิศวกรรมซอฟต์แวร์": {
                        "รหัสวิชาภาษาอังกฤษ": "CN340",
                        "ชื่อวิชาภาษาอังกฤษ": "Software Engineering",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "-",
                        "เนื้อหา": "หลักการของวิศวกรรมซอฟต์แวร์ วัฎจักรของการพัฒนาซอฟต์แวร์ เทคนิคและเครื่องมือในการพัฒนาซอฟต์แวร์ การวิเคราะห์ความต้องการ การออกแบบสถาปัตยกรรมและรายละเอียดซอฟต์แวร์ เทคนิคการเขียนและดีบักโปรแกรม การทำเอกสารและส่งมอบ การใช้คอมพิวเตอร์ช่วยในวิศวกรรมซอฟต์แวร์ การทดสอบซอฟต์แวร์ การนำซอฟต์แวร์กลับมาใช้ การจัดการองค์ประกอบ"
                    },
                    "วพ.341_การวิเคราะห์และออกแบบโปรแกรมเชิงวัตถุ": {
                        "รหัสวิชาภาษาอังกฤษ": "CN341",
                        "ชื่อวิชาภาษาอังกฤษ": "Object-Oriented Analysis and Design",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ วพ.201",
                        "เนื้อหา": "แนวทางการวิเคราะห์และออกแบบโปรแกรมเชิงวัตถุ โดยใช้ตัวอย่างของภาษาคอมพิวเตอร์ประเภทต่าง ๆ เพื่อให้สามารถนำความรู้ไปประยุกต์ในการวิเคราะห์ ออกแบบและพัฒนาระบบงานจริงได้"
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 52,
        "details": [
            {
                "category": "วพ.315 ผู้ดูแลระบบคอมพิวเตอร์ขั้นสูง",
                "subcategories": {
                    "Course_Code": "CN315",
                    "Course_Name_English": "Advanced System Administration",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "-",
                    "Course_Description": "Deploying and managing network servers running caching Domain Name service (DNS), Web Server, Active Directory, SMTP, Network file sharing, Advance networking and firewall configuration, understanding the system process, package management, and troubleshoot the system."
                }
            },
            {
                "category": "วพ.316 การประมวลผลแบบกลุ่มเมฆ และการจัดการข้อมูลขนาดใหญ่",
                "subcategories": {
                    "Course_Code": "CN316",
                    "Course_Name_English": "Cloud Computing and Big Data",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "-",
                    "Course_Description": "Technology related to Cloud Computing and Big Data. Explore solutions and design principle for building large network-based systems to both compute and data intensive computing. Topics include resource virtualization concept, System implementation, and System management. Deployed cloud computing and big data system such as VMware ESX, KVM, Cloudera, OpenStack, vCloud director, and many other systems."
                }
            },
            {
                "category": "วพ.323 การสื่อสารข้อมูลและเครือข่ายคอมพิวเตอร์ 2",
                "subcategories": {
                    "Course_Code": "CN323",
                    "Course_Name_English": "Data Communication and Computer Networks II",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of CN320",
                    "Course_Description": "Routing Protocols. Multicast and broadcast routing. Wireless networks and mobile systems. Multimedia networking. Security in computer networks. Network management. Quality-of-Services (QoS) Networks."
                }
            },
            {
                "category": "วพ.324 เทคโนโลยีอินเตอร์เน็ต",
                "subcategories": {
                    "Course_Code": "CN324",
                    "Course_Name_English": "Internet Technologies",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "-",
                    "Course_Description": "Survey of contemporary Internet technologies. The role, use and implementation of current Internet tools. Basic TCP/IP and World Wide Web. HTML techniques for text, images, links and form. Security issues. Topics on existing Internet technologies."
                }
            },
            {
                "category": "วพ.325 ความมั่นคงในการสื่อสารเบื้องต้น",
                "subcategories": {
                    "Course_Code": "CN325",
                    "Course_Name_English": "Introduction to Cryptography",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of CN 200 and CN 304 or approval by instructor",
                    "Course_Description": "Basic concepts in modern cryptography. Topics include basic primitives for both symmetric-key and asymmetric-key cryptosystems. Constructions, analyses, and security definitions of basic cryptographic primitives such as encryption schemes and message authentication codes based on block ciphers, such as DES and AES, and those based on number-theoretic constructs, such as the discrete logarithm function. The main approach used in analyzing cryptographic constructs will be the practice-oriented provable security approach."
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 17,
        "details": [
            {
                "category": "ปีการศึกษาที่2",
                "subcategories": {
                    "ภาคเรียนที่1": {
                        "หน่วยกิต": "19",
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "ค.214",
                                "ชื่อวิชา": "สมการเชิงอนุพันธ์",
                                "หน่วยกิต": "3"
                            },
                            {
                                "รหัสวิชา": "ท.161",
                                "ชื่อวิชา": "การใช้ภาษาไทย",
                                "หน่วยกิต": "3"
                            },
                            {
                                "รหัสวิชา": "วฟ.240",
                                "ชื่อวิชา": "การวิเคราะห์วงจรไฟฟ้า",
                                "หน่วยกิต": "3",
                                "หมายเหตุ": "*3"
                            },
                            {
                                "รหัสวิชา": "วฟ.201",
                                "ชื่อวิชา": "ปฏิบัติการพื้นฐานทางวิศวกรรมไฟฟ้า1",
                                "หน่วยกิต": "1",
                                "หมายเหตุ": "*3"
                            },
                            {
                                "รหัสวิชา": "วพ.200",
                                "ชื่อวิชา": "คณิตศาสตร์แบบไม่ต่อเนื่อง",
                                "หน่วยกิต": "3",
                                "หมายเหตุ": "*2"
                            },
                            {
                                "รหัสวิชา": "วพ.202",
                                "ชื่อวิชา": "โครงสร้างข้อมูลและขั้นตอนวิธี1",
                                "หน่วยกิต": "3",
                                "หมายเหตุ": "*5"
                            },
                            {
                                "รหัสวิชา": "วพ.260",
                                "ชื่อวิชา": "ทฤษฏีความน่าจะเป็นและกระบวนการสุ่มทางวิศวกรรมคอมพิวเตอร์",
                                "หน่วยกิต": "3",
                                "หมายเหตุ": "*2"
                            }
                        ]
                    },
                    "ภาคเรียนที่2": {
                        "หน่วยกิต": "21",
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "มธ.100",
                                "ชื่อวิชา": "พลเมืองกับความรับผิดชอบต่อสังคม",
                                "หน่วยกิต": "3"
                            },
                            {
                                "รหัสวิชา": "วฟ.210",
                                "ชื่อวิชา": "สัญญาณและระบบ",
                                "หน่วยกิต": "3"
                            },
                            {
                                "รหัสวิชา": "วฟ.241",
                                "ชื่อวิชา": "อุปกรณ์และวงจรอิเล็กทรอนิกส์พื้นฐาน",
                                "หน่วยกิต": "3",
                                "หมายเหตุ": "*3"
                            },
                            {
                                "รหัสวิชา": "วพ.301",
                                "ชื่อวิชา": "โครงสร้างข้อมูลและขั้นตอนวิธี 2",
                                "หน่วยกิต": "3",
                                "หมายเหตุ": "*5"
                            },
                            {
                                "รหัสวิชา": "วพ.210",
                                "ชื่อวิชา": "การออกแบบวงจรดิจิตอลทางวิศวกรรมคอมพิวเตอร์",
                                "หน่วยกิต": "3",
                                "หมายเหตุ": "*4"
                            },
                            {
                                "รหัสวิชา": "วพ.211",
                                "ชื่อวิชา": "การสังเคราะห์วงจรดิจิตอล",
                                "หน่วยกิต": "3",
                                "หมายเหตุ": "*4"
                            },
                            {
                                "รหัสวิชา": "วพ.212",
                                "ชื่อวิชา": "สถาปัตยกรรมคอมพิวเตอร์",
                                "หน่วยกิต": "3",
                                "หมายเหตุ": "*6"
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 24,
        "details": [
            {
                "category": "น.249 ความรู้เบื้องต้นเกี่ยวกับทรัพย์สินทางปัญญา",
                "subcategories": {
                    "รหัสวิชา": "LA249",
                    "ชื่อวิชาภาษาอังกฤษ": "Introduction to Intellectual Property",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "เป็นนักศึกษาตั้งแต่ชั้นปีที่ 2 ขึ้นไป",
                    "เนื้อหาวิชา": "ความรู้พื้นฐานการให้ความคุ้มครอง 'ผลงานสร้างสรรค์อันเกิดจากความคิดของมนุษย์' เหตุผลและความจำเป็นในการให้ความคุ้มครอง ประโยชน์ที่จะได้รับจากการคุ้มครอง ตลอดจนการบังคับสิทธิที่เกิดจากการคุ้มครองโดยยกตัวอย่างกฎหมายทรัพย์สินทางปัญญาที่มีอยู่ โดยเฉพาะอย่างยิ่งกฎหมายที่เกี่ยวข้องกับชีวิตประจำวันของนักศึกษามากที่สุด เช่น กฎหมายลิขสิทธิ์และเครื่องหมายการค้า"
                }
            },
            {
                "category": "พบ.291 ธุรกิจเบื้องต้น",
                "subcategories": {
                    "รหัสวิชา": "BA291",
                    "ชื่อวิชาภาษาอังกฤษ": "Introduction to Business",
                    "หน่วยกิต": "3 (3-0-3)",
                    "เนื้อหาวิชา": "ลักษณะของธุรกิจ สภาพแวดล้อมและรูปแบบความเป็นเจ้าของธุรกิจ การบริหารธุรกิจ กิจกรรมทางธุรกิจด้านการผลิต การตลาด การเงิน การบัญชี การบริหารสารสนเทศ และการบริหารทรัพยากรมนุษย์ ทั้งนี้เพื่อปูพื้นฐานแนวความคิดของการบริหารธุรกิจ และให้เกิดความคิดรวบยอดผ่านการจัดทำแผนธุรกิจ",
                    "หมายเหตุ": "เป็นวิชาสำหรับนักศึกษานอกคณะพาณิชย์ฯ ที่ประสงค์จะเรียนรายวิชาต่าง ๆ ของคณะฯ เป็นวิชาโท ควรจะเรียนวิชา พบ.291 ก่อนวิชาอื่นเพื่อใช้เป็นพื้นฐานในการเรียนวิชาต่าง ๆ ของคณะพาณิชย์ฯ"
                }
            },
            {
                "category": "ทม.201 หลักการบริหาร",
                "subcategories": {
                    "รหัสวิชา": "HR201",
                    "ชื่อวิชาภาษาอังกฤษ": "Principles of Management",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหาวิชา": "แนวคิดทางการบริหาร วิวัฒนาการทฤษฎีการบริหาร หน้าที่และทักษะผู้บริหารองค์กร การวางแผน การจัดองค์การ การเป็นผู้นำ และการควบคุม การตัดสินใจทางการบริหาร และจริยธรรมการบริหาร"
                }
            },
            {
                "category": "ศ.213 เศรษฐศาสตร์จุลภาคเบื้องต้น",
                "subcategories": {
                    "รหัสวิชา": "EC213",
                    "ชื่อวิชาภาษาอังกฤษ": "Introductory Microeconomics",
                    "หน่วยกิต": "3 (3-0-6)",
                    "หมายเหตุ": "(สำหรับนักศึกษานอกคณะเศรษฐศาสตร์)",
                    "เนื้อหาวิชา": "แนวคิดและการประยุกต์ใช้ทฤษฎีเศรษฐศาสตร์เกี่ยวกับปัญหาพื้นฐานทางเศรษฐกิจ การทำงานของกลไกราคา อุปสงค์และอุปทานของสินค้า ทฤษฎีเบื้องต้นเกี่ยวกับพฤติกรรมผู้บริโภค พฤติกรรมการผลิต ต้นทุนการผลิต การกำหนดราคาสินค้าในตลาดที่มีการแข่งขันสมบูรณ์และไม่สมบูรณ์รูปแบบต่าง ๆ เปรียบเทียบประสิทธิภาพการจัดสรรทรัพยากรการผลิตในตลาดแข่งขันสมบูรณ์และตลาดอื่น ๆ ทฤษฎีเบื้องต้นเกี่ยวกับตลาดปัจจัยการผลิตและความล้มเหลวของตลาด"
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 12,
        "details": [
            {
                "category": "กลุ่มฮาร์ดแวร์ และสถาปัตยกรรมคอมพิวเตอร์",
                "subcategories": {
                    "วพ.210": "การออกแบบวงจรดิจิตอลทางวิศวกรรมคอมพิวเตอร์ 3 (3-0-6)",
                    "CN210": "Digital Circuits Design in Computer Engineering",
                    "วพ.211": "การสังเคราะห์วงจรดิจิตอล 3 (3-0-6)",
                    "CN211": "Synthesis of Digital Circuits",
                    "วพ.212": "สถาปัตยกรรมคอมพิวเตอร์ 3 (3-0-6)",
                    "CN212": "Fundamentals of Computer Architecture",
                    "วพ.310": "การออกแบบระบบไมโครโปรเซสเซอร์ 3 (3-0-6)",
                    "CN310": "Microprocessor Systems Design",
                    "วฟ.201": "ปฏิบัติการพื้นฐานทางวิศวกรรมไฟฟ้า 1 1 (0-3-0)",
                    "LE201": "Basic Electrical Engineering Laboratory I",
                    "วฟ.240": "การวิเคราะห์วงจรไฟฟ้า 3 (3-0-6)",
                    "LE240": "Electric Circuit Analysis",
                    "วฟ.241": "อุปกรณ์และวงจรอิเล็กทรอนิกส์พื้นฐาน 3 (3-0-6)",
                    "LE241": "Basic Electronic Circuits and Devices"
                }
            },
            {
                "category": "วิชาเลือก",
                "subcategories": {
                    "วิชาเลือกด้านการออกแบบและพัฒนา": {
                        "วพ.311": "การพัฒนาระบบไมโครโปรเซสเซอร์ 3 (3-0-6)",
                        "CN311": "Microprocessor Systems Development",
                        "วพ.312": "การพัฒนาโปรแกรมคอมพิวเตอร์ประยุกต์ 3 (3-0-6)",
                        "CN312": "Computer Application Development",
                        "วพ.322": "การออกแบบเครือข่ายคอมพิวเตอร์ 3 (3-0-6)",
                        "CN322": "Computer Network Design",
                        "วพ.332": "การปรับแต่งคอมพิวเตอร์แม่ข่าย 3 (3-0-6)",
                        "CN332": "Computer Server Configuration"
                    }
                }
            },
            {
                "category": "รายวิชาอื่นๆ",
                "subcategories": {
                    "วพ.331": "ระบบปฏิบัติการ 3 (3-0-6)",
                    "CN331": "Operating Systems"
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 30,
        "details": [
            {
                "category": "วพ.320 การสื่อสารข้อมูลและเครือข่ายคอมพิวเตอร์ 1",
                "subcategories": {
                    "รหัสวิชา": "CN320",
                    "ชื่อภาษาอังกฤษ": "Data Communication and Computer Networks I",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "-",
                    "เนื้อหา": "องค์ประกอบของระบบเครือข่ายคอมพิวเตอร์และอินเทอร์เน็ต สถาปัตยกรรมแบบลำดับชั้น แบบจำลองการสื่อสารข้อมูลทีซีพีไอพี หน้าที่โพรโทคอล และเทคโนโลยีในชั้นของแอพพลิเคชัน ทรานสปอร์ต เน็ตเวอร์ค ดาต้าลิงค์"
                }
            },
            {
                "category": "วพ.321 การรักษาความปลอดภัยบนเครือข่ายคอมพิวเตอร์",
                "subcategories": {
                    "รหัสวิชา": "CN321",
                    "ชื่อภาษาอังกฤษ": "Computer Network Security",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.320",
                    "เนื้อหา": "แนวความคิดสำคัญๆ ในเรื่องความมั่นคงของระบบคอมพิวเตอร์ เช่น ผู้ไม่ประสงค์ดี โมเดลของภัยคุกคาม การจัดการความเสี่ยง การป้องกันภัยคุกคาม ปัจจัยทางด้านผู้ใช้งานระบบ วิธีการโจมตีระบบ การโมเดล การตรวจจับและการวัดความเสียหาย วิทยาการความมั่นคงในการสื่อสาร การออกแบบและอิมพลิเมนท์ระบบที่มีความมั่นคง การประยุกต์ใช้แนวความคิดพื้นฐานในการโจมตีและป้องกันระบบคอมพิวเตอร์ในรูปแบบต่างๆ เช่น ฟิชชิ่ง หนอนในระบบเครือข่าย บอตเน็ต ซอฟต์แวร์สอดแนม การจัดการลิขสิทธิ์ข้อมูลอิเล็กทรอนิกส์ การควบคุมการใช้ข้อมูลอิเล็กทรอนิกส์ด้วยฮาร์ดแวร์หรือซอฟต์แวร์บนอุปกรณ์ไบโอเมตริกซ์ การลงคะแนนเสียงเลือกตั้งทางอิเล็กทรอนิกส์ ไฟล์วอลล์ และวีพีเอ็น"
                }
            },
            {
                "category": "วพ.331 ระบบปฏิบัติการ",
                "subcategories": {
                    "รหัสวิชา": "CN331",
                    "ชื่อภาษาอังกฤษ": "Operating Systems",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "-",
                    "เนื้อหา": "การออกแบบและการสร้างระบบปฏิบัติการคอมพิวเตอร์ องค์ประกอบของระบบปฏิบัติการ การจัดการโปรเซส การประสานเวลาของโปรเซส การติดต่อระหว่างโปรเซส การจัดการหน่วยความจำ หน่วยความจำเสมือน การจัดการอินเทอร์รัพต์ การจัดการและการกำหนดลำดับกระบวนการทำงานของตัวประมวลผล การจัดการอุปกรณ์ การจัดการอินพุตเอาท์พุต ระบบแฟ้ม"
                }
            },
            {
                "category": "กลุ่มฮาร์ดแวร์และสถาปัตยกรรมคอมพิวเตอร์",
                "subcategories": {
                    "วพ.210": {
                        "ชื่อวิชา": "การออกแบบวงจรดิจิตอลทางวิศวกรรมคอมพิวเตอร์",
                        "รหัสวิชา": "CN210",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "-",
                        "เนื้อหา": "ระบบจำนวน รหัส พีชคณิตบูลีน โลจิกเกต หลักในการออกแบบวงจรโลจิกแบบคอมไบเนชั่นนอลและแบบซีเควนเชียล (ทั้งวงจรซิงโครนัสและวงจรอะซิงโครนัส) สำหรับการสร้างเป็นวงจรจริงเริ่มตั้งแต่วงจรเกตพื้นฐานจนถึงการใช้อุปกรณ์พีแอลดี"
                    },
                    "วพ.211": {
                        "ชื่อวิชา": "การสังเคราะห์วงจรดิจิตอล",
                        "รหัสวิชา": "CN211",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้หรือศึกษาพร้อมกับ วพ.210",
                        "เนื้อหา": "ให้มีประสบการณ์และความชำนาญในการออกแบบวงจรและสร้างวงจรดิจิตอล โดยใช้อุปกรณ์มาตรฐานและอุปกรณ์สมัยใหม่ ตั้งแต่วงจรคอมไบเนชั่นนอลลอจิก จนถึงวงจรซิงโครนัสซีเควนเชียลลอจิก"
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 3,
        "details": [
            {
                "category": "สถานการณ์หรือการพัฒนาทางสังคมและวัฒนธรรม",
                "subcategories": {
                    "การเปลี่ยนแปลงทางสังคมในยุคปัจจุบัน": "การสื่อสารไร้ขีดพรมแดน, การใช้อุปกรณ์คอมพิวเตอร์ในรูปแบบต่าง ๆ",
                    "การพัฒนาระบบการสื่อสาร": "สามารถส่งข้อมูลด้วยความเร็วที่สูงเพียงพอต่อการใช้โปรแกรมประยุกต์แบบสื่อประสมได้",
                    "ผลกระทบต่อสังคมและวัฒนธรรม": "ก่อให้เกิดการเปลี่ยนแปลงวิถีการดำเนินชีวิตทางสังคมและวัฒนธรรมของประเทศเป็นอย่างมาก",
                    "ความต้องการบุคลากร": "จำเป็นจะต้องใช้บุคลากรที่มีความเชี่ยวชาญทางด้านคอมพิวเตอร์และเทคโนโลยีสารสนเทศที่มีความเข้าใจในบริบทดังกล่าว"
                }
            },
            {
                "category": "ผลกระทบต่อการพัฒนาหลักสูตรและความเกี่ยวข้องกับพันธกิจของสถาบัน",
                "subcategories": {
                    "การพัฒนาหลักสูตร": {
                        "วัตถุประสงค์": "ปรับเนื้อหาวิชาต่าง ๆ ที่อยู่ในหลักสูตรให้ทันสมัย",
                        "เป้าหมาย": "ให้บัณฑิตที่จบการศึกษามีทักษะและขีดความสามารถระดับสูงตรงตามความต้องการของประเทศ",
                        "ความสามารถของบัณฑิต": "สามารถบริหารจัดการองค์ความรู้ทางด้านวิศวกรรมคอมพิวเตอร์และเทคโนโลยีสารสนเทศได้อย่างเป็นระบบ",
                        "คุณธรรมและจรรยาบรรณ": "บัณฑิตที่จบการศึกษาจะต้องมีคุณธรรมและจรรยาบรรณในวิชาชีพ"
                    },
                    "ความเกี่ยวข้องกับพันธกิจของสถาบัน": {
                        "การพัฒนาการเรียนรู้": "สนับสนุนให้เกิดการพัฒนากระบวนการเรียนรู้แก่นักศึกษา",
                        "การวิจัย": "สามารถต่อยอดไปสู่งานวิจัย",
                        "การบริการวิชาการ": "สนับสนุนการให้บริการวิชาการต่อสังคม",
                        "ความร่วมมือ": "มุ่งไปสู่การเสริมสร้างความร่วมมือระหว่างสถาบันการศึกษากับภาคอุตสาหกรรม"
                    }
                }
            },
            {
                "category": "ความสัมพันธ์กับหลักสูตรอื่นที่เปิดสอนในคณะ/ภาควิชา/หลักสูตรอื่นของสถาบัน",
                "subcategories": {
                    "กลุ่มวิชา/รายวิชาในหลักสูตรนี้ที่เปิดสอนโดยคณะหรือหลักสูตรอื่น": {
                        "รายวิชาที่จัดสอนโดยคณะอื่น": [
                            "มธ.100 พลเมืองกับความรับผิดชอบต่อสังคม",
                            "มธ.110 สหวิทยาการมนุษยศาสตร์",
                            "มธ.120 สหวิทยาการสังคมศาสตร์",
                            "มธ.130 สหวิทยาการวิทยาศาสตร์และเทคโนโลยี",
                            "ท.161 การใช้ภาษาไทย"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 11,
        "details": [
            {
                "category": "วิชาเฉพาะด้าน",
                "subcategories": {
                    "หน่วยกิตรวม": "64 หน่วยกิต",
                    "กลุ่มเทคโนโลยีเพื่องานประยุกต์": {
                        "หน่วยกิตรวม": "9 หน่วยกิต",
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "วพ.330",
                                "ชื่อวิชา": "ระบบฐานข้อมูล",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อภาษาอังกฤษ": "Database Systems"
                            },
                            {
                                "รหัสวิชา": "วพ.350",
                                "ชื่อวิชา": "ปัญญาประดิษฐ์",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อภาษาอังกฤษ": "Artificial Intelligence"
                            },
                            {
                                "รหัสวิชา": "วฟ.210",
                                "ชื่อวิชา": "สัญญาณและระบบ",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อภาษาอังกฤษ": "Signals and Systems"
                            }
                        ]
                    },
                    "กลุ่มเทคโนโลยีและวิธีการทางซอฟต์แวร์": {
                        "หน่วยกิตรวม": "15 หน่วยกิต",
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "วพ.201",
                                "ชื่อวิชา": "การโปรแกรมเชิงวัตถุ",
                                "หน่วยกิต": "4 (4-0-8)",
                                "ชื่อภาษาอังกฤษ": "Object-Oriented Programming"
                            },
                            {
                                "รหัสวิชา": "วพ.300",
                                "ชื่อวิชา": "การฝึกฝนการโปรแกรม 1",
                                "หน่วยกิต": "1 (0-3-0)",
                                "ชื่อภาษาอังกฤษ": "Programming Practice I"
                            },
                            {
                                "รหัสวิชา": "วพ.302",
                                "ชื่อวิชา": "การฝึกฝนการโปรแกรม 2",
                                "หน่วยกิต": "1 (0-3-0)",
                                "ชื่อภาษาอังกฤษ": "Programming Practice II"
                            },
                            {
                                "รหัสวิชา": "วพ.340",
                                "ชื่อวิชา": "วิศวกรรมซอฟต์แวร์",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อภาษาอังกฤษ": "Software Engineering"
                            },
                            {
                                "รหัสวิชา": "วพ.341",
                                "ชื่อวิชา": "การวิเคราะห์และออกแบบโปรแกรมเชิงวัตถุ",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อภาษาอังกฤษ": "Object-Oriented Analysis and Design"
                            },
                            {
                                "รหัสวิชา": "วพ.342",
                                "ชื่อวิชา": "การพัฒนาโปรแกรมประยุกต์บนเว็บ",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อภาษาอังกฤษ": "Web Application Development"
                            }
                        ]
                    },
                    "กลุ่มโครงสร้างพื้นฐานของระบบ": {
                        "หน่วยกิตรวม": "21 หน่วยกิต",
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "วพ.200",
                                "ชื่อวิชา": "คณิตศาสตร์แบบไม่ต่อเนื่อง",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อภาษาอังกฤษ": "Discrete Mathematics"
                            },
                            {
                                "รหัสวิชา": "วพ.202",
                                "ชื่อวิชา": "โครงสร้างข้อมูลและขั้นตอนวิธี 1",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อภาษาอังกฤษ": "Data Structures and Algorithms I"
                            },
                            {
                                "รหัสวิชา": "วพ.260",
                                "ชื่อวิชา": "ทฤษฏีความน่าจะเป็นและกระบวนการสุ่มทางวิศวกรรมคอมพิวเตอร์",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อภาษาอังกฤษ": "Probability Theory and Random Processes for Computer Engineering"
                            },
                            {
                                "รหัสวิชา": "วพ.301",
                                "ชื่อวิชา": "โครงสร้างข้อมูลและขั้นตอนวิธี 2",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อภาษาอังกฤษ": "Data Structures and Algorithms II"
                            },
                            {
                                "รหัสวิชา": "วพ.320",
                                "ชื่อวิชา": "การสื่อสารข้อมูลและเครือข่ายคอมพิวเตอร์ 1",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อภาษาอังกฤษ": "Data Communication and Computer Networks I"
                            },
                            {
                                "รหัสวิชา": "วพ.321",
                                "ชื่อวิชา": "การรักษาความปลอดภัยบนเครือข่ายคอมพิวเตอร์",
                                "หน่วยกิต": "3 (3-0-6)",
                                "ชื่อภาษาอังกฤษ": "Computer Network Security"
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 50,
        "details": [
            {
                "category": "วพ.312 การพัฒนาโปรแกรมคอมพิวเตอร์ประยุกต์",
                "subcategories": {
                    "Course_Code": "CN312",
                    "Course_Name_EN": "Computer Application Development",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of TU156",
                    "Description": "Development of computer programming in various applications such as user interface programming, communication port programming, external hardware interfacing, data acquisition."
                }
            },
            {
                "category": "วพ.322 การออกแบบเครือข่ายคอมพิวเตอร์",
                "subcategories": {
                    "Course_Code": "CN322",
                    "Course_Name_EN": "Computer Network Design",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of or taking CN320 in the same semester",
                    "Description": "Fundamental concepts for network configuration and design. Topics include fundamentals of TCP/IP network, packet capture and monitoring, operation with networking equipments such as router, IP routing, virtual LAN, IP access control, network address translation and basic network design."
                }
            },
            {
                "category": "วพ.332 การปรับแต่งคอมพิวเตอร์แม่ข่าย",
                "subcategories": {
                    "Course_Code": "CN332",
                    "Course_Name_EN": "Computer Server Configuration",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "-",
                    "Description": "Configuration of computer servers to provide various services. Topic includes domain name system, file transfer protocol server, Web server, e-mail server, and Database server."
                }
            },
            {
                "category": "วิชาเลือกเฉพาะรูปแบบ",
                "subcategories": {
                    "วพ.403": {
                        "Course_Code": "CN403",
                        "Course_Name_TH": "การฝึกงานทางวิศวกรรมคอมพิวเตอร์",
                        "Course_Name_EN": "Computer Engineering Internship",
                        "Credits": "0 (ไม่น้อยกว่า 240 ชั่วโมงต่อภาคการศึกษา)",
                        "Prerequisite": "Junior standing and pass english proficiency requirements of the Faculty",
                        "Description": "Practical training related to the field of computer engineering during the summer semester in a research laboratory, a government agency, a state-owned enterprise, a company, or a factory approved by the department with a total training period of at leat 240 hours. Students must submit training reports to the department after the training. This course is graded S/U."
                    },
                    "วพ.404": {
                        "Course_Code": "CN404",
                        "Course_Name_TH": "โครงงานทางวิศวกรรมคอมพิวเตอร์ 1",
                        "Course_Name_EN": "Computer Engineering Project I",
                        "Credits": "1(0-3-0)",
                        "Prerequisite": "(1) Senior standing and (2) have passed CN 201 and have earned at least 22 credits of CN courses and (3) have passed the English training program arranged by the Faculty or have obtained the score of at least 300 in the TU-GET exam.",
                        "Description": "Research and development project in computer engineering carried out by an individual student or a group of students under under supervision of one or more academic staff members. Students are required to submit reports and give an oral presentation on the project."
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 49,
        "details": [
            {
                "category": "วพ.310 การออกแบบระบบไมโครโปรเซสเซอร์",
                "subcategories": {
                    "รหัสวิชา": "วพ.310",
                    "ชื่อภาษาไทย": "การออกแบบระบบไมโครโปรเซสเซอร์",
                    "ชื่อภาษาอังกฤษ": "Microprocessor Systems Design",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "Have earned credits of CN 210 or LE 242",
                    "คำอธิบายรายวิชา": "Introduction to microprocessors. CPU architecture. System bus. Memory interface. Instruction set. Assembly language. Input/output interface using parallel ports. Serial communications. A/D and D/A conversions. C language for microprocessor. Programming techniques. Interrupts processing. Applications of microprocessors and microcontrollers."
                }
            },
            {
                "category": "วฟ.201 ปฏิบัติการพื้นฐานทางวิศวกรรมไฟฟ้า 1",
                "subcategories": {
                    "รหัสวิชา": "วฟ.201",
                    "ชื่อภาษาไทย": "ปฏิบัติการพื้นฐานทางวิศวกรรมไฟฟ้า 1",
                    "ชื่อภาษาอังกฤษ": "Basic Electrical Engineering Laboratory I",
                    "หน่วยกิต": "1(0-3-0)",
                    "วิชาบังคับก่อน": "Have earned credits of or taking LE240 in the same semester",
                    "คำอธิบายรายวิชา": "Laboratory to introduce students to basic equipments and measurements in electrical engineering."
                }
            },
            {
                "category": "วฟ.240 การวิเคราะห์วงจรไฟฟ้า",
                "subcategories": {
                    "รหัสวิชา": "วฟ.240",
                    "ชื่อภาษาไทย": "การวิเคราะห์วงจรไฟฟ้า",
                    "ชื่อภาษาอังกฤษ": "Electric Circuit Analysis",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "-",
                    "คำอธิบายรายวิชา": "Circuit element, node and mesh analysis; Thevenin and Norton equivalent circuits; capacitance and inductance. The first order and the second order circuits. AC sinusoidal steady-state responses; phasor diagram; three-phase circuits. Two-port networks. Network theorems."
                }
            },
            {
                "category": "วฟ.241 อุปกรณ์และวงจรอิเล็กทรอนิกส์พื้นฐาน",
                "subcategories": {
                    "รหัสวิชา": "วฟ.241",
                    "ชื่อภาษาไทย": "อุปกรณ์และวงจรอิเล็กทรอนิกส์พื้นฐาน",
                    "ชื่อภาษาอังกฤษ": "Basic Electronic Circuits and Devices",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "Have earned credits of LE240",
                    "คำอธิบายรายวิชา": "Diode: physical structure, characteristics and modes of operation; diode application circuits; DC power supply amplifiers; BJT and FET physical structure, characteristics and modes of operation; use as an amplifier and a switch; biasing; principle of small-signal analysis; models for 2- and 3-terminal devices; operational amplifier and its applications in linear and nonlinear circuits; introduction to power electronics"
                }
            },
            {
                "category": "วิชาเลือก",
                "subcategories": {
                    "วิชาเลือกด้านการออกแบบและพัฒนา": {
                        "วพ.311 การพัฒนาระบบไมโครโปรเซสเซอร์": {
                            "รหัสวิชา": "วพ.311",
                            "ชื่อภาษาไทย": "การพัฒนาระบบไมโครโปรเซสเซอร์",
                            "ชื่อภาษาอังกฤษ": "Microprocessor Systems Development",
                            "หน่วยกิต": "3 (3-0-6)",
                            "วิชาบังคับก่อน": "Have earned credits of or taking CN310 in the same semester",
                            "คำอธิบายรายวิชา": "Development of various parts of microprocessor systems such as input/output interface, counter and timer, interrupt processing, serial communication, A/D and D/A conversions."
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 57,
        "details": [
            {
                "category": "Course Information",
                "subcategories": {
                    "Course_Code": "วฟ.487",
                    "Course_Name_Thai": "โครงข่ายประสาทและระบบฟัซซี่",
                    "Course_Name_English": "Neural Networks and Fuzzy Systems",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of LE200",
                    "Description": "Theory and applications of fuzzy systems and neural networks. Adaptive fuzzy systems. Neuron structure and dynamics. Unsupervised and supervised learning."
                }
            },
            {
                "category": "Field Experience",
                "subcategories": {
                    "Description": "Students can choose between internship and cooperative education for field experience",
                    "Learning_Outcomes": {
                        "Skill_1": "Practical skills from workplace and understanding of theoretical knowledge",
                        "Skill_2": "Integration of knowledge to solve industrial problems",
                        "Skill_3": "Interpersonal skills and teamwork",
                        "Skill_4": "Discipline, punctuality, and adaptability to workplace culture",
                        "Skill_5": "Confidence in expressing ideas and applying creativity"
                    },
                    "Timing": {
                        "Internship": "Summer semester of 3rd year",
                        "Cooperative_Education": "2nd semester of 4th year"
                    },
                    "Schedule": {
                        "Internship": "Full-time during summer semester",
                        "Cooperative_Education": "Full-time for 1 semester"
                    }
                }
            },
            {
                "category": "Project or Research Requirements",
                "subcategories": {
                    "Description": "Students can choose to take Computer Engineering Project 1 and 2",
                    "Learning_Outcomes": "Students learn problem-solving processes and development of new knowledge, with testing, verification, and ability to write a thesis",
                    "Timing": "1st and 2nd semesters of 4th year",
                    "Credits": {
                        "Project_1": "1 credit",
                        "Project_2": "2 credits"
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 9,
        "details": [
            {
                "category": "หมวดวิทยาศาสตร์และคณิตศาสตร์",
                "subcategories": {
                    "วิทยาศาสตร์_บังคับ": {
                        "รายวิชา": "มธ.130 สหวิทยาการวิทยาศาสตร์และเทคโนโลยี",
                        "หน่วยกิต": "2 (2-0-4)",
                        "รหัสวิชาภาษาอังกฤษ": "TU130 Integrated Science and Technology"
                    },
                    "คณิตศาสตร์หรือคอมพิวเตอร์_บังคับ": {
                        "รายวิชา": "มธ.156 คอมพิวเตอร์และการเขียนโปรแกรมเบื้องต้น",
                        "หน่วยกิต": "3 (3-0-6)",
                        "รหัสวิชาภาษาอังกฤษ": "TU156 Introduction to Computer and Programming"
                    }
                }
            },
            {
                "category": "หมวดภาษา",
                "subcategories": {
                    "ภาษาไทย": {
                        "รายวิชา": "ท.161 การใช้ภาษาไทย",
                        "หน่วยกิต": "3 (3-0-6)",
                        "รหัสวิชาภาษาอังกฤษ": "TH161 Thai Usage"
                    },
                    "ภาษาอังกฤษ": {
                        "รายวิชา_1": {
                            "ชื่อวิชา": "สษ.070 ภาษาอังกฤษพื้นฐาน 1",
                            "หน่วยกิต": "0 (3-0-6)",
                            "รหัสวิชาภาษาอังกฤษ": "EL070 English Course 1"
                        },
                        "รายวิชา_2": {
                            "ชื่อวิชา": "สษ.171 ภาษาอังกฤษพื้นฐาน 2",
                            "หน่วยกิต": "3 (3-0-6)",
                            "รหัสวิชาภาษาอังกฤษ": "EL171 English Course 2"
                        },
                        "รายวิชา_3": {
                            "ชื่อวิชา": "สษ.172 ภาษาอังกฤษพื้นฐาน 3",
                            "หน่วยกิต": "3 (3-0-6)",
                            "รหัสวิชาภาษาอังกฤษ": "EL172 English Course 3"
                        }
                    }
                }
            },
            {
                "category": "ส่วนที่ 2",
                "subcategories": {
                    "บังคับ": {
                        "จำนวนวิชา": "3",
                        "หน่วยกิตรวม": "7",
                        "รายวิชา_1": {
                            "ชื่อวิชา": "วท.123 เคมีพื้นฐาน",
                            "หน่วยกิต": "3 (3-0-6)",
                            "รหัสวิชาภาษาอังกฤษ": "SC123 Fundamental Chemistry"
                        },
                        "รายวิชา_2": {
                            "ชื่อวิชา": "วท.173 ปฏิบัติการเคมีพื้นฐาน",
                            "หน่วยกิต": "1 (0-3-0)",
                            "รหัสวิชาภาษาอังกฤษ": "SC173 Fundamental Chemistry Laboratory"
                        },
                        "รายวิชา_3": {
                            "ชื่อวิชา": "สษ.202 ภาษาอังกฤษสำหรับการทำงาน",
                            "หน่วยกิต": "3 (3-0-6)",
                            "รหัสวิชาภาษาอังกฤษ": "EL202 English For Work"
                        }
                    },
                    "บังคับเลือก": {
                        "จำนวนวิชา": "1",
                        "หน่วยกิตขั้นต่ำ": "2",
                        "รายวิชา_1": {
                            "ชื่อวิชา": "วค.106 ความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน",
                            "หน่วยกิต": "3 (3-0-6)",
                            "รหัสวิชาภาษาอังกฤษ": "AE106 Sustainability of Natural Resources and Energy"
                        },
                        "รายวิชา_2": {
                            "ชื่อวิชา": "วย.106 เทคนิคในการสื่อสารและการนำเสนอ",
                            "หน่วยกิต": "2 (2-0-4)",
                            "รหัสวิชาภาษาอังกฤษ": "CE106 Communication and Presentation Technique"
                        },
                        "รายวิชา_3": {
                            "ชื่อวิชา": "น.209 หลักกฎหมายแพ่งและพาณิชย์",
                            "หน่วยกิต": "3 (3-0-6)",
                            "รหัสวิชาภาษาอังกฤษ": "LA209 Civil and Commercial Law"
                        },
                        "รายวิชา_4": {
                            "ชื่อวิชา": "น.249 ความรู้เบื้องต้นเกี่ยวกับทรัพย์สินทางปัญญา",
                            "หน่วยกิต": "3 (3-0-6)",
                            "รหัสวิชาภาษาอังกฤษ": "LA249 Introduction to Intellectual Property"
                        },
                        "รายวิชา_5": {
                            "ชื่อวิชา": "พบ.291 ธุรกิจเบื้องต้น",
                            "หน่วยกิต": "3 (3-0-6)",
                            "รหัสวิชาภาษาอังกฤษ": "BA291 Introduction of Business"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 21,
        "details": [
            {
                "category": "วิชาศึกษาทั่วไป",
                "subcategories": {
                    "ส่วนที่_1": {
                        "มธ.100_พลเมืองกับความรับผิดชอบต่อสังคม": {
                            "รหัสวิชา": "TU100",
                            "ชื่อวิชาภาษาอังกฤษ": "Civic Education",
                            "หน่วยกิต": "3(3-0-6)",
                            "คำอธิบายรายวิชา": "การเรียนรู้หลักการพื้นฐานของการปกครองในระบบประชาธิปไตย และการปกครองโดยกฎหมาย (The Rule of Law) เข้าใจความหมายของ 'พลเมือง' ในระบอบประชาธิปไตย ฝึกฝนให้นักศึกษาได้พัฒนาตนเองให้เป็น 'พลเมือง' ในระบอบประชาธิปไตยและให้มีความรับผิดชอบต่อสังคม โดยใช้วิธีการเรียนรู้โดยลงมือปฏิบัติ (Learning by doing)"
                        },
                        "มธ.110_สหวิทยาการมนุษยศาสตร์": {
                            "รหัสวิชา": "TU110",
                            "ชื่อวิชาภาษาอังกฤษ": "Integrated Humanities",
                            "หน่วยกิต": "2(2-0-4)",
                            "คำอธิบายรายวิชา": "ความเป็นมาของมนุษย์ในยุคต่างๆ ที่ได้สะท้อนความเชื่อ ความคิด การพัฒนาทางสติปัญญาสร้างสรรค์ของมนุษย์ ตลอดจนให้รู้จักมีวิธีการคิด วิเคราะห์และมองปัญหาต่าง ๆ ที่มนุษยชาติกำลังเผชิญอยู่ อาทิ ผลกระทบของการพัฒนาทางเทคโนโลยี ปัญหาความรุนแรง สงครามและวิกฤตต่าง ๆ ของโลกเพื่อที่เราจะสามารถดำเนินชีวิตต่อไปอย่างมีประสิทธิภาพ ท่ามกลางการเปลี่ยนแปลงของโลกนี้"
                        },
                        "มธ.120_สหวิทยาการสังคมศาสตร์": {
                            "รหัสวิชา": "TU120",
                            "ชื่อวิชาภาษาอังกฤษ": "Integrated Social Sciences",
                            "หน่วยกิต": "2(2-0-4)",
                            "คำอธิบายรายวิชา": "วิชาสหวิทยาการสังคมศาสตร์ มุ่งแสดงให้เห็นว่าวิชาสังคมศาสตร์มีความหมายต่อมนุษย์ โดยศึกษากำเนิดของสังคมศาสตร์กับโลกยุคสมัยใหม่ การแยกตัวของสังคมศาสตร์ออกจากวิทยาศาสตร์ การรับเอากระบวนทัศน์ (Paradigm) ของวิทยาศาสตร์มาใช้อธิบายปรากฏการณ์ทางสังคมศาสตร์ ศึกษาถึงศาสตร์ (Discipline) มโนทัศน์ (Concept) และทฤษฎีต่าง ๆ สำคัญ ๆ ทางสังคมศาสตร์ โดยชี้ให้เห็นถึงจุดแข็งและจุดอ่อนของสังคมศาสตร์ ศึกษาวิเคราะห์ปัญหาสังคมร่วมสมัยแบบต่าง ๆ โดยใช้ความรู้และมุมมองทางสังคมศาสตร์เป็นหลัก เพื่อให้เข้าใจและมองเป็นปัญหานั้น ๆ ทั้งในระดับปัจเจกบุคคลระดับกลุ่ม ระดับมหภาคทางสังคม ระดับสังคม ที่เป็นรัฐชาติและระดับสังคมที่รวมเป็นระบบโลก"
                        },
                        "มธ.130_สหวิทยาการวิทยาศาสตร์และเทคโนโลยี": {
                            "รหัสวิชา": "TU130",
                            "ชื่อวิชาภาษาอังกฤษ": "Integrated Sciences and Technology",
                            "หน่วยกิต": "2(2-0-4)",
                            "คำอธิบายรายวิชา": "แนวคิด ทฤษฎีปรัชญาพื้นฐาน และกฎเกณฑ์ทางวิทยาศาสตร์ วิวัฒนาการของวิทยาศาสตร์และเทคโนโลยีที่มีความสำคัญและมีส่วนเกี่ยวข้องต่อการดำเนินชีวิตในปัจจุบัน ผลกระทบระหว่างวิทยาศาสตร์เทคโนโลยีกับเศรษฐกิจ สังคม และสิ่งแวดล้อม และศึกษาประเด็นการถกเถียงที่สำคัญที่เกี่ยวข้องกับสถานการณ์ในปัจจุบัน รวมถึงจริยธรรม คุณธรรมของความเป็นมนุษย์"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 40,
        "details": [
            {
                "category": "Core Courses",
                "subcategories": {
                    "TU130": {
                        "course_code": "มธ.130",
                        "course_name_en": "Integrated Sciences and Technology",
                        "course_name_th": "สหวิทยาการวิทยาศาสตร์และเทคโนโลยี",
                        "credits": "2 (2-0-4)",
                        "description": "Study of basic concepts in science, scientific theory and philosophies. Standard methods for scientific investigations. Important evolutions of science and technology influencing human lives as well as the impacts of science and technology on economies, societies and environments. Current issues involving the impacts of science and technology on moral, ethics and human values."
                    },
                    "TU156": {
                        "course_code": "มธ.156",
                        "course_name_en": "Introduction to Computers and Programming",
                        "course_name_th": "คอมพิวเตอร์และการเขียนโปรแกรมเบื้องต้น",
                        "credits": "3 (3-0-6)",
                        "description": "Basic concepts of computer systems, electronic data processing concepts, system and application software, algorithms, flowcharts, data representation, program design and development methodology, problem solving using high-level language programming."
                    },
                    "TH161": {
                        "course_code": "ท.161",
                        "course_name_en": "Thai Usage",
                        "course_name_th": "การใช้ภาษาไทย",
                        "credits": "3 (3-0-6)",
                        "description": "Thai language usage skills: listening, reading, writing and speaking, with emphases on drawing the main idea, communicating knowledge, thoughts and composing properly."
                    }
                }
            },
            {
                "category": "Language Courses",
                "subcategories": {
                    "EL070": {
                        "course_code": "สษ.070",
                        "course_name_en": "English Course 1",
                        "course_name_th": "ภาษาอังกฤษพื้นฐาน 1",
                        "credits": "0 (3-0-6)",
                        "prerequisite": "Language Institute placement",
                        "description": "A non-credit course designed for those students with low English command and unable to enroll directly into English Foundation Course (The assessment criteria are 'S' for Satisfactory or 'U' for Unsatisfactory and will not be counted towards the students' total credits and GPA). A preparatory course designed to enable students to cope up with real English use of four basic integrated skills of listening, speaking, reading and writing."
                    },
                    "EL171": {
                        "course_code": "สษ.171",
                        "course_name_en": "English Course 2",
                        "course_name_th": "ภาษาอังกฤษพื้นฐาน 2",
                        "credits": "3 (3-0-6)",
                        "prerequisite": "Have earned credits of EL070 or Language Institute placement",
                        "description": "An intermediate English course designed to promote four integrated skills to develop students' English proficiency at a higher level."
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 54,
        "details": [
            {
                "category": "วพ.355 การประมวลผลภาษาธรรมชาติเชิงสถิติ",
                "subcategories": {
                    "รหัสวิชา": "CN355",
                    "ชื่อภาษาอังกฤษ": "Statistical Natural Language Processing",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "Have earned credits of CN260 or LE211",
                    "คำอธิบายรายวิชา": "A subfield of artificial intelligence and computational linguistics. Topics include the problems of automated generation and understanding of natural human languages. Techniques emerged in statistical methods for language technologies and natural language processing (NLP) are introduced. Topics include the source-channel paradigm from information theory, predictive language models, hidden Markov models, the EM algorithm, maximum entropy methods, and classification and regression techniques."
                }
            },
            {
                "category": "วพ.356 การประมวลผลสัญญาณเสียงพูด",
                "subcategories": {
                    "รหัสวิชา": "CN356",
                    "ชื่อภาษาอังกฤษ": "Speech Signal Processing",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "-",
                    "คำอธิบายรายวิชา": "This course covers the principles of digital speech processing. Review of digital signal processing. MATLAB functionality for speech processing. Fundamentals of speech production and perception. Basic techniques for digital speech processing including short-time energy, magnitude, autocorrelation, short-time Fourier analysis, spectrogram, homomorphic (convolutional) methods, and linear predictive methods. Speech estimation methods including speech/non-speech detection, voiced/unvoiced/non-speech segmentation/classification, pitch detection, formant estimation. Applications of speech signal processing including speech coding, speech synthesis, speech enhancement, and speech recognition/natural language processing."
                }
            },
            {
                "category": "วพ.408 หัวข้อพิเศษทางวิศวกรรมคอมพิวเตอร์ 1",
                "subcategories": {
                    "รหัสวิชา": "CN408",
                    "ชื่อภาษาอังกฤษ": "Special Topics in Computer Engineering I",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "Senior Standing or approval by instructor",
                    "คำอธิบายรายวิชา": "Topics of current interest and new developments in various fields in computer engineering."
                }
            },
            {
                "category": "วพ.409 หัวข้อพิเศษทางวิศวกรรมคอมพิวเตอร์ 2",
                "subcategories": {
                    "รหัสวิชา": "CN409",
                    "ชื่อภาษาอังกฤษ": "Special Topics in Computer Engineering II",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "Senior Standing or approval by instructor",
                    "คำอธิบายรายวิชา": "Topics of current interest and new developments in various fields in computer engineering."
                }
            },
            {
                "category": "วพ.413 การคำนวณแบบขนาน",
                "subcategories": {
                    "รหัสวิชา": "CN413",
                    "ชื่อภาษาอังกฤษ": "Parallel Computing",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "Have earned credits of CN202",
                    "คำอธิบายรายวิชา": "Techniques for the design and analysis of parallel algorithms and for programming on available parallel platforms. Principles of parallel algorithm design and different parallel programing models with extensive coverage of MPI, POSIX threads, Open MP, Open CL, and GPU. Parallel algorithms and applications: Sorting, Graph Algorithms."
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 43,
        "details": [
            {
                "category": "วิชาเฉพาะ",
                "subcategories": {
                    "วิชาแกน": {
                        "วิชาพื้นฐานทางคณิตศาสตร์และวิทยาศาสตร์": [
                            {
                                "รหัสวิชา": "วท.133",
                                "ชื่อวิชา": "ฟิสิกส์สำหรับวิศวกร 1",
                                "หน่วยกิต": "3 (3-0-6)",
                                "คำอธิบายรายวิชา": "Motion, force, gravity, collisions, rotational motion, bodies in equilibrium, elastic and fractures, fluids, oscillations, waves, sound and applications, heat and the kinetic theory of gases, the first and the second laws of thermodynamics."
                            },
                            {
                                "รหัสวิชา": "วท.134",
                                "ชื่อวิชา": "ฟิสิกส์สำหรับวิศวกร 2",
                                "หน่วยกิต": "3 (3-0-6)",
                                "วิชาบังคับก่อน": "Have taken SC133",
                                "คำอธิบายรายวิชา": "Electric charge and electric fieldsm, Gauss'law, electric potential, capacitance, dielectrics, electric current, DC circuits and devices, magnets and electromagnets, magnetic and Faraday's law, inductors, AC circuits, electromagnetic theory and applications, light, lenses and optical instruments,"
                            },
                            {
                                "รหัสวิชา": "วท.183",
                                "ชื่อวิชา": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 1",
                                "หน่วยกิต": "1 (0-3-0)",
                                "คำอธิบายรายวิชา": "Laboratory practices involving measurement and errors, force and motion, energy, momentum, waves and heat."
                            },
                            {
                                "รหัสวิชา": "วท.184",
                                "ชื่อวิชา": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 2",
                                "หน่วยกิต": "1 (0-3-0)",
                                "คำอธิบายรายวิชา": "Laboratory practices involving electro-magnetic fields, electric and instruments, optics and modern physics"
                            },
                            {
                                "รหัสวิชา": "ค.111",
                                "ชื่อวิชา": "แคลคูลัสพื้นฐาน",
                                "หน่วยกิต": "3 (3-0-6)",
                                "คำอธิบายรายวิชา": "The elecmentary number system and functions, calculus of one variable functions, limit, continuity, the derivative and its applications, antiderivatives, techniques of integrations and its applications, series, Taylor's Theorem and its applications",
                                "หมายเหตุ": "There no credit for students who studying or passed MA111 or MA216 or MA 218"
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 27,
        "details": [
            {
                "category": "วิชาพื้นฐานทางวิศวกรรม",
                "subcategories": {
                    "วอ.121_วัสดุวิศวกรรม_1": {
                        "รหัสวิชา": "วอ.121",
                        "ชื่อวิชา": "วัสดุวิศวกรรม 1",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "-",
                        "คำอธิบายรายวิชา": "สมบัติและโครงสร้างของวัสดุในงานวิศวกรรมประเภท โลหะ โลหะผสม เซรามิค พลาสติก ยาง ยางมะตอย ไม้ และคอนกรีต แผนภูมิสมดุล ลักษณะและการทดสอบสมบัติวัสดุ ความสัมพันธ์ระหว่างโครงสร้างทางจุลภาคและมหภาคกับสมบัติของวัสดุ กรรมวิธีการผลิตของวัสดุแบบต่างๆ ผลของกรรมวิธีทางความร้อนต่อโครงสร้างทางจุลภาคและสมบัติของวัสดุ"
                    }
                }
            },
            {
                "category": "วิชาเฉพาะด้าน",
                "subcategories": {
                    "กลุ่มเทคโนโลยีเพื่องานประยุกต์": {
                        "วพ.330_ระบบฐานข้อมูล": {
                            "รหัสวิชา": "วพ.330",
                            "ชื่อวิชา": "ระบบฐานข้อมูล",
                            "หน่วยกิต": "3(3-0-6)",
                            "วิชาบังคับก่อน": "-",
                            "คำอธิบายรายวิชา": "จุดมุ่งหมายของระบบฐานข้อมูล รูปแบบของข้อมูลในระดับต่าง ๆ ระบบฐานข้อมูลแบบเอนติตี้และความสัมพันธ์ ระบบฐานข้อมูลแบบความสัมพันธ์ ภาษาจัดการฐานข้อมูล การออกแบบฐานข้อมูล แบบความสัมพันธ์ทฤษฎีการปรับบรรทัดฐาน โครงสร้างของระบบการจัดเก็บแฟ้มข้อมูล การติดต่อ และการสอบถามเกี่ยวกับข้อมูล การควบคุมความถูกต้อง ระบบความปลอดภัยของข้อมูล ระบบฐานข้อมูล แบบกระจายและการออกแบบ ฐานข้อมูลแบบวัตถุวิสัย"
                        },
                        "วพ.350_ปัญญาประดิษฐ์": {
                            "รหัสวิชา": "วพ.350",
                            "ชื่อวิชา": "ปัญญาประดิษฐ์",
                            "หน่วยกิต": "3(3-0-6)",
                            "วิชาบังคับก่อน": "สอบได้ วพ.260 หรือ วฟ.211",
                            "คำอธิบายรายวิชา": "หลักการพื้นฐานและงานวิจัยที่เกี่ยวข้องในการสร้างความฉลาดเทียมให้กับสิ่งไม่มีชีวิต การแสดงแผนการอย่างง่าย กระบวนทัศน์การแก้ปัญหา การแพร่กระจายอย่างมีเงื่อนไข การเล่มเกม การเรียนรู้ของเครื่อง และกลวิธีในการค้นหา ซึ่งสามารถนำไปใช้งานจริงเช่น การแทนความรู้ การประมวลผลภาษาธรรมชาติ ระบบผู้เชี่ยวชาญ ทัศนศาสตร์คอมพิวเตอร์และวิทยาการหุ่นยนต์"
                        },
                        "วฟ.210_สัญญาณและระบบ": {
                            "รหัสวิชา": "วฟ.210",
                            "ชื่อวิชา": "สัญญาณและระบบ",
                            "หน่วยกิต": "3(3-0-6)",
                            "วิชาบังคับก่อน": "สอบได้ ค.111",
                            "คำอธิบายรายวิชา": "สัญญาณและระบบแบบต่อเนื่องทางเวลาและแบบไม่ต่อเนื่องทางเวลา ระบบเชิงเส้นไม่แปรเปลี่ยนตามเวลา การวิเคราะห์ระบบโดยวิธีการแปลงฟูเรียร์ วิธีการแปลงลาปลาซ และวิธีการแปลง Z การประยุกต์สัญญาณและระบบในงานทางวิศวกรรม การวิเคราะห์สัญญาณและระบบโดยเทคนิคแบบทันสมัย"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 10,
        "details": [
            {
                "category": "วิชาศึกษาทั่วไป",
                "subcategories": {
                    "ทม.201": "หลักการบริหาร 3 (3-0-6)",
                    "HR201": "Principles of Management",
                    "ศ.213": "เศรษฐศาสตร์จุลภาคเบื้องต้น 3 (3-0-6)",
                    "EC213": "Introductory Microeconomics"
                }
            },
            {
                "category": "วิชาเฉพาะ",
                "subcategories": {
                    "หน่วยกิตรวม": "109 หน่วยกิต",
                    "วิชาแกน": {
                        "หน่วยกิตรวม": "24 หน่วยกิต",
                        "วิชาพื้นฐานทางคณิตศาสตร์และวิทยาศาสตร์": {
                            "หน่วยกิตรวม": "17 หน่วยกิต",
                            "วิชา": {
                                "วท.133": {
                                    "ชื่อวิชา": "ฟิสิกส์สำหรับวิศวกร 1",
                                    "หน่วยกิต": "3 (3-0-6)"
                                },
                                "SC133": "Physics for Engineers I",
                                "วท.134": {
                                    "ชื่อวิชา": "ฟิสิกส์สำหรับวิศวกร 2",
                                    "หน่วยกิต": "3 (3-0-6)"
                                },
                                "SC134": "Physics for Engineers 2",
                                "วท.183": {
                                    "ชื่อวิชา": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 1",
                                    "หน่วยกิต": "1 (0-3-0)"
                                },
                                "SC183": "Physics for Engineers Laboratory I",
                                "วท.184": {
                                    "ชื่อวิชา": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 2",
                                    "หน่วยกิต": "1 (0-3-0)"
                                },
                                "SC184": "Physics for Engineers Laboratory II",
                                "ค.111": {
                                    "ชื่อวิชา": "แคลคูลัสพื้นฐาน",
                                    "หน่วยกิต": "3 (3-0-6)"
                                },
                                "MA111": "Fundamentals of Calculus",
                                "ค.112": {
                                    "ชื่อวิชา": "เรขาคณิตวิเคราะห์และแคลคูลัสประยุกต์",
                                    "หน่วยกิต": "3 (3-0-6)"
                                },
                                "MA112": "Analytic Geometry and Applied Calculus",
                                "ค.214": {
                                    "ชื่อวิชา": "สมการเชิงอนุพันธ์",
                                    "หน่วยกิต": "3 (3-0-6)"
                                },
                                "MA214": "Differential Equations"
                            }
                        },
                        "วิชาพื้นฐานทางวิศวกรรม": {
                            "หน่วยกิตรวม": "7 หน่วยกิต",
                            "วิชา": {
                                "วก.100": {
                                    "ชื่อวิชา": "กราฟิกวิศวกรรม",
                                    "หน่วยกิต": "3 (2-3-4)"
                                },
                                "ME100": "Engineering Graphics",
                                "วย.100": {
                                    "ชื่อวิชา": "จริยธรรมสำหรับวิศวกร",
                                    "หน่วยกิต": "0 (0-0-0)"
                                },
                                "CE100": "Ethics for Engineers",
                                "วย.101": {
                                    "ชื่อวิชา": "ความรู้เบื้องต้นทางวิชาชีพวิศวกรรมศาสตร์",
                                    "หน่วยกิต": "1 (1-0-2)"
                                },
                                "CE101": "Introduction to Engineering Profession",
                                "วอ.121": {
                                    "ชื่อวิชา": "วัสดุวิศวกรรม 1",
                                    "หน่วยกิต": "3 (3-0-6)"
                                },
                                "IE121": "Engineering Materials I"
                            }
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 14,
        "details": [
            {
                "category": "วิศวกรรมคอมพิวเตอร์",
                "subcategories": {
                    "วพ.343": {
                        "ชื่อไทย": "การพัฒนาแอพพลิเคชันแบบเคลื่อนที่",
                        "ชื่ออังกฤษ": "Mobile Application Development",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วพ.344": {
                        "ชื่อไทย": "การรักษาความปลอดภัยสำหรับโปรแกรมประยุกต์บนเว็บ",
                        "ชื่ออังกฤษ": "Web Application Security",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วพ.353": {
                        "ชื่อไทย": "การรู้จำรูปแบบ",
                        "ชื่ออังกฤษ": "Pattern Recognition",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วพ.355": {
                        "ชื่อไทย": "การประมวลผลภาษาธรรมชาติเชิงสถิติ",
                        "ชื่ออังกฤษ": "Statistical Natural Language Processing",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วพ.356": {
                        "ชื่อไทย": "การประมวลผลสัญญาณเสียงพูด",
                        "ชื่ออังกฤษ": "Speech Signal Processing",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วพ.408": {
                        "ชื่อไทย": "หัวข้อพิเศษทางวิศวกรรมคอมพิวเตอร์ 1",
                        "ชื่ออังกฤษ": "Special Topics in Computer Engineering I",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วพ.409": {
                        "ชื่อไทย": "หัวข้อพิเศษทางวิศวกรรมคอมพิวเตอร์ 2",
                        "ชื่ออังกฤษ": "Special Topics in Computer Engineering II",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วพ.413": {
                        "ชื่อไทย": "การคำนวณแบบขนาน",
                        "ชื่ออังกฤษ": "Parallel Computing",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วพ.414": {
                        "ชื่อไทย": "ระบบคอมพิวเตอร์แบบกระจาย",
                        "ชื่ออังกฤษ": "Distributed System",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วพ.415": {
                        "ชื่อไทย": "การพัฒนาระบบฝังตัว",
                        "ชื่ออังกฤษ": "Embedded System Development",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วพ.433": {
                        "ชื่อไทย": "ระบบทำงานแบบทันที",
                        "ชื่ออังกฤษ": "Real-Time Systems",
                        "หน่วยกิต": "3 (3-0-6)"
                    }
                }
            },
            {
                "category": "วิศวกรรมไฟฟ้า",
                "subcategories": {
                    "วฟ.320": {
                        "ชื่อไทย": "ทฤษฎีการสื่อสาร",
                        "ชื่ออังกฤษ": "Fundamentals of Communication Systems",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วฟ.340": {
                        "ชื่อไทย": "วงจรอิเล็กทรอนิกส์",
                        "ชื่ออังกฤษ": "Electronic Circuits",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วฟ.323": {
                        "ชื่อไทย": "การสื่อสารดิจิตอล",
                        "ชื่ออังกฤษ": "Digital Communications",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วฟ.314": {
                        "ชื่อไทย": "การประมวลผลสัญญาณดิจิตอล",
                        "ชื่ออังกฤษ": "Digital Signal Processing",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วฟ.415": {
                        "ชื่อไทย": "การประมวลผลภาพ",
                        "ชื่ออังกฤษ": "Digital Image Processing",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วฟ.455": {
                        "ชื่อไทย": "เทคโนโลยีฮาร์ดไดร์ฟและการผลิต",
                        "ชื่ออังกฤษ": "Hard Drive Technology and Manufacturing",
                        "หน่วยกิต": "3 (3-0-6)"
                    },
                    "วฟ.487": {
                        "ชื่อไทย": "โครงข่ายประสาทและระบบฟัซซี่",
                        "ชื่ออังกฤษ": "Neural Networks and Fuzzy Systems",
                        "หน่วยกิต": "3 (3-0-6)"
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 5,
        "details": [
            {
                "category": "รายวิชาที่จัดสอนโดยภาควิชาอื่นของคณะ",
                "subcategories": {
                    "วย.100": {
                        "ชื่อวิชา": "จริยธรรมสำหรับวิศวกร",
                        "ชื่อภาษาอังกฤษ": "Ethics for Engineers",
                        "หน่วยกิต": 0
                    },
                    "วย.101": {
                        "ชื่อวิชา": "ความรู้เบื้องต้นทางวิชาชีพวิศวกรรมศาสตร์",
                        "ชื่อภาษาอังกฤษ": "Introduction to Engineering Profession",
                        "หน่วยกิต": 1
                    },
                    "วย.106": {
                        "ชื่อวิชา": "เทคนิคในการสื่อสารและนำเสนอ",
                        "ชื่อภาษาอังกฤษ": "Communication and Presentation Technique",
                        "หน่วยกิต": 2
                    },
                    "วก.100": {
                        "ชื่อวิชา": "กราฟิกวิศวกรรม",
                        "ชื่อภาษาอังกฤษ": "Engineering Graphics",
                        "หน่วยกิต": 3
                    },
                    "วค.106": {
                        "ชื่อวิชา": "ความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน",
                        "ชื่อภาษาอังกฤษ": "Sustainability of Natural Resources and Energy",
                        "หน่วยกิต": 3
                    },
                    "วอ.121": {
                        "ชื่อวิชา": "วัสดุวิศวกรรม 1",
                        "ชื่อภาษาอังกฤษ": "Engineering Materials I",
                        "หน่วยกิต": 3
                    }
                }
            },
            {
                "category": "กลุ่มวิชา/รายวิชาในหลักสูตรที่เปิดสอนให้ภาควิชา/หลักสูตรอื่นที่ต้องมาเรียน",
                "subcategories": {
                    "มธ.156": {
                        "ชื่อวิชา": "คอมพิวเตอร์และการเขียนโปรแกรมเบื้องต้น",
                        "ชื่อภาษาอังกฤษ": "Introduction to Computers and Programming",
                        "หน่วยกิต": 3
                    }
                }
            },
            {
                "category": "การบริหารจัดการ",
                "subcategories": {
                    "คณะกรรมการประจำหลักสูตร": "ทำหน้าที่ประสานงานกับอาจารย์ผู้สอน ภาควิชา คณะและสาขาวิชาอื่นในด้านเนื้อหาวิชา กระบวนการจัดการเรียนการสอน และการประเมินผล",
                    "การควบคุมคุณภาพ": "ดูแลและควบคุมคุณภาพและการบริหารจัดการให้เป็นไปตามวัตถุประสงค์ของหลักสูตร"
                }
            },
            {
                "category": "ข้อมูลเฉพาะของหลักสูตร",
                "subcategories": {
                    "ปรัชญา": {
                        "เน้นการเรียน": "วิชาพื้นฐานทางวิศวกรรมคอมพิวเตอร์ทั้งในทางทฤษฎีและในการคิดออกแบบการประยุกต์ใช้งาน",
                        "โอกาสการเรียน": "เปิดโอกาสให้นักศึกษาได้เลือกเรียนในสาขาวิชาที่หลากหลายตามความต้องการ",
                        "เป้าหมาย": "ผลิตวิศวกรคอมพิวเตอร์ซึ่งถือเป็นวิชาชีพหนึ่งที่มีความสำคัญและมีบทบาทต่อสังคมดิจิตอลในปัจจุบัน",
                        "การส่งเสริม": "ส่งเสริมให้นักศึกษาศึกษาเรียนรู้เทคโนโลยีใหม่ๆ ด้วยตนเอง มีความยึดมั่นในจริยธรรม มีจรรยาบรรณของการเป็นวิศวกร และมีความรับผิดชอบต่อสังคมและสิ่งแวดล้อม",
                        "การต่อยอด": "สามารถต่อยอดองค์ความรู้ที่ได้รับในการทำวิจัยและการศึกษาขั้นสูงต่อไป"
                    },
                    "วัตถุประสงค์": {
                        "1": "เพื่อผลิตบัณฑิตที่มีความรู้ และความสามารถในการประกอบอาชีพทางด้านวิศวกรรมคอมพิวเตอร์ และสามารถติดต่อสื่อสารกับผู้อื่นได้เป็นอย่างดี",
                        "2": "เพื่อผลิตบัณฑิตที่มีทักษะ และความพร้อมในการรับการถ่ายทอดและพัฒนาเทคโนโลยีระดับสูง"
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 33,
        "details": [
            {
                "category": "วพ.404 โครงงานทางวิศวกรรมคอมพิวเตอร์ 1",
                "subcategories": {
                    "รหัสวิชา": "CN404",
                    "ชื่อวิชาภาษาอังกฤษ": "Computer Engineering Project I",
                    "หน่วยกิต": "1(0-3-0)",
                    "วิชาบังคับก่อน": "เป็นนักศึกษาชั้นปีที่ 4 ที่สอบได้ วพ.201 และมีหน่วยกิตสะสมในกลุ่มรหัสวิชา วพ. รวมไม่น้อยกว่า 22 หน่วยกิต และต้องผ่านการอบรมโครงการอบรมภาษาอังกฤษ ตามที่คณะวิศวกรรมศาสตร์กำหนด หรือได้รับคะแนน TU-GET ไม่ต่ำกว่า 300 คะแนน",
                    "คำอธิบายรายวิชา": "โครงงานวิจัยและพัฒนาทางด้านวิศวกรรมคอมพิวเตอร์ ซึ่งอาจจัดทำโดยนักศึกษาแต่ละคน หรือเป็นกลุ่ม ภายใต้การควบคุมดูแลของอาจารย์ที่ปรึกษาอย่างน้อยหนึ่งท่าน นักศึกษาต้องส่งรายงานและทำการนำเสนอในหัวข้อโครงงานนั้น"
                }
            },
            {
                "category": "วพ.405 โครงงานทางวิศวกรรมคอมพิวเตอร์ 2",
                "subcategories": {
                    "รหัสวิชา": "CN405",
                    "ชื่อวิชาภาษาอังกฤษ": "Computer Engineering Project II",
                    "หน่วยกิต": "2(0-6-0)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.404",
                    "คำอธิบายรายวิชา": "งานต่อเนื่องจากโครงงานทางวิศวกรรมคอมพิวเตอร์ 1 โดยดำเนินการต่อจนเสร็จสมบูรณ์ นักศึกษาจะต้องเขียนรายงานฉบับสมบูรณ์ที่สรุปการดำเนินงานทั้งหมด และนำเสนอผลการดำเนินงาน"
                }
            },
            {
                "category": "วพ.406 การเตรียมสหกิจศึกษาวิศวกรรมคอมพิวเตอร์",
                "subcategories": {
                    "รหัสวิชา": "CN406",
                    "ชื่อวิชาภาษาอังกฤษ": "Preparation for Co-operative Education in Computer Engineering",
                    "หน่วยกิต": "1(0-3-0)",
                    "วิชาบังคับก่อน": "เป็นนักศึกษาชั้นปีที่ 4 ที่สอบได้ วพ.201 และมีหน่วยกิตสะสมในกลุ่มรหัสวิชา วพ. รวมไม่น้อยกว่า 22 หน่วยกิต และต้องผ่านการอบรมโครงการอบรมภาษาอังกฤษ ตามที่คณะวิศวกรรมศาสตร์กำหนด หรือได้รับคะแนน TU-GET ไม่ต่ำกว่า 300 คะแนน",
                    "คำอธิบายรายวิชา": "นักศึกษาต้องปฏิบัติงานไม่น้อยกว่า 80 ชั่วโมงที่สถานประกอบการด้านวิศวกรรมคอมพิวเตอร์ภายใต้การควบคุมดูแลของผู้ควบคุมงานในสถานประกอบการและอาจารย์ที่ปรึกษา นักศึกษาจะต้องส่งรายงานและนำเสนอผลการปฏิบัติงาน"
                }
            },
            {
                "category": "วพ.407 สหกิจศึกษาวิศวกรรมคอมพิวเตอร์",
                "subcategories": {
                    "รหัสวิชา": "CN407",
                    "ชื่อวิชาภาษาอังกฤษ": "Co-operative Education in Computer Engineering",
                    "หน่วยกิต": "8 (ไม่น้อยกว่า 16 สัปดาห์ต่อภาคการศึกษา)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.406",
                    "คำอธิบายรายวิชา": "รายวิชาต่อเนื่องจากการเตรียมสหกิจศึกษาวิศวกรรมคอมพิวเตอร์ นักศึกษาต้องปฏิบัติงานไม่น้อยกว่า 560 ชั่วโมงที่สถานประกอบการด้านวิศวกรรมคอมพิวเตอร์ภายใต้การควบคุมดูแลของผู้ควบคุมงานในสถานประกอบการและอาจารย์ที่ปรึกษา นักศึกษาจะต้องส่งรายงานฉบับสมบูรณ์และทำการนำเสนอ"
                }
            },
            {
                "category": "วพ.304 ทฤษฎีการคำนวณ",
                "subcategories": {
                    "รหัสวิชา": "CN304",
                    "ชื่อวิชาภาษาอังกฤษ": "Theory of Computation",
                    "หน่วยกิต": "3(3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ วพ.200",
                    "คำอธิบายรายวิชา": "การคำนวณได้และรูปแบบการคำนวณ ภาษาปกติ ไวยากรณ์ปกติ นิพจน์ปกติ ทฤษฎีออโตมาตา การคำนวณเชิงไม่กำหนด ภาษาไม่พึ่งบริบท ไวยากรณ์ไม่พึ่งบริบท เครื่องทัวริง การคำนวณได้และไม่ได้ การตัดสินใจได้และไม่ได้ แนวคิดหลักของเชิร์ช รูปแบบการคำนวณอย่างอื่น"
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 48,
        "details": [
            {
                "category": "Computer Network Security",
                "subcategories": {
                    "Course_Code": "วพ.321 / CN321",
                    "Course_Name": "การรักษาความปลอดภัยบนเครือข่ายคอมพิวเตอร์ / Computer Network Security",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "Have earned credits of CN320",
                    "Course_Description": "Key concepts in computer security such as adversaries, threat models, risk management, defenses, and deterrents. Central themes of modern computer security such as human factors, attack creation and modeling, attack detection and measurement, cryptography and communications security, and system design and implementation. How fundamental concepts relate to real-life attacks and prevention mechanisms such as phishing, worms, botnets, spyware, digital rights management, trusted computing, biometrics, electronic voting, firewall and VPN."
                }
            },
            {
                "category": "Operating Systems",
                "subcategories": {
                    "Course_Code": "วพ.331 / CN331",
                    "Course_Name": "ระบบปฏิบัติการ / Operating Systems",
                    "Credits": "3(3-0-6)",
                    "Prerequisite": "-",
                    "Course_Description": "Design and implementation of operating systems. Process management. Process synchronization. Interprocess communication. Memory management. Virtual memory. Interrupt handling. Processor scheduling. Device management. Input/Output. File systems."
                }
            },
            {
                "category": "Hardware and Computer Architecture",
                "subcategories": {
                    "Group_Name": "กลุ่มฮาร์ดแวร์และสถาปัตยกรรมคอมพิวเตอร์",
                    "Courses": [
                        {
                            "Course_Code": "วพ.210 / CN210",
                            "Course_Name": "การออกแบบวงจรดิจิตอลทางวิศวกรรมคอมพิวเตอร์ / Digital Circuits Design in Computer Engineering",
                            "Credits": "3(3-0-6)",
                            "Prerequisite": "-",
                            "Course_Description": "Number representations. Codes. Boolean algebra. Logic gates. Combinational and sequential circuit design (both synchronous and asynchronous) for real digital circuits starting from basic gates up to Programmable Logic Devices (PLD)."
                        },
                        {
                            "Course_Code": "วพ.211 / CN211",
                            "Course_Name": "การสังเคราะห์วงจรดิจิตอล / Synthesis of Digital Circuits",
                            "Credits": "3(3-0-6)",
                            "Prerequisite": "Have earned credits of or taking CN 210 in the same semester",
                            "Course_Description": "The objective of this course is to let students get some experience in designing digital circuits by using standard and modern equipments starting from combinational logic up to synchronous sequential circuits."
                        },
                        {
                            "Course_Code": "วพ.212 / CN212",
                            "Course_Name": "สถาปัตยกรรมคอมพิวเตอร์ / Fundamentals of Computer Architecture",
                            "Credits": "3(3-0-6)",
                            "Prerequisite": "-",
                            "Course_Description": "A brief introduction to digital logic. Implementation of arithmetic logic unit. Binary numbers. Representation of negative numbers in a computer. Floating-point numbers. Basic machine instructors for a RISC-type computer. Assembly language programming. Implementations of basic computer under various clocking assumptions. Pipelining. Memory hierarchy: caches and virtual memory. Brief survey of input/output issues."
                        }
                    ]
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 1,
        "details": [
            {
                "category": "ข้อมูลทั่วไป",
                "subcategories": {
                    "รหัสและชื่อหลักสูตร": {
                        "ภาษาไทย": "หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์",
                        "ภาษาอังกฤษ": "Bachelor of Engineering Program in Computer Engineering"
                    },
                    "ชื่อปริญญาและสาขาวิชา": {
                        "ภาษาไทย": {
                            "ชื่อเต็ม": "วิศวกรรมศาสตรบัณฑิต (วิศวกรรมคอมพิวเตอร์)",
                            "ชื่อย่อ": "วศ.บ. (วิศวกรรมคอมพิวเตอร์)"
                        },
                        "ภาษาอังกฤษ": {
                            "ชื่อเต็ม": "Bachelor of Engineering (Computer Engineering)",
                            "ชื่อย่อ": "B. Eng. (Computer Engineering)"
                        }
                    },
                    "วิชาเอก": "ไม่มี",
                    "จำนวนหน่วยกิตที่เรียนตลอดหลักสูตร": "ไม่น้อยกว่า 145 หน่วยกิต",
                    "รูปแบบของหลักสูตร": {
                        "รูปแบบ": "เป็นหลักสูตรระดับปริญญา 4 ปี",
                        "ภาษาที่ใช้": "หลักสูตรจัดการศึกษาเป็นภาษาไทย",
                        "การรับเข้าศึกษา": "รับนักศึกษาไทย และนักศึกษาต่างชาติที่สามารถใช้ภาษาไทยได้เป็นอย่างดี",
                        "ความร่วมมือกับสถาบันอื่น": "เป็นหลักสูตรของสถาบันโดยเฉพาะ",
                        "การให้ปริญญาแก่ผู้สำเร็จการศึกษา": "ให้ปริญญาเพียงสาขาวิชาเดียว"
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 47,
        "details": [
            {
                "category": "กลุ่มโครงสร้างพื้นฐานของระบบ",
                "subcategories": {
                    "วพ.200 คณิตศาสตร์แบบไม่ต่อเนื่อง": {
                        "รหัสวิชา": "CN200",
                        "ชื่อภาษาอังกฤษ": "Discrete Mathematics",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "-",
                        "เนื้อหา": "Logic, Proof techniques, Basic set theory, Relations and functions, Mathematical induction, Countability and counting arguments, Permutations and combinations, Inclusion-exclusion principle, Elementary finite probability, Topics in graph theory: isomorphism, planarity, circuits, trees, and directed graphs"
                    },
                    "วพ.202 โครงสร้างข้อมูลและขั้นตอนวิธี 1": {
                        "รหัสวิชา": "CN202",
                        "ชื่อภาษาอังกฤษ": "Data Structures and Algorithms I",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "Have earned credits of CN 201",
                        "เนื้อหา": "Introduction to algorithm analysis, Simple sorting algorithms: Bubble, Selection, and Insertion sorts, Abstract data types, Dictionaries, Searching techniques: linear and binary searches, Stacks and queues, Linked lists, Recursions, Binary search trees"
                    },
                    "วพ.260 ทฤษฎีความน่าจะเป็นและกระบวนการสุ่มทางวิศวกรรมคอมพิวเตอร์": {
                        "รหัสวิชา": "CN260",
                        "ชื่อภาษาอังกฤษ": "Probability Theory and Random Processes for Computer Engineering",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "Have earned credits of MA111",
                        "เนื้อหา": "Probability, Random variables, Statistics, Random processes, Counting, Independence, Conditioning, Expectation, Density functions, Distributions, Law of large numbers, Central limit theorem, Confidence intervals, Hypothesis testing, Statistical estimation, Stationary processes, Markov chains, Ergodicity, Entropy"
                    },
                    "วพ.301 โครงสร้างข้อมูลและขั้นตอนวิธี 2": {
                        "รหัสวิชา": "CN301",
                        "ชื่อภาษาอังกฤษ": "Data Structures and Algorithms II",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "Have earned credits of CN202",
                        "เนื้อหา": "Heaps and priority queues, Heapsort, Advanced sorting algorithms: Mergesort, Quicksort, Counting sort, Radix sort and Bucket sort, Balanced trees: AVL trees, 2-3-4 trees, Red-black trees and B-trees, Hash tables, Graphs"
                    },
                    "วพ.320 การสื่อสารข้อมูลและเครือข่ายคอมพิวเตอร์ 1": {
                        "รหัสวิชา": "CN320",
                        "ชื่อภาษาอังกฤษ": "Data Communication and Computer Networks I",
                        "หน่วยกิต": "3(3-0-6)",
                        "วิชาบังคับก่อน": "-",
                        "เนื้อหา": "Components of computer networks and Internet, Layered Architectures TCP/IP Models, Functions, protocols and technologies in application, transport, network, and data link layers"
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 22,
        "details": [
            {
                "category": "หมวดวิชาศึกษาทั่วไป",
                "subcategories": {
                    "มธ.156": {
                        "ชื่อวิชา": "คอมพิวเตอร์และการเขียนโปรแกรมเบื้องต้น",
                        "ชื่อภาษาอังกฤษ": "Introduction to Computers and Programming",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "หลักการพื้นฐานของระบบคอมพิวเตอร์ หลักการการประมวลผลข้อมูลอิเลคทรอนิกส์ ซอฟต์แวร์ระบบและซอฟต์แวร์ประยุกต์ขั้นตอนวิธี ผังงาน การแทนข้อมูล วิธีการการออกแบบและพัฒนาโปรแกรม การแก้ปัญหาด้วยภาษาโปรแกรมระดับสูง"
                    },
                    "ท.161": {
                        "ชื่อวิชา": "การใช้ภาษาไทย",
                        "ชื่อภาษาอังกฤษ": "Thai Usage",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "หลักและฝึกทักษะการใช้ภาษาไทย ด้านการฟัง การอ่าน การเขียน และการพูด โดยเน้นการจับใจความสำคัญ การถ่ายทอดความรู้ ความคิด และการเขียน เรียบเรียงได้อย่างเหมาะสม"
                    },
                    "สษ.070": {
                        "ชื่อวิชา": "ภาษาอังกฤษพื้นฐาน 1",
                        "ชื่อภาษาอังกฤษ": "English Course 1",
                        "หน่วยกิต": "0 (3-0-6)",
                        "วิชาบังคับก่อน": "กำหนดจากการจัดระดับความรู้ภาษาอังกฤษของสถาบันภาษา",
                        "คำอธิบายรายวิชา": "เป็นวิชาเสริมที่มิได้คิดหน่วยกิต (Non-Credit) เพื่อช่วยนักศึกษาที่มีพื้นฐานความรู้ภาษาอังกฤษยังไม่สูงพอที่จะเข้าศึกษาในระดับพื้นฐานได้ (รายงานผลการศึกษาระบุเพียงใช้ได้ (S) หรือใช้ไม่ได้ (U) และจะไม่นำไปคิดรวมกับจำนวนหน่วยกิตทั้งหมด หรือคำนวณค่าระดับเฉลี่ย) หลักสูตรเบื้องต้นเพื่อเตรียมความพร้อมสำหรับนักศึกษา ฝึกทักษะภาษาอังกฤษที่ใช้ในชีวิตจริงทั้ง 4 ทักษะ คือ ฟัง พูด อ่าน เขียน"
                    },
                    "สษ.171": {
                        "ชื่อวิชา": "ภาษาอังกฤษพื้นฐาน 2",
                        "ชื่อภาษาอังกฤษ": "English Course 2",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ สษ.070 หรือ กำหนดจากการจัดระดับความรู้ภาษาอังกฤษของสถาบันภาษา",
                        "คำอธิบายรายวิชา": "หลักสูตรระดับกลางเพื่อส่งเสริมทักษะฟัง พูด อ่าน เขียน แบบบูรณาการ รวมทั้งเตรียมความพร้อมนักศึกษาสำหรับการเรียนภาษาอังกฤษในระดับที่สูงขึ้น"
                    },
                    "สษ.172": {
                        "ชื่อวิชา": "ภาษาอังกฤษพื้นฐาน 3",
                        "ชื่อภาษาอังกฤษ": "English Course 3",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ สษ. 171 หรือ กำหนดจากการจัดระดับความรู้ภาษาอังกฤษของสถาบันภาษา",
                        "คำอธิบายรายวิชา": "หลักสูตรระดับกลางสูง เพื่อส่งเสริมให้นักศึกษาใช้ทักษะภาษาอังกฤษอย่างบูรณาการในระดับที่ซับซ้อนกว่าในวิชาภาษาอังกฤษระดับกลาง โดยเน้นทักษะการพูดและการเขียน"
                    }
                }
            },
            {
                "category": "วิชาเฉพาะ",
                "subcategories": {
                    "บังคับ": {
                        "จำนวนวิชา": 3,
                        "หน่วยกิต": 7,
                        "รายวิชา": {
                            "วท.123": {
                                "ชื่อวิชา": "เคมีพื้นฐาน",
                                "ชื่อภาษาอังกฤษ": "Fundamental Chemistry",
                                "หน่วยกิต": "3 (3-0-6)",
                                "คำอธิบายรายวิชา": "โครงสร้างอะตอม ปริมาณสารสัมพันธ์ พันธะเคมี สมบัติธาตุเรพิเซนเททีฟและแทรนซิชัน แก๊ส ของเหลวและสารละลาย ของแข็ง อุณหพลศาสตร์ จลนพลศาสตร์ สมดุลเคมีและกรด-เบส เคมีไฟฟ้า เคมีอินทรีย์"
                            }
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 20,
        "details": [
            {
                "category": "โปรแกรมสำหรับนักศึกษา",
                "subcategories": {
                    "รูปแบบการเรียน": "กรณีเลือกเรียนรูปแบบที่ 2 วิชาสหกิจศึกษาวิศวกรรมคอมพิวเตอร์",
                    "ข้อกำหนด": "ศึกษาวิชาเลือกเฉพาะรูปแบบที่คณะกำหนด ไม่น้อยกว่า 6 หน่วยกิต"
                }
            },
            {
                "category": "ปีการศึกษาที่ 4",
                "subcategories": {
                    "ภาคเรียนที่ 1": {
                        "วิชา": [
                            {
                                "รหัส": "สษ.202",
                                "ชื่อ": "ภาษาอังกฤษสำหรับการทำงาน",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัส": "มธ.120",
                                "ชื่อ": "สหวิทยาการสังคมศาสตร์",
                                "หน่วยกิต": 2
                            },
                            {
                                "รหัส": "xx.xxx",
                                "ชื่อ": "วิชาบังคับเลือก ศึกษาทั่วไปส่วนที่ 2",
                                "หน่วยกิต": "ไม่น้อยกว่า 2"
                            },
                            {
                                "รหัส": "xx.xxx",
                                "ชื่อ": "วิชาเลือกเฉพาะรูปแบบ",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัส": "xx.xxx",
                                "ชื่อ": "วิชาเลือกเสรี",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัส": "xx.xxx",
                                "ชื่อ": "วิชาเลือกเสรี",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัส": "วพ.406",
                                "ชื่อ": "การเตรียมสหกิจศึกษาวิศวกรรมคอมพิวเตอร์",
                                "หน่วยกิต": 1
                            }
                        ],
                        "รวมหน่วยกิต": 17
                    },
                    "ภาคเรียนที่ 2": {
                        "วิชา": [
                            {
                                "รหัส": "วพ.407",
                                "ชื่อ": "สหกิจศึกษาวิศวกรรมคอมพิวเตอร์",
                                "หน่วยกิต": 8
                            }
                        ],
                        "รวมหน่วยกิต": 8,
                        "หมายเหตุ": "ในกรณีที่เลือกสหกิจศึกษา"
                    }
                }
            },
            {
                "category": "กลุ่มการเรียนรู้",
                "subcategories": {
                    "กลุ่ม_1": "กลุ่มการเรียนรู้ด้านพื้นฐานการเขียนโปรแกรม",
                    "กลุ่ม_2": "กลุ่มการเรียนรู้ด้านคณิตศาสตร์ทางคอมพิวเตอร์",
                    "กลุ่ม_3": "กลุ่มการเรียนรู้ด้านอิเล็กทรอนิกส์",
                    "กลุ่ม_4": "กลุ่มการเรียนรู้ด้านตรรกศาสตร์ดิจิทัล",
                    "กลุ่ม_5": "กลุ่มการเรียนรู้ด้านโครงสร้างข้อมูล และขั้นตอนวิธี",
                    "กลุ่ม_6": "กลุ่มการเรียนรู้ด้านโครงสร้าง และสถาปัตยกรรมคอมพิวเตอร์",
                    "กลุ่ม_7": "กลุ่มการเรียนรู้ด้านระบบปฏิบัติการ",
                    "กลุ่ม_8": "กลุ่มการเรียนรู้ด้านระบบฐานข้อมูล",
                    "กลุ่ม_9": "กลุ่มการเรียนรู้ด้านวิศวกรรมซอฟต์แวร์",
                    "กลุ่ม_10": "กลุ่มการเรียนรู้ด้านเครือข่ายคอมพิวเตอร์"
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 16,
        "details": [
            {
                "category": "แผนการศึกษา",
                "subcategories": {
                    "ปีการศึกษาที่1": {
                        "ภาคเรียนที่1": [
                            {
                                "รหัสวิชา": "วย.100",
                                "ชื่อวิชา": "จริยธรรมสำหรับวิศวกร",
                                "หน่วยกิต": 0
                            },
                            {
                                "รหัสวิชา": "วก.100",
                                "ชื่อวิชา": "กราฟิกวิศวกรรม",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "ค.111",
                                "ชื่อวิชา": "แคลคูลัสพื้นฐาน",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วท.133",
                                "ชื่อวิชา": "ฟิสิกส์สำหรับวิศวกร 1",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วท.183",
                                "ชื่อวิชา": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 1",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วท.123",
                                "ชื่อวิชา": "เคมีพื้นฐาน",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วท.173",
                                "ชื่อวิชา": "ปฏิบัติการเคมีพื้นฐาน",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "สษ.Xxx",
                                "ชื่อวิชา": "ภาษาอังกฤษพื้นฐาน",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "มธ.156",
                                "ชื่อวิชา": "คอมพิวเตอร์และการเขียนโปรแกรมเบื้องต้น",
                                "หน่วยกิต": 3,
                                "หมายเหตุ": "*1"
                            },
                            {
                                "รหัสวิชา": "วพ.300",
                                "ชื่อวิชา": "การฝึกฝนการโปรแกรม 1",
                                "หน่วยกิต": 1,
                                "หมายเหตุ": "*1"
                            }
                        ],
                        "ภาคเรียนที่2": [
                            {
                                "รหัสวิชา": "วย.101",
                                "ชื่อวิชา": "ความรู้เบื้องต้นทางวิชาชีพวิศวกรรมศาสตร์",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "วอ.121",
                                "ชื่อวิชา": "วัสดุวิศวกรรม 1",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "ค.112",
                                "ชื่อวิชา": "เรขาคณิตวิเคราะห์และแคลคูลัสประยุกต์",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วท.134",
                                "ชื่อวิชา": "ฟิสิกส์สำหรับวิศวกร 2",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วท.184",
                                "ชื่อวิชา": "ปฏิบัติการฟิสิกส์สำหรับวิศวกร 2",
                                "หน่วยกิต": 1
                            },
                            {
                                "รหัสวิชา": "สษ.Xxx",
                                "ชื่อวิชา": "ภาษาอังกฤษพื้นฐาน",
                                "หน่วยกิต": 3
                            },
                            {
                                "รหัสวิชา": "วพ.201",
                                "ชื่อวิชา": "การโปรแกรมเชิงวัตถุ",
                                "หน่วยกิต": 4,
                                "หมายเหตุ": "*1"
                            },
                            {
                                "รหัสวิชา": "วพ.302",
                                "ชื่อวิชา": "การฝึกฝนการโปรแกรม 2",
                                "หน่วยกิต": 1,
                                "หมายเหตุ": "*1"
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 18,
        "details": [
            {
                "category": "ปีการศึกษาที่3",
                "subcategories": {
                    "ภาคเรียนที่1": {
                        "หน่วยกิต": "20",
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "มธ.130",
                                "ชื่อวิชา": "สหวิทยาการวิทยาศาสตร์และเทคโนโลยี",
                                "หน่วยกิต": "2"
                            },
                            {
                                "รหัสวิชา": "วพ.3xx",
                                "ชื่อวิชา": "วิชาบังคับเลือกด้านการออกแบบและพัฒนา",
                                "หน่วยกิต": "3"
                            },
                            {
                                "รหัสวิชา": "วพ.310",
                                "ชื่อวิชา": "การออกแบบระบบไมโครโปรเซสเซอร์",
                                "หน่วยกิต": "3"
                            },
                            {
                                "รหัสวิชา": "วพ.320",
                                "ชื่อวิชา": "การสื่อสารข้อมูลและเครือข่ายคอมพิวเตอร์ 1",
                                "หน่วยกิต": "3"
                            },
                            {
                                "รหัสวิชา": "วพ.330",
                                "ชื่อวิชา": "ระบบฐานข้อมูล",
                                "หน่วยกิต": "3"
                            },
                            {
                                "รหัสวิชา": "วพ.340",
                                "ชื่อวิชา": "วิศวกรรมซอฟต์แวร์",
                                "หน่วยกิต": "3"
                            },
                            {
                                "รหัสวิชา": "วพ.342",
                                "ชื่อวิชา": "การพัฒนาโปรแกรมประยุกต์บนเว็บ",
                                "หน่วยกิต": "3"
                            }
                        ]
                    },
                    "ภาคเรียนที่2": {
                        "หน่วยกิต": "20",
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "มธ.110",
                                "ชื่อวิชา": "สหวิทยาการมนุษยศาสตร์",
                                "หน่วยกิต": "2"
                            },
                            {
                                "รหัสวิชา": "วพ.3xx",
                                "ชื่อวิชา": "วิชาบังคับเลือกด้านการออกแบบและพัฒนา",
                                "หน่วยกิต": "3"
                            },
                            {
                                "รหัสวิชา": "วพ.321",
                                "ชื่อวิชา": "การรักษาความปลอดภัยบนเครือข่ายคอมพิวเตอร์",
                                "หน่วยกิต": "3"
                            },
                            {
                                "รหัสวิชา": "วพ.331",
                                "ชื่อวิชา": "ระบบปฏิบัติการ",
                                "หน่วยกิต": "3"
                            },
                            {
                                "รหัสวิชา": "วพ.341",
                                "ชื่อวิชา": "การวิเคราะห์และออกแบบโปรแกรมเชิงวัตถุ",
                                "หน่วยกิต": "3"
                            },
                            {
                                "รหัสวิชา": "วพ.350",
                                "ชื่อวิชา": "ปัญญาประดิษฐ์",
                                "หน่วยกิต": "3"
                            },
                            {
                                "รหัสวิชา": "xx.xxx",
                                "ชื่อวิชา": "วิชาบังคับเลือกเฉพาะรูปแบบ",
                                "หน่วยกิต": "3"
                            }
                        ]
                    },
                    "ภาคฤดูร้อน": {
                        "หมายเหตุ": "ในกรณีที่เลือกเรียนรูปแบบที่1",
                        "ชื่อหมวด": "วิชาฝึกงาน/โครงงานทางด้านวิศวกรรมคอมพิวเตอร์",
                        "หน่วยกิต": "0",
                        "รายวิชา": [
                            {
                                "รหัสวิชา": "วพ.403",
                                "ชื่อวิชา": "การฝึกงานทางวิศวกรรมคอมพิวเตอร์",
                                "หน่วยกิต": "0"
                            }
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 2,
        "details": [
            {
                "category": "สถานภาพของหลักสูตรและการพิจารณาอนุมัติ/เห็นชอบหลักสูตร",
                "subcategories": {
                    "สถานภาพของหลักสูตร": {
                        "ประเภทหลักสูตร": "หลักสูตรปรับปรุง พ.ศ. 2556",
                        "ปรับปรุงจาก": "หลักสูตรวิศวกรรมศาสตรบัณฑิต สาขาวิชาวิศวกรรมคอมพิวเตอร์ พ.ศ. 2552",
                        "กำหนดเปิดสอน": "ภาคการศึกษาที่ 1 ปีการศึกษา 2556"
                    },
                    "การพิจารณาอนุมัติ/เห็นชอบหลักสูตร": [
                        {
                            "หน่วยงาน": "คณะกรรมการบริหารมหาวิทยาลัย",
                            "ครั้งที่": "18/2555",
                            "วันที่": "3 ธันวาคม 2555"
                        },
                        {
                            "หน่วยงาน": "คณะอนุกรรมการสภามหาวิทยาลัยด้านหลักสูตรและการจัดการศึกษา",
                            "ครั้งที่": "7/2555",
                            "วันที่": "4 ธันวาคม 2555"
                        },
                        {
                            "หน่วยงาน": "สภามหาวิทยาลัย",
                            "ครั้งที่": "12/2555",
                            "วันที่": "24 ธันวาคม 2555"
                        }
                    ]
                }
            },
            {
                "category": "ความพร้อมในการเผยแพร่หลักสูตรคุณภาพและมาตรฐาน",
                "subcategories": {
                    "ปีการศึกษาที่พร้อมเผยแพร่": "2558",
                    "มาตรฐาน": "กรอบมาตรฐานคุณวุฒิระดับปริญญาตรี สาขาวิศวกรรมศาสตร์"
                }
            },
            {
                "category": "อาชีพที่สามารถประกอบได้หลังสำเร็จการศึกษา",
                "subcategories": [
                    "วิศวกรคอมพิวเตอร์",
                    "นักวิชาการคอมพิวเตอร์",
                    "นักวิเคราะห์และออกแบบระบบงาน",
                    "นักเขียนโปรแกรมหรือผู้พัฒนาซอฟต์แวร์",
                    "ผู้ดูแลระบบเครือข่ายและเครื่องแม่ข่าย",
                    "ผู้จัดการโครงการทางด้านวิศวกรรมคอมพิวเตอร์หรือเทคโนโลยีสารสนเทศ",
                    "นักพัฒนาเว็บไซต์",
                    "ผู้จัดการซอฟต์แวร์",
                    "หัวหน้าศูนย์คอมพิวเตอร์หรือผู้บริหารหน่วยงานเทคโนโลยีสารสนเทศ",
                    "ตำแหน่งงานอื่น ๆ ที่มีการใช้คอมพิวเตอร์และเทคโนโลยีสารสนเทศ"
                ]
            },
            {
                "category": "สถานที่จัดการเรียนการสอน",
                "subcategories": {
                    "สถานที่": "คณะวิศวกรรมศาสตร์ มหาวิทยาลัยธรรมศาสตร์ ศูนย์รังสิต ปทุมธานี"
                }
            },
            {
                "category": "ความจำเป็นต้องนำมาพิจารณาในการวางแผนหลักสูตร",
                "subcategories": {
                    "สถานการณ์หรือการพัฒนาทางเศรษฐกิจ": {
                        "แผนพัฒนา": [
                            "แผนพัฒนาเศรษฐกิจและสังคมแห่งชาติฉบับที่ 11 (พ.ศ. 2555 – 2559)",
                            "กรอบนโยบายเทคโนโลยีสารสนเทศและการสื่อสารระยะ พ.ศ. 2554 – 2563 ของประเทศไทย (ICT 2020 Conceptual Framework)"
                        ],
                        "ความต้องการ": "บุคลากรที่มีคุณภาพทางด้านวิศวกรรมคอมพิวเตอร์และเทคโนโลยีสารสนเทศเป็นจำนวนมาก",
                        "เหตุผล": "เพื่อรองรับต่อการพัฒนาและขยายตัวทางเศรษฐกิจของประเทศ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://ece.engr.tu.ac.th/curriculums",
        "document": "Bachelor_of_Engineering_Program_in_Computer_Engineering_2556",
        "page": 58,
        "details": [
            {
                "category": "การเตรียมการ",
                "subcategories": {
                    "มอบหมายอาจารย์ที่ปรึกษา": "มอบหมายอาจารย์ที่ปรึกษาโครงงานให้นักศึกษาเป็นกลุ่ม ๆ ละประมาณ 1-2 คน พร้อมทั้งแต่งตั้งคณะกรรมการสอบโครงงาน",
                    "การให้คำปรึกษา": "อาจารย์ที่ปรึกษาให้คำปรึกษาในการเลือกหัวข้อ และกระบวนการศึกษาค้นคว้าและประเมินผล",
                    "จัดชั่วโมงให้คำปรึกษา": "จัดชั่วโมงการให้คำปรึกษาโครงงานวิจัยจากอาจารย์ที่ปรึกษาแต่ละท่าน",
                    "นำเสนอโครงร่างการวิจัย": "นักศึกษานำเสนอโครงร่างการวิจัยแบบปากเปล่าต่อคณะกรรมการสอบโครงงานเพื่อรับข้อเสนอแนะและประเมินผล",
                    "นำเสนอผลการศึกษา": "นักศึกษานำเสนอผลการศึกษาโครงงานวิจัยแบบปากเปล่าต่อคณะกรรมการสอบโครงงานเพื่อรับข้อเสนอแนะและประเมินผล",
                    "ส่งรูปเล่มรายงาน": "นักศึกษาส่งรูปเล่มรายงานวิจัยฉบับสมบูรณ์ต่ออาจารย์ที่ปรึกษาและคณะกรรมการโครงงาน"
                }
            },
            {
                "category": "กระบวนการประเมินผล",
                "subcategories": {
                    "กำหนดหัวข้อและเกณฑ์": "อาจารย์ที่ปรึกษาและนักศึกษาร่วมกันกำหนดหัวข้อและเกณฑ์การประเมินผลตามวัตถุประสงค์รายวิชา",
                    "นำเสนอผลการศึกษา": "นักศึกษานำเสนอผลการศึกษาและรับการประเมินโดยคณะกรรมการโครงงาน ซึ่งเข้าร่วมฟังการนำเสนอผลการศึกษา",
                    "รวบรวมคะแนน": "อาจารย์ประสานงานวิชาโครงงานนำคะแนนทุกส่วนเสนอขอความเห็นชอบจากอาจารย์ผู้รับผิดชอบหลักสูตร เพื่อนำผลการประเมินเสนอต่อคณะฯ"
                }
            },
            {
                "category": "หลักเกณฑ์ในการประเมินผลนักศึกษา",
                "subcategories": {
                    "กฎระเบียบการให้ระดับคะแนน": {
                        "การวัดผลทั่วไป": "เป็นไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ว่าด้วยการศึกษาชั้นปริญญาตรี พ.ศ. 2540 (แก้ไขเพิ่มเติมถึงปัจจุบัน ฉบับที่ 3 พ.ศ. 2555) โดยแบ่งเป็น 8 ระดับ",
                        "การวัดผลวิชาฝึกงาน": "วิชา วพ.403 การฝึกงานทางวิศวกรรมคอมพิวเตอร์ และวย.100 จริยธรรมสำหรับวิศวกร แบ่งเป็น 2 ระดับ คือ ระดับ S (ใช้ได้) และ U (ยังใช้ไม่ได้)"
                    },
                    "กระบวนการทวนสอบมาตรฐานผลสัมฤทธิ์": {
                        "ระบบการทวนสอบ": "กำหนดระบบการทวนสอบผลสัมฤทธิ์การเรียนรู้ของนักศึกษาเป็นส่วนหนึ่งของระบบการประกันคุณภาพภายใน",
                        "การทวนสอบระดับรายวิชา": "ให้นักศึกษาประเมินการเรียนการสอนในระดับรายวิชา",
                        "การทวนสอบระดับหลักสูตร": "มีระบบประกันคุณภาพภายใน ดำเนินการทวนสอบมาตรฐานผลการเรียนรู้และรายงานผล"
                    }
                }
            }
        ]
    }
]