[
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 41,
        "details": [
            {
                "category": "ทักษะในการวิเคราะห์เชิงตัวเลข การสื่อสาร และการใช้เทคโนโลยีสารสนเทศ",
                "subcategories": {
                    "ผลการเรียนรู้": {
                        "ข้อ_1": "มีความสามารถในการใช้เทคโนโลยีสารสนเทศ และสามารถประยุกต์ใช้ในการสื่อสารได้อย่างมีประสิทธิภาพ",
                        "ข้อ_2": "มีทักษะในการคิดคำนวณ",
                        "ข้อ_3": "มีทักษะในการคิดวิเคราะห์เชิงคณิตศาสตร์และสถิติ เก็บรวบรวมข้อมูลและนำเสนอข้อมูล"
                    },
                    "กลยุทธ์การสอน": {
                        "ข้อ_1": "บรรยาย/อภิปราย",
                        "ข้อ_2": "การจัดประสบการณ์การเรียนรู้จากสถานการณ์จริง",
                        "ข้อ_3": "การศึกษาค้นคว้าด้วยตนเอง",
                        "ข้อ_4": "การนำเสนอ/รายงานหน้าชั้นเรียน",
                        "ข้อ_5": "การนำเสนองานโดยใช้เทคโนโลยีสารสนเทศ และการสื่อสารที่หลากหลาย",
                        "ข้อ_6": "การฝึกฝนเทคนิค และทักษะด้านการคิดคำนวณ จากการยกตัวอย่าง",
                        "ข้อ_7": "การกำหนดสถานการณ์จำลองในการทำโครงการ",
                        "ข้อ_8": "การใช้กรณีศึกษาเชิงคณิตศาสตร์ สถิติ เก็บรวบรวมข้อมูล และการนำเสนอข้อมูล",
                        "ข้อ_9": "การทำวิจัย"
                    },
                    "กลยุทธ์การประเมินผลการเรียนรู้": {
                        "ข้อ_1": "การประเมินผลงาน/โครงการที่ได้รับมอบหมาย",
                        "ข้อ_2": "การประเมินทักษะการสื่อสาร การฟัง การพูด การอ่าน และการเขียน",
                        "ข้อ_3": "การนำเสนองาน/ทักษะความเข้าใจ",
                        "ข้อ_4": "การประเมินผลสัมฤทธิ์ในการสอบ",
                        "ข้อ_5": "การทำรายงาน/โครงงาน"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 19,
        "details": [
            {
                "category": "มธ.100 พลเมืองกับการลงมือแก้ปัญหา",
                "subcategories": {
                    "ทักษะการคิดเชิงคำนวณพื้นฐาน": "เพื่อแก้ปัญหาและพัฒนาโอกาสใหม่ทางสังคมและเศรษฐกิจ",
                    "การเข้าถึงและค้นหาสารสนเทศ": "อย่างมีประสิทธิภาพ",
                    "การประเมินความน่าเชื่อถือของสารสนเทศ": "รายละเอียดไม่ระบุ",
                    "การกลั่นกรองและจัดการสารสนเทศ": "อย่างเป็นระบบ",
                    "การใช้และจรรยาบรรณด้านดิจิทัล": "รายละเอียดไม่ระบุ",
                    "การสื่อสารออนไลน์": "อย่างมืออาชีพ"
                }
            },
            {
                "category": "มธ.131 มนุษย์กับวิทยาศาสตร์กายภาพ",
                "subcategories": {
                    "วิธีการทางวิทยาศาสตร์": "เพื่อแสวงหาความรู้และแก้ปัญหาในชีวิตประจำวัน",
                    "แนวคิดทฤษฎีและกฎเกณฑ์ทางวิทยาศาสตร์กายภาพ": "เน้นการประยุกต์ใช้เพื่อปรับปรุงคุณภาพชีวิต",
                    "ความรู้ทางฟิสิกส์": "เกี่ยวกับเทคโนโลยีการสื่อสารและการแพทย์",
                    "ความรู้ทางเคมี": "เพื่อเข้าใจและเลือกใช้สารเคมีรอบตัว",
                    "ความรู้พื้นฐานทางวิทยาศาสตร์กายภาพ": "เพื่อเข้าใจปรากฏการณ์ทางธรรมชาติในข่าว"
                }
            },
            {
                "category": "มธ.142 มนุษย์กับวิทยาศาสตร์ชีวภาพ",
                "subcategories": {
                    "ธรรมชาติและกำเนิดชีวิต": "รายละเอียดไม่ระบุ",
                    "วิวัฒนาการของสิ่งมีชีวิต": "รายละเอียดไม่ระบุ",
                    "พันธุกรรม": "รายละเอียดไม่ระบุ",
                    "การสืบพันธุ์": "รายละเอียดไม่ระบุ",
                    "พัฒนาการและความชราของมนุษย์": "รายละเอียดไม่ระบุ",
                    "การประยุกต์ใช้วิทยาศาสตร์ชีวภาพ": "ในด้านการเกษตร อุตสาหกรรม การแพทย์ และสิ่งแวดล้อม",
                    "ผลกระทบของเทคโนโลยีชีวภาพ": "ต่อคุณภาพชีวิตมนุษย์"
                }
            },
            {
                "category": "มธ.143 มนุษย์กับสิ่งแวดล้อม",
                "subcategories": {
                    "ระบบนิเวศ": "ธรรมชาติและมนุษย์สร้างขึ้น",
                    "วัฏจักรชีวธรณีเคมี": "รายละเอียดไม่ระบุ",
                    "ปฏิสัมพันธ์ระหว่างสังคมมนุษย์และสิ่งแวดล้อม": "ของโลก",
                    "ผลกระทบของวิทยาศาสตร์และเทคโนโลยี": "ต่อประชากรมนุษย์และระบบนิเวศ"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 29,
        "details": [
            {
                "category": "กลุ่มวิชาภาษาอาเซียน (ASEAN Language)",
                "subcategories": {
                    "ภาษาเกาหลี (Korean)": {
                        "อซ.171 ภาษาเกาหลี 1": {
                            "รหัสวิชา": "AS171",
                            "ชื่อวิชาภาษาอังกฤษ": "Korean 1",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คำอธิบายรายวิชา": "ภาษาเกาหลีเบื้องต้น เพื่อสร้างทักษะด้านการฟัง พูด อ่าน เขียน และโครงสร้างพื้นฐานของภาษาเกาหลี",
                            "คำอธิบายรายวิชาภาษาอังกฤษ": "Introduction to elementary Korean language to provide usage skills to listening, speaking, reading, writing and fundamental structures of Korean language"
                        },
                        "อซ.172 ภาษาเกาหลี 2": {
                            "รหัสวิชา": "AS172",
                            "ชื่อวิชาภาษาอังกฤษ": "Korean 2",
                            "หน่วยกิต": "3 (3-0-6)",
                            "วิชาบังคับก่อน": "สอบได้วิชา อซ. 171 หรือ กล.171",
                            "คำอธิบายรายวิชา": "ภาษาเกาหลีเบื้องต้นต่อเนื่องจากภาษาเกาหลี 1 เพื่อให้สามารถนำมาใช้ในชีวิตประจำวันได้",
                            "คำอธิบายรายวิชาภาษาอังกฤษ": "Studying elementary Korean language in continuation from Korean 1 to acquire basic usage skills of the language in daily life."
                        }
                    },
                    "ภาษาเขมร (Khmer)": {
                        "อซ.173 ภาษาเขมร 1": {
                            "รหัสวิชา": "AS173",
                            "ชื่อวิชาภาษาอังกฤษ": "Khmer 1",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คำอธิบายรายวิชา": "ภาษาเขมรเบื้องต้น เพื่อสร้างทักษะด้านการฟัง พูด อ่าน เขียน และโครงสร้างพื้นฐานของภาษาเขมร",
                            "คำอธิบายรายวิชาภาษาอังกฤษ": "Introduction to elementary Khmer language to provide usage skills to listening, speaking, reading, writing and fundamental structures of Khmer language"
                        },
                        "อซ.174 ภาษาเขมร 2": {
                            "รหัสวิชา": "AS174",
                            "ชื่อวิชาภาษาอังกฤษ": "Khmer 2",
                            "หน่วยกิต": "3 (3-0-6)",
                            "วิชาบังคับก่อน": "สอบได้วิชา อซ. 173",
                            "คำอธิบายรายวิชา": "ภาษาเขมรเบื้องต้นต่อเนื่องจากภาษาเขมร 1 เพื่อให้สามารถนำมาใช้ในชีวิตประจำวันได้",
                            "คำอธิบายรายวิชาภาษาอังกฤษ": "Studying elementary Khmer language in continuation from Khmer 1 to acquire basic usage skills of the language in daily life."
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 39,
        "details": [
            {
                "category": "ทักษะทางปัญญา",
                "subcategories": {
                    "ผลการเรียนรู้ด้านทักษะทางปัญญา": [
                        "สามารถค้นคว้าข้อมูลได้อย่างเป็นระบบ",
                        "สามารถวิเคราะห์ปัญหา ประเมินทางเลือก และเสนอแนะวิธีการแก้ไขปัญหาและผลการตัดสินใจได้อย่างเหมาะสม",
                        "มีความคิดริเริ่มอย่างสร้างสรรค์ และมีความคิดในเชิงบวก",
                        "มีความใฝ่รู้ ติดตามการเปลี่ยนแปลงเพื่อพัฒนาตนเองอย่างต่อเนื่อง"
                    ],
                    "กลยุทธ์การสอนที่ใช้ในการพัฒนาการเรียนรู้ด้านทักษะทางปัญญา": [
                        "การสอนที่เน้นผู้เรียน โดยใช้ปัญหาเป็นหลัก",
                        "กระตุ้นให้ผู้เรียนสรุปความรู้จากความคิดที่ได้เรียน",
                        "การระดมสมอง",
                        "การแสดงบทบาทสมมติ",
                        "จัดกิจกรรรมการเรียนการสอนให้นักศึกษาได้ฝึกวิเคราะห์",
                        "ปัญหา และเสนอแนวทางในการแก้ปัญหาอย่างน้อย 1 กิจกรรม/วิชา",
                        "การจัดการเรียนการสอนโดยใช้ปัญหาเป็นหลัก",
                        "กระบวนการเรียนการสอนแบบให้สัมผัสปัญหา (problem-based learning)",
                        "ลงมือปฏิบัติในการแก้ปัญหาด้วยการให้ทำโครงงาน (project-based learning)",
                        "จัดกิจกรรมส่งเสริมให้มีความคิดสร้างสรรค์",
                        "บรรยาย/อภิปราย",
                        "การแลกเปลี่ยนเรียนรู้ในทัศนะความคิดเชิงบวกในมุมมองของผู้เรียน และสังคม",
                        "การเปิดโอกาสให้มีการอภิปรายแสดงความคิดเห็น",
                        "การมอบหมายงาน",
                        "การศึกษาค้นคว้าด้วยตนเอง"
                    ],
                    "กลยุทธ์การประเมินผลการเรียนรู้ด้านทักษะทางปัญญา": [
                        "การประเมินการคิดวิเคราะห์ แก้ไขปัญหา",
                        "การจัดระบบความคิด",
                        "การประเมินจากการนำเสนอรายงาน/โครงงาน",
                        "การวิเคราะห์กรณีศึกษา",
                        "โครงงาน/ผลงาน",
                        "การทดสอบ/การสอบเกี่ยวกับระบบความคิด ความเชื่อมโยง และเหตุผล",
                        "การมีส่วนร่วมในการวิเคราะห์ปัญหาและการเสนอแนวทาง",
                        "การประเมินแบ่งออกเป็น 3 ระยะ โดยนักศึกษาประเมินตนเอง เพื่อน อาจารย์: ก่อนเรียน, ระหว่างเรียน"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 35,
        "details": [
            {
                "category": "วิชาพลศึกษา",
                "subcategories": {
                    "วฬ.220 เทนนิส": {
                        "ชื่อภาษาอังกฤษ": "SN220 Tennis",
                        "หน่วยกิต": "(0-2-1)",
                        "คำอธิบายรายวิชา": "ทักษะพื้นฐานสำหรับนักกีฬาเทนนิส สมรรถภาพทางกาย การบาดเจ็บและความปลอดภัย กฏ กติกา มรรยาท สำหรับนักกีฬาเทนนิส และการเก็บรักษาอุปกรณ์",
                        "คำอธิบายภาษาอังกฤษ": "basic skills for tennis athletes. Physical performance, injury and safety, rules, regulation and good habits for tennis athletes and equipment maintenance."
                    },
                    "วฬ.221 แบดมินตัน": {
                        "ชื่อภาษาอังกฤษ": "SN221 Badminton",
                        "หน่วยกิต": "(0-2-1)",
                        "คำอธิบายรายวิชา": "ทักษะพื้นฐานสำหรับนักกีฬาแบดมินตัน สมรรถภาพทางกาย การบาดเจ็บและความปลอดภัย กฏ กติกา มรรยาท สำหรับนักกีฬาแบดมินตัน และการเก็บรักษาอุปกรณ์",
                        "คำอธิบายภาษาอังกฤษ": "basic skills for badminton athletes. Physical performance, injury and safety, rules, regulation and good habits for badminton athletes and equipment maintenance."
                    },
                    "วฬ.222 เทเบิลเทนนิส": {
                        "ชื่อภาษาอังกฤษ": "SN222 Table Tennis",
                        "หน่วยกิต": "(0-2-1)",
                        "คำอธิบายรายวิชา": "ทักษะพื้นฐานสำหรับนักกีฬาเทเบิลเทนนิส สมรรถภาพทางกาย การบาดเจ็บและความปลอดภัย กฏ กติกา มรรยาท สำหรับนักกีฬาเทเบิลเทนนิส และการเก็บรักษาอุปกรณ์",
                        "คำอธิบายภาษาอังกฤษ": "basic skills for table tennis athletes. Physical performance, injury and safety, rules, regulation and good habits for table tennis athletes and equipment maintenance."
                    }
                }
            },
            {
                "category": "หมวดพัฒนานักศึกษาและการเสริมสร้างทักษะและประสบการณ์",
                "subcategories": {
                    "พท.107 การเจริญสติและฝึกสมาธิ": {
                        "ชื่อภาษาอังกฤษ": "PE107 Mindfulness and Meditation",
                        "หน่วยกิต": "(0-2-1)",
                        "คำอธิบายรายวิชา": "แนวทางในการเจริญสติและสมาธิ การฝึกจิตเพื่อการศึกษาและการดำรงอยู่อย่างมีประสิทธิภาพทั้งในมหาวิทยาลัยและในชีวิตประจำวัน",
                        "คำอธิบายภาษาอังกฤษ": "Path of creating mindfulness and meditation; Meditation for education and effective living both in the university and daily life."
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 38,
        "details": [
            {
                "category": "การประเมินผล",
                "subcategories": {
                    "การสะท้อนความคิดเห็น": "ประเมินโดยการสะท้อนความคิดเห็นของตนเองและผู้อื่น",
                    "แบบประเมิน": "ประเมินโดยใช้แบบประเมิน",
                    "บันทึกประสบการณ์": "นักศึกษาทำบันทึกประสบการณ์จากการเรียนในชั้นเรียน และประสบการณ์จากสังคม",
                    "การมีส่วนร่วมและการพัฒนาตนเอง": "การมีส่วนร่วมและการพัฒนาตนเองก่อนเรียน ระหว่างเรียน",
                    "ภาระงาน": "ประเมินจากภาระงานที่ได้รับมอบหมาย",
                    "ระยะเวลาส่งงาน": "ประเมินจากระยะเวลาในส่งงานตามกำหนด",
                    "การตรงต่อเวลา": "การตรงต่อเวลาในการเข้าชั้นเรียนและการส่งงานตามกำหนดระยะเวลา",
                    "การสังเกต": "ประเมินโดยใช้การสังเกต",
                    "การมีส่วนร่วมและพัฒนาตนเอง": "ประเมินการมีส่วนร่วมและการพัฒนาตนเอง"
                }
            },
            {
                "category": "ความรู้",
                "subcategories": {
                    "ผลการเรียนรู้ด้านความรู้": {
                        "ความรู้กว้างขวาง": "มีความรู้อย่างกว้างขวางในหลักการและทฤษฎีองค์ความรู้ที่เกี่ยวข้อง",
                        "การวิเคราะห์": "สามารถวิเคราะห์อย่างเป็นระบบ",
                        "การประยุกต์ใช้": "สามารถนำความรู้ หลักการ ทฤษฎีไปประยุกต์ใช้ได้อย่างเหมาะสม",
                        "การบูรณาการ": "สามารถบูรณาการความรู้และศาสตร์ต่างๆได้อย่างเหมาะสม"
                    },
                    "กลยุทธ์การสอน": {
                        "การบรรยาย/อภิปราย": "การบรรยาย/อภิปรายในการให้ความรู้ในทฤษฎีความรู้",
                        "การสอนแบบบูรณาการ": "การสอนแบบบูรณาการความรู้ของศาสตร์ต่างๆที่เกี่ยวข้องสัมพันธ์กัน",
                        "เทคโนโลยีการศึกษา": "การสอนโดยใช้เทคโนโลยีการศึกษา",
                        "แผนที่ความคิด": "การทำแผนที่ความคิด",
                        "การวิเคราะห์ปัญหา": "ให้มีการคิดวิเคราะห์หาสาเหตุของปัญหา/คิดวิธีแก้ปัญหา",
                        "การเรียนโดยใช้ปัญหาเป็นหลัก": "เน้นการสอน การเรียนโดยใช้ปัญหาเป็นหลัก",
                        "การทำรายงาน/โครงงาน": "การทำรายงาน/โครงงาน",
                        "การระดมสมอง": "การระดมสมองเพื่อการเรียนรู้ ตลอดจนการนำไปประยุกต์ใช้",
                        "การศึกษาด้วยตนเอง": "การศึกษาด้วยตนเองเกี่ยวกับความสัมพันธ์ของศาสตร์ต่างๆ"
                    },
                    "กลยุทธ์การประเมินผล": {
                        "รายงานและการนำเสนอ": "การทำรายงานและการนำเสนองาน",
                        "การสอบ": "การประเมินผลสัมฤทธิ์โดยการสอบ",
                        "การค้นคว้า": "การทำรายงาน/การค้นคว้า",
                        "การส่งงานและนำเสนอ": "การส่งงานและการนำเสนองาน",
                        "การวิเคราะห์กรณีศึกษา": "การนำเสนอรายงาน การวิเคราะห์กรณีศึกษา",
                        "แบบฝึกหัด": "แบบฝึกหัด",
                        "การประเมินผลสัมฤทธิ์": "การประเมินผลสัมฤทธิ์ โดยการสอบ การทำรายงาน",
                        "การประเมินแนวความคิดและความเข้าใจ": "ประเมินโดยการสอบ /แนวความคิด และความเข้าใจ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 26,
        "details": [
            {
                "category": "ภาษาญี่ปุ่น (Japanese)",
                "subcategories": {
                    "ญ.171 ภาษาญี่ปุ่นสำหรับผู้เริ่มต้น 1": {
                        "รหัสวิชา": "JP171",
                        "ชื่อภาษาอังกฤษ": "Japanese for Beginners 1",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "ศัพท์ประมาณ 500 คำ และอักษรคันจิในชีวิตประจำวันประมาณ 80 ตัว ทักษะการฟัง พูด อ่าน เขียนภาษาญี่ปุ่นขั้นพื้นฐานในชีวิตประจำวัน",
                        "คำอธิบายภาษาอังกฤษ": "To know approximately 500 words and 80 kanji letters, to develop the four basic skills listening, speaking, reading, and writing used in Japanese everyday life."
                    },
                    "ญ.172 ภาษาญี่ปุ่นสำหรับผู้เริ่มต้น 2": {
                        "รหัสวิชา": "JP172",
                        "ชื่อภาษาอังกฤษ": "Japanese for Beginners 2",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ ญ.171 หรือได้รับอนุมัติจากผู้บรรยาย",
                        "คำอธิบายรายวิชา": "ศัพท์ประมาณ 700 คำ และอักษรคันจิในชีวิตประจำวันประมาณ 100 ตัว ทักษะการฟัง พูด อ่าน เขียนในการสื่อสารข้อมูลในชีวิตประจำวัน",
                        "คำอธิบายภาษาอังกฤษ": "To know approximately 700 words and 100 kanji letters, to develop the four basic skills listening, speaking, reading, and writing used in Japanese everyday life.",
                        "Prerequisite": "have earned credits of JP171 or approval from the lecturer"
                    }
                }
            },
            {
                "category": "ภาษารัสเซีย (Russian)",
                "subcategories": {
                    "รซ.171 ภาษารัสเซีย 1": {
                        "รหัสวิชา": "RS171",
                        "ชื่อภาษาอังกฤษ": "Russian 1",
                        "หน่วยกิต": "3 (2-3-4)",
                        "คำอธิบายรายวิชา": "ศึกษาโครงสร้างพื้นฐานที่สำคัญของภาษารัสเซียโดยอาศัยการฝึกทักษะทั้ง 4 ได้แก่ ฟัง พูด อ่าน เขียน ในระดับต้นให้เชื่อมโยงประสานกัน โดยเน้นการออกเสียงและแนะนำหลักไวยากรณ์ (บรรยายและฝึกฝน 6 ชั่วโมงต่อสัปดาห์)",
                        "คำอธิบายภาษาอังกฤษ": "To understand the four basic skills--listening, speaking, reading, and writing-- at the beginner's level with an emphasis on phonetics and the introduction of fundamental grammatical structures. (Lecture and practice 6 hours per week)"
                    },
                    "รซ.172 ภาษารัสเซีย 2": {
                        "รหัสวิชา": "RS172",
                        "ชื่อภาษาอังกฤษ": "Russian 2",
                        "หน่วยกิต": "3 (2-3-4)",
                        "วิชาบังคับก่อน": "สอบได้ รซ. 171"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 25,
        "details": [
            {
                "category": "ภาษาจีน",
                "subcategories": {
                    "จน.172": {
                        "ชื่อวิชา": "ภาษาจีน 2",
                        "หน่วยกิต": "3 (2-3-4)",
                        "วิชาบังคับก่อน": "สอบได้ จน.171 หรือสอบผ่านการทดสอบ หรือได้รับอนุมัติจากผู้บรรยาย",
                        "คำอธิบายรายวิชา": "ศึกษาต่อจาก จน.171 โดยศึกษารูปประโยคที่ซับซ้อนขึ้น คำศัพท์ภาษาจีนที่เพิ่มขึ้นจาก จน.171 อีกไม่น้อยกว่า 450 คำ"
                    }
                }
            },
            {
                "category": "ภาษาฝรั่งเศส",
                "subcategories": {
                    "ฝ.070": {
                        "ชื่อวิชา": "ภาษาฝรั่งเศสเบื้องต้น",
                        "หน่วยกิต": "3 (2-3-4)",
                        "วิชาบังคับก่อน": "สำหรับนักศึกษาที่ศึกษาภาษาฝรั่งเศสเป็นวิชาเอกและวิชาโทที่ไม่มีพื้นความรู้ภาษาฝรั่งเศส หรือได้รับอนุมัติจากผู้บรรยาย (ไม่นับหน่วยกิต)",
                        "คำอธิบายรายวิชา": "การฟัง การพูด การอ่าน และการเขียนเพื่อการสื่อสารในบริบทและสถานที่ที่เกี่ยวข้องกับตนเอง ครอบครัว และบุคคลที่เกี่ยวข้องกับชีวิตประจำวัน (บรรยายและฝึกฝน 6 ชั่วโมงต่อสัปดาห์)"
                    },
                    "ฝ.171": {
                        "ชื่อวิชา": "ภาษาฝรั่งเศส 1",
                        "หน่วยกิต": "3 (2-3-4)",
                        "วิชาบังคับก่อน": "สอบผ่าน ฝ.070 ภาษาฝรั่งเศสเบื้องต้น (กรณีของนักศึกษาที่ไม่มีพื้นความรู้ภาษาฝรั่งเศส) หรือได้รับอนุมัติจากผู้บรรยาย",
                        "คำอธิบายรายวิชา": "การฟัง การพูด การอ่าน และการเขียนในบริบทและสถานที่ที่เกี่ยวข้องกับการสื่อสารเพื่อแลกเปลี่ยนและสอบถามข้อมูลโดยเน้นการมีปฏิสัมพันธ์กับผู้อื่น (บรรยายและฝึกฝน 6 ชั่วโมงต่อสัปดาห์)"
                    },
                    "ฝ.172": {
                        "ชื่อวิชา": "ภาษาฝรั่งเศส 2",
                        "หน่วยกิต": "3 (2-3-4)",
                        "วิชาบังคับก่อน": "สอบได้ ฝ.171 ภาษาฝรั่งเศส 1 หรือได้รับอนุมัติจากผู้บรรยาย",
                        "คำอธิบายรายวิชา": "การฟัง การพูด การอ่าน และการเขียน เพื่อสื่อสารแลกเปลี่ยนข้อมูลความคิดเห็น การบรรยายอารมณ์ความรู้สึก ในบริบทและสถานที่ที่เกี่ยวข้องกับชีวิตประจำวัน โดยเน้นระดับการสื่อสารโต้ตอบอย่างคล่องแคล่ว (บรรยายและฝึกฝน 6 ชั่วโมงต่อสัปดาห์)"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 42,
        "details": [
            {
                "category": "สรุปผลการเรียนรู้",
                "subcategories": {
                    "ด้านคุณธรรม จริยธรรม": {
                        "1": "มีความซื่อสัตย์สุจริต",
                        "2": "มีความเป็นธรรม",
                        "3": "มีความรับผิดชอบต่อตนเองและสังคม",
                        "4": "มีวินัย",
                        "5": "มีจริยธรรมและจรรยาบรรณในวิชาชีพ",
                        "6": "มีจิตอาสา"
                    },
                    "ด้านความรู้": {
                        "1": "มีความรู้อย่างกว้างขวางในหลักการและทฤษฎีองค์ความรู้ที่เกี่ยวข้อง",
                        "2": "สามารถวิเคราะห์อย่างเป็นระบบ",
                        "3": "สามารถนำความรู้ หลักการ ทฤษฎีไปประยุกต์ใช้ได้อย่างเหมาะสม",
                        "4": "สามารถบูรณาการความรู้และศาสตร์ต่างๆได้อย่างเหมาะสม"
                    },
                    "ด้านทักษะทางปัญญา": {
                        "1": "สามารถค้นคว้าข้อมูลได้อย่างเป็นระบบ",
                        "2": "สามารถวิเคราะห์ปัญหา ประเมินทางเลือก และเสนอแนะวิธีการแก้ไขปัญหาและผลการตัดสินใจได้อย่างเหมาะสม",
                        "3": "มีความคิดริเริ่มอย่างสร้างสรรค์ และมีความคิดในเชิงบวก",
                        "4": "มีความใฝ่รู้ ติดตามการเปลี่ยนแปลงเพื่อพัฒนาตนเองอย่างต่อเนื่อง"
                    },
                    "ด้านทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": {
                        "1": "รับฟังความคิดเห็นของผู้อื่นและยอมรับความแตกต่าง",
                        "2": "มีความเป็นผู้นำ และกล้าทำ กล้าแสดงออกในสิ่งที่ถูกต้อง",
                        "3": "มีความรับผิดชอบในงาน ในหน้าที่ที่ได้รับมอบหมาย",
                        "4": "มีวุฒิภาวะทางอารมณ์ มีความสามารถในการปรับตัว การควบคุมอารมณ์และความอดทน",
                        "5": "ใช้สิทธิเสรีภาพโดยไม่กระทบผู้อื่น และมีความเป็นพลเมืองดี"
                    },
                    "ด้านทักษะในการวิเคราะห์เชิงตัวเลข การสื่อสาร และการใช้เทคโนโลยีสารสนเทศ": {
                        "1": "มีความรู้ทักษะในการใช้ภาษาไทยและภาษาต่างประเทศ",
                        "2": "มีความสามารถในการใช้เทคโนโลยีสารสนเทศ และสามารถประยุกต์ใช้ในการสื่อสารได้อย่างมีประสิทธิภาพ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 36,
        "details": [
            {
                "category": "พท.240 งานอาสาสมัครกับการพัฒนาสังคม",
                "subcategories": {
                    "รหัสวิชา": "พท.240",
                    "ชื่อวิชาภาษาไทย": "งานอาสาสมัครกับการพัฒนาสังคม",
                    "ชื่อวิชาภาษาอังกฤษ": "Volunteerism and social development",
                    "หน่วยกิต": "3 (2-2-5)",
                    "คำอธิบายรายวิชาภาษาไทย": "ทักษะในการทำงานอาสาสมัคร โดยครอบคลุมแนวคิดเกี่ยวกับการทำงานอาสาสมัคร พัฒนาการของงานอาสาสมัครและขบวนการเคลื่อนไหวทางสังคมขององค์กรอาสาสมัครทั้งในประเทศและต่างประเทศ และการพัฒนาตนเองเพื่อให้นักศึกษาเกิดความรู้ความเข้าใจในวิธีคิดวิธีการทำงานอาสาสมัคร พร้อมทั้งมีทักษะในการปฏิบัติงานอาสาสมัครอันจะเป็นรากฐานในการพัฒนา สำนึกอาสาสมัครและการบำเพ็ญประโยชน์ต่อสังคมในอนาคต โดยมีการศึกษาทั้งภาคทฤษฎีและภาคปฏิบัตินอกสถานที่ ในเขตกรุงเทพมหานคร และปริมณฑล ภายใต้การดูแลของอาจารย์ที่ปรึกษา",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "This course is aimed to provide theoretical and technical skills necessary for voluntary social works, studies of social movement and social development agencies and network in Thailand and abroad. Emphasis will be placed on raising awareness of self development through social volunteerism - exposure and practicum, in the area of Bangkok and suburb, under guidance of teaching staff of Graduate Volunteer Centre, Thammasat University."
                }
            },
            {
                "category": "พท.242 การเสริมสร้างทักษะในการประกอบอาชีพ",
                "subcategories": {
                    "รหัสวิชา": "พท.242",
                    "ชื่อวิชาภาษาไทย": "การเสริมสร้างทักษะในการประกอบอาชีพ",
                    "ชื่อวิชาภาษาอังกฤษ": "Preparative for work achievement",
                    "หน่วยกิต": "2 (2-0-4)",
                    "คำอธิบายรายวิชาภาษาไทย": "เพื่อให้มีความรู้ ความเข้าใจเสริมสร้างเจตคติที่ดีงาม รวมทั้งพัฒนาทักษะในการทำงานที่สามารถนำไปประยุกต์ใช้ในวิชาชีพต่างๆ ได้แก่การสมัครงาน แรงงานสัมพันธ์ มนุษยสัมพันธ์ การประชุมและการเขียนรายงานการประชุม การนำเสนอโครงการหรือผลงานในรูปแบบต่างๆคุณภาพและการประเมินคุณภาพ การทำงานเป็นทีม การใช้อุปกรณ์สำนักงาน ความปลอดภัย อาชีวอนามัย และสภาพแวดล้อมในการทำงาน เป็นต้น อันจะเป็นการส่งเสริมให้อนาคตเกิดความสุขและความพึงพอใจในการทำงาน",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Knowledge gaining and understanding in positive thinking, including working skill development useful for job application, interpersonality, meeting, and report writing; Project presentation skill; Quality and quality evaluation; Teamwork; Usage of common office appliance; Personal safety and working environment which leads to happiness and satisfaction in the workplace."
                }
            },
            {
                "category": "พท.245 นักศึกษากับการพัฒนาตน",
                "subcategories": {
                    "รหัสวิชา": "พท.245",
                    "ชื่อวิชาภาษาไทย": "นักศึกษากับการพัฒนาตน",
                    "ชื่อวิชาภาษาอังกฤษ": "Student and self-development",
                    "หน่วยกิต": "2 (2-0-4)",
                    "คำอธิบายรายวิชาภาษาไทย": "การพัฒนาแบบบูรณาการของบุคลิกภาพของนักศึกษาตามอุดมคติ และปณิธานของมหาวิทยาลัยธรรมศาสตร์ เพื่อก่อให้เกิดคุณภาพทางจริยธรรม ทักษะในการดำเนินชีวิต มนุษยสัมพันธ์ การรู้จักตนเอง การแก้ไขปัญหาชีวิต บุคลิกภาพทางกาย จิตใจและความคิด การมีความเคารพนับถือในตัวเอง โดยสรุปแล้วต้องการช่วยพัฒนานักศึกษาสู่การเป็น 'คนดีที่มีความสุข' และเป็น 'มนุษย์ที่ใส่ใจเรียนรู้ เข้าใจ รักผู้อื่น และรักตัวเอง (มีการฝึกภาคปฏิบัตินอกสถานที่)'"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 4,
        "details": [
            {
                "category": "หมวดภาษา",
                "subcategories": {
                    "บังคับ": "2 วิชา 6 หน่วยกิต",
                    "รายวิชา": {
                        "มธ.050": {
                            "ชื่อวิชา": "การพัฒนาทักษะภาษาอังกฤษ",
                            "หน่วยกิต": "3 (3-0-6)",
                            "หมายเหตุ": "ไม่นับหน่วยกิต"
                        },
                        "มธ.104": {
                            "ชื่อวิชา": "การคิด อ่าน และเขียนอย่างมีวิจารณญาณ",
                            "หน่วยกิต": "3 (3-0-6)",
                            "หมายเหตุ": "วิชาที่บังคับให้ทุกหลักสูตรต้องมี"
                        },
                        "มธ.105": {
                            "ชื่อวิชา": "ทักษะการสื่อสารด้วยภาษาอังกฤษ",
                            "หน่วยกิต": "3 (3-0-6)",
                            "หมายเหตุ": "วิชาที่บังคับให้ทุกหลักสูตรต้องมี"
                        },
                        "มธ.106": {
                            "ชื่อวิชา": "ความคิดสร้างสรรค์และการสื่อสาร",
                            "หน่วยกิต": "3 (3-0-6)"
                        }
                    }
                }
            },
            {
                "category": "รายวิชาในหลักสูตรวิชาศึกษาทั่วไป ส่วนที่ 2",
                "subcategories": {
                    "ข้อมูลทั่วไป": "แบ่งได้เป็น 6 กลุ่มซึ่งคณะสามารถเลือกได้จากวิชาเหล่านี้ หรือกำหนดวิชาอื่นๆ ได้เองตามที่เห็นเหมาะสม",
                    "หมวดสังคมศาสตร์": {
                        "มธ.121": {
                            "ชื่อวิชา": "มนุษย์กับสังคม",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะที่รับผิดชอบ": "สังคมวิทยาฯ"
                        },
                        "มธ.122": {
                            "ชื่อวิชา": "กฎหมายในชีวิตประจำวัน",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะที่รับผิดชอบ": "นิติศาสตร์"
                        },
                        "มธ.124": {
                            "ชื่อวิชา": "สังคมกับเศรษฐกิจ",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะที่รับผิดชอบ": "เศรษฐศาสตร์"
                        },
                        "มธ.311": {
                            "ชื่อวิชา": "บริการทางวิชาชีพแก่สังคม",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะที่รับผิดชอบ": "วิชากลาง1"
                        },
                        "มธ.312": {
                            "ชื่อวิชา": "โครงการรณรงค์เพื่อสังคม",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะที่รับผิดชอบ": "วิชากลาง1"
                        },
                        "มธ.399": {
                            "ชื่อวิชา": "การฝึกงานในวิชาชีพ",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะที่รับผิดชอบ": "วิชากลาง1"
                        },
                        "อซ.125": {
                            "ชื่อวิชา": "ความรู้ทั่วไปเกี่ยวกับอาเซียน",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะที่รับผิดชอบ": "ศิลปศาสตร์"
                        },
                        "บอ.200": {
                            "ชื่อวิชา": "ความรู้เบื้องต้นว่าด้วยชนบทไทยและชนบทในอาเซียน",
                            "หน่วยกิต": "3 (3-0-9)",
                            "คณะที่รับผิดชอบ": "วิทยาลัยพัฒนศาสตร์ ป๋วย อึ๊งภากรณ์"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 15,
        "details": [
            {
                "category": "มธ.399 การฝึกงานในวิชาชีพ",
                "subcategories": {
                    "รหัสวิชา": "มธ.399",
                    "ชื่อวิชาภาษาไทย": "การฝึกงานในวิชาชีพ",
                    "ชื่อวิชาภาษาอังกฤษ": "Professional Internship",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "การลงมือปฏิบัติงานในวิชาชีพกับองค์กรที่อยู่ในรายชื่อที่แต่ละคณะ/สาขาวิชาอนุมัติ ภายใต้การดูแลของคณะที่ปรึกษา โดยมีการตกลงขอบเขตหน้าที่ ความรับผิดชอบ ตลอดจนระยะเวลา และหลักเกณฑ์ในการประเมินผล ที่ชัดเจน โดยมุ่งเน้นให้เกิดการเรียนรู้จากการนำความรู้ และทักษะที่ได้ศึกษามาเพื่อใช้สำหรับการทำงานในวิชาชีพจริง ก่อนที่จะสำเร็จการศึกษาเข้าสู่โลกการทำงาน",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Students will learn about and practise professional work in an organization approved by the faculty under the supervision of the advisory committee. There will be clear stipulation of the internship duties and responsibilities, duration and appraisal criteria. The focus will be on learning via application of knowledge and skills gained during the programme to a real professional situation in preparation for entry into the world of work after graduation."
                }
            },
            {
                "category": "อซ.125 ความรู้ทั่วไปเกี่ยวกับอาเซียน",
                "subcategories": {
                    "รหัสวิชา": "อซ.125",
                    "ชื่อวิชาภาษาไทย": "ความรู้ทั่วไปเกี่ยวกับอาเซียน",
                    "ชื่อวิชาภาษาอังกฤษ": "Introduction to ASEAN",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "ประวัติของการก่อตั้งและเป้าหมายของอาเซียนตลอดจนภาพรวมด้านสังคม การเมือง การปกครอง เศรษฐกิจ วัฒนธรรม ความคิดและความเชื่อเบื้องต้นของประเทศต่างๆที่เป็นสมาชิกอาเซียน",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "An Introduction the history and the aims of the establishment of ASEAN community. It includes the overview of ASEAN countries in social,political,economic,cultural and ideological aspects."
                }
            },
            {
                "category": "บอ.200 ความรู้เบื้องต้นว่าด้วยชนบทไทยและชนบทในอาเซียน",
                "subcategories": {
                    "รหัสวิชา": "บอ.200",
                    "ชื่อวิชาภาษาไทย": "ความรู้เบื้องต้นว่าด้วยชนบทไทยและชนบทในอาเซียน",
                    "ชื่อวิชาภาษาอังกฤษ": "Introduction to Thai Rural Society and Rural Societies in ASEAN",
                    "หน่วยกิต": "3 (3-0-9)",
                    "คำอธิบายรายวิชาภาษาไทย": "พลวัตทางสังคมชนบทไทยจากยุคการพัฒนาสู่ความทันสมัยจนถึงยุคการแสวงหาการพัฒนาในแนวทางเลือก ภายใต้แนวคิดวัฒนธรรมชุมชน เศรษฐกิจพอเพียงและอื่นๆ โดยศึกษาเปรียบเทียบกับความเปลี่ยนแปลงชนบทที่เกิดขึ้นในประเทศสมาคมประชาชาติแห่งเอเชียตะวันออกเฉียงใต้ รวมถึงผลกระทบของการจัดตั้งประชาคมอาเซียนต่อชนบทไทย เป็นการศึกษาภาคบรรยายและทัศนศึกษาดูงานในพื้นที่ชนบทในประเทศไทยหรือประเทศในกลุ่มอาเซียน",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "The course aims to examine dynamics of Thai rural society from the era of development approach based on the notion of modernization to the search of alternative development which is represented through concepts of community culture and sufficiency economy etc. Furthermore, the course explores changing in rural societies of ASEAN, and the impact of the establishment of ASEAN on Thai rural society. Students will have class and field visit of rural society in Thailand or ASEAN."
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 7,
        "details": [
            {
                "category": "ภาษาฝรั่งเศส",
                "subcategories": {
                    "ฝ.070": {
                        "ชื่อวิชา": "ภาษาฝรั่งเศสเบื้องต้น",
                        "รหัสวิชาภาษาอังกฤษ": "FR070",
                        "ชื่อวิชาภาษาอังกฤษ": "Elementary French",
                        "หน่วยกิต": "3 (2-3-4)",
                        "คณะ": "ศิลปศาสตร์",
                        "หมายเหตุ": "ไม่นับหน่วยกิต"
                    },
                    "ฝ.171": {
                        "ชื่อวิชา": "ภาษาฝรั่งเศส 1",
                        "รหัสวิชาภาษาอังกฤษ": "FR171",
                        "ชื่อวิชาภาษาอังกฤษ": "French 1",
                        "หน่วยกิต": "3 (2-3-4)",
                        "คณะ": "ศิลปศาสตร์"
                    },
                    "ฝ.172": {
                        "ชื่อวิชา": "ภาษาฝรั่งเศส 2",
                        "รหัสวิชาภาษาอังกฤษ": "FR172",
                        "ชื่อวิชาภาษาอังกฤษ": "French 2",
                        "หน่วยกิต": "3 (2-3-4)",
                        "คณะ": "ศิลปศาสตร์"
                    }
                }
            },
            {
                "category": "ภาษาญี่ปุ่น",
                "subcategories": {
                    "ญ.171": {
                        "ชื่อวิชา": "ภาษาญี่ปุ่นสำหรับผู้เริ่มต้น 1",
                        "รหัสวิชาภาษาอังกฤษ": "JP171",
                        "ชื่อวิชาภาษาอังกฤษ": "Japanese for Beginners 1",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คณะ": "ศิลปศาสตร์"
                    },
                    "ญ.172": {
                        "ชื่อวิชา": "ภาษาญี่ปุ่นสำหรับผู้เริ่มต้น 2",
                        "รหัสวิชาภาษาอังกฤษ": "JP172",
                        "ชื่อวิชาภาษาอังกฤษ": "Japanese for Beginners 2",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คณะ": "ศิลปศาสตร์"
                    }
                }
            },
            {
                "category": "ภาษารัสเซีย",
                "subcategories": {
                    "รซ.171": {
                        "ชื่อวิชา": "ภาษารัสเซีย 1",
                        "รหัสวิชาภาษาอังกฤษ": "RS171",
                        "ชื่อวิชาภาษาอังกฤษ": "Russian 1",
                        "หน่วยกิต": "3 (2-3-4)",
                        "คณะ": "ศิลปศาสตร์"
                    },
                    "รซ.172": {
                        "ชื่อวิชา": "ภาษารัสเซีย 2",
                        "รหัสวิชาภาษาอังกฤษ": "RS172",
                        "ชื่อวิชาภาษาอังกฤษ": "Russian 2",
                        "หน่วยกิต": "3 (2-3-4)",
                        "คณะ": "ศิลปศาสตร์"
                    }
                }
            },
            {
                "category": "ภาษาเยอรมัน",
                "subcategories": {
                    "สำหรับผู้ที่ไม่เคยเรียนภาษาเยอรมันมาก่อน": {
                        "ย.171": {
                            "ชื่อวิชา": "ภาษาเยอรมัน 1",
                            "รหัสวิชาภาษาอังกฤษ": "GR171",
                            "ชื่อวิชาภาษาอังกฤษ": "German 1",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        },
                        "ย.172": {
                            "ชื่อวิชา": "ภาษาเยอรมัน 2",
                            "รหัสวิชาภาษาอังกฤษ": "GR172",
                            "ชื่อวิชาภาษาอังกฤษ": "German 2",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        }
                    },
                    "สำหรับผู้ที่สอบผ่าน ย.172 หรือสอบผ่านภาษาเยอรมันในระดับมัธยมศึกษาตอนปลายหรือได้รับอนุมัติจากภาควิชา": {
                        "ย.111": {
                            "ชื่อวิชา": "ภาษาเยอรมันพื้นฐาน 1",
                            "รหัสวิชาภาษาอังกฤษ": "GR111",
                            "ชื่อวิชาภาษาอังกฤษ": "Fundamental German 1",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        },
                        "ย.112": {
                            "ชื่อวิชา": "ภาษาเยอรมันพื้นฐาน 2",
                            "รหัสวิชาภาษาอังกฤษ": "GR112",
                            "ชื่อวิชาภาษาอังกฤษ": "Fundamental German 2",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        }
                    }
                }
            },
            {
                "category": "ภาษาสเปน",
                "subcategories": {
                    "สป.171": {
                        "ชื่อวิชา": "ภาษาสเปน 1",
                        "รหัสวิชาภาษาอังกฤษ": "SP171",
                        "ชื่อวิชาภาษาอังกฤษ": "Spanish I",
                        "หน่วยกิต": "3 (2-3-4)",
                        "คณะ": "ศิลปศาสตร์"
                    },
                    "สป.172": {
                        "ชื่อวิชา": "ภาษาสเปน 2",
                        "รหัสวิชาภาษาอังกฤษ": "SP172",
                        "ชื่อวิชาภาษาอังกฤษ": "Spanish II",
                        "หน่วยกิต": "3 (2-3-4)",
                        "คณะ": "ศิลปศาสตร์"
                    }
                }
            },
            {
                "category": "ภาษาเกาหลี",
                "subcategories": {}
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 31,
        "details": [
            {
                "category": "ภาษาเวียดนาม (Vietnamese)",
                "subcategories": {
                    "อซ.179 ภาษาเวียดนาม 1": {
                        "รหัสวิชา": "AS179",
                        "ชื่อวิชาภาษาอังกฤษ": "Vietnamese I",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "ภาษาเวียดนามเบื้องต้นเพื่อสร้างทักษะด้านการฟัง พูด อ่าน เขียน และโครงสร้างพื้นฐานของภาษาเวียดนาม",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Introduction to elementary Vietnamese language to provide usage skill listening, speaking, reading, writing and fundamental structures of Vietnamese language"
                    },
                    "อซ.180 ภาษาเวียดนาม 2": {
                        "รหัสวิชา": "AS180",
                        "ชื่อวิชาภาษาอังกฤษ": "Vietnamese 2",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้วิชา อซ. 179",
                        "คำอธิบายรายวิชา": "ภาษาเวียดนามเบื้องต้นต่อเนื่องจากภาษาเวียดนาม 1 เพื่อให้สามารถนำมาใช้ในชีวิตประจำวันได้",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Studying elementary Vietnamese language in continuation from Vietnamese 1 to acquire basic usage skills of the language in daily life",
                        "Pre-requisite": "have earned credits of AS179"
                    }
                }
            },
            {
                "category": "ภาษาลาว (Lao)",
                "subcategories": {
                    "อซ.181 ภาษาลาว 1": {
                        "รหัสวิชา": "AS181",
                        "ชื่อวิชาภาษาอังกฤษ": "Lao I",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "ภาษาลาวเบื้องต้นเพื่อสร้างทักษะด้านการฟัง พูด อ่าน เขียน และโครงสร้างพื้นฐานของภาษาลาว",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Introduction to elementary Lao language to provide usage skill listening, speaking, reading, writing and fundamental structures of Lao language"
                    },
                    "อซ.182 ภาษาลาว 2": {
                        "รหัสวิชา": "AS182",
                        "ชื่อวิชาภาษาอังกฤษ": "Lao 2",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้วิชา อซ. 181",
                        "คำอธิบายรายวิชา": "ภาษาลาวเบื้องต้นต่อเนื่องจากภาษาลาว 1 เพื่อให้สามารถนำมาใช้ในชีวิตประจำวันได้",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Studying elementary Lao language in continuation from Lao 1 to acquire basic usage skills of the language in daily life",
                        "Pre-requisite": "have earned credits of AS181"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 34,
        "details": [
            {
                "category": "วิชากีฬา",
                "subcategories": {
                    "วฬ.215_รักบี้ฟุตบอล": {
                        "รหัสวิชา": "วฬ.215",
                        "ชื่อวิชา": "รักบี้ฟุตบอล",
                        "หน่วยกิต": "1 (0-2-1)",
                        "ชื่อภาษาอังกฤษ": "SN215 Rugby",
                        "เนื้อหา": "ทักษะพื้นฐานสำหรับนักกีฬารักบี้ฟุตบอล สมรรถภาพทางกาย การบาดเจ็บและความปลอดภัย กฏ กติกา มรรยาท สำหรับนักกีฬารักบี้ฟุตบอล และการเก็บรักษาอุปกรณ์",
                        "คำอธิบายภาษาอังกฤษ": "basic skills for rugby athletes. Physical performance, injury and safety, rules, regulation and good habits for rugby athletes and equipment maintenance."
                    },
                    "วฬ.216_วอลเลย์บอล": {
                        "รหัสวิชา": "วฬ.216",
                        "ชื่อวิชา": "วอลเลย์บอล",
                        "หน่วยกิต": "1 (0-2-1)",
                        "ชื่อภาษาอังกฤษ": "SN216 Volleyball",
                        "เนื้อหา": "ทักษะพื้นฐานสำหรับนักกีฬาวอลเลย์บอล สมรรถภาพทางกาย การบาดเจ็บและความปลอดภัย กฏ กติกา มรรยาท สำหรับนักกีฬาวอลเลย์บอล และการเก็บรักษาอุปกรณ์",
                        "คำอธิบายภาษาอังกฤษ": "basic skills for volleyball athletes. Physical performance, injury and safety, rules, regulation and good habits for volleyball athletes and equipment maintenance."
                    },
                    "วฬ.217_เบสบอล": {
                        "รหัสวิชา": "วฬ.217",
                        "ชื่อวิชา": "เบสบอล",
                        "หน่วยกิต": "1 (0-2-1)",
                        "ชื่อภาษาอังกฤษ": "SN217 Baseball",
                        "เนื้อหา": "ทักษะพื้นฐานสำหรับนักกีฬาเบสบอล สมรรถภาพทางกาย การบาดเจ็บและความปลอดภัย กฎ กติกา มรรยาท สำหรับนักกีฬาเบสบอล และการเก็บรักษาอุปกรณ์",
                        "คำอธิบายภาษาอังกฤษ": "basic skills for baseball athletes. Physical performance, injury and safety, rules, regulation and good habits for baseball athletes and equipment maintenance."
                    },
                    "วฬ.218_ฟุตซอล": {
                        "รหัสวิชา": "วฬ.218",
                        "ชื่อวิชา": "ฟุตซอล",
                        "หน่วยกิต": "1 (0-2-1)",
                        "ชื่อภาษาอังกฤษ": "SN218 Futsal",
                        "เนื้อหา": "ทักษะพื้นฐานสำหรับนักกีฬาฟุตซอล สมรรถภาพทางกาย การบาดเจ็บและความปลอดภัย กฏ กติกา มรรยาท สำหรับนักกีฬาฟุตซอล และการเก็บรักษาอุปกรณ์",
                        "คำอธิบายภาษาอังกฤษ": "basic skills for futsal athletes. Physical performance, injury and safety, rules, regulation and good habits for futsal athletes and equipment maintenance."
                    },
                    "วฬ.219_ซอฟท์บอล": {
                        "รหัสวิชา": "วฬ.219",
                        "ชื่อวิชา": "ซอฟท์บอล",
                        "หน่วยกิต": "1 (0-2-1)",
                        "ชื่อภาษาอังกฤษ": "SN219 Softball",
                        "เนื้อหา": "ทักษะพื้นฐานสำหรับนักกีฬาซอฟท์บอล สมรรถภาพทางกาย การบาดเจ็บและความปลอดภัย กฏ กติกา มรรยาท สำหรับนักกีฬาซอฟท์บอล และการเก็บรักษาอุปกรณ์",
                        "คำอธิบายภาษาอังกฤษ": "basic skills for softball athletes. Physical performance, injury and safety, rules, regulation and good habits for softball athletes and equipment maintenance."
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 37,
        "details": [
            {
                "category": "คุณธรรม จริยธรรม",
                "subcategories": {
                    "ผลการเรียนรู้": {
                        "1": "มีความซื่อสัตย์สุจริต",
                        "2": "มีความเป็นธรรม",
                        "3": "มีความรับผิดชอบต่อตนเองและสังคม",
                        "4": "มีวินัย",
                        "5": "มีจริยธรรมและจรรยาบรรณในวิชาชีพ",
                        "6": "มีจิตอาสา"
                    },
                    "กลยุทธ์การสอน": {
                        "1": "เรียนจากบทบาทสมมติ และกรณีตัวอย่างที่ครอบคลุมประเด็นปัญหาด้านคุณธรรม จริยธรรม",
                        "2": "บรรยายและอภิปราย โดยสอดแทรกคุณธรรม จริยธรรมในรายวิชา",
                        "3": "มอบหมายงานการศึกษาค้นคว้าด้วยตนเองเป็นรายบุคคล",
                        "4": "มอบหมายงานการศึกษาค้นคว้าเป็นกลุ่ม",
                        "5": "กรณีศึกษาและการมีส่วนร่วมในการวิเคราะห์และให้ความเห็นด้านคุณธรรม จริยธรรม",
                        "6": "การสอดแทรกคุณธรรมในรายวิชาด้านคุณธรรม จริยธรรม",
                        "7": "จัดกิจกรรมเสริมและพัฒนาคุณธรรม จริยธรรม",
                        "8": "การเรียนรู้จากสถานการณ์จริง",
                        "9": "จัดโครงการพัฒนาแนวคิดด้านความรับผิดชอบต่อตนเองและสังคม",
                        "10": "จัดกิจกรรมส่งเสริมในเรื่องความรับผิดชอบทั้งในชั้นเรียน และนอกชั้นเรียน",
                        "11": "แฟ้มสะสมงาน",
                        "12": "กรณีศึกษาการเป็นแบบอย่างที่ดีของวิชาชีพต่างๆ",
                        "13": "จัดโครงการพัฒนาแนวคิดด้านจิตอาสา",
                        "14": "กําหนดชั่วโมงกิจกรรมพัฒนาจิตอาสา"
                    },
                    "กลยุทธ์การประเมินผล": {
                        "1": "การประเมินแบ่งออกเป็น 3 ระยะ โดยนักศึกษาประเมินตนเอง เพื่อน อาจารย์",
                        "ระยะการประเมิน": [
                            "ก่อนเรียน",
                            "ระหว่างเรียน",
                            "หลังการเรียน/กิจกรรม"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 23,
        "details": [
            {
                "category": "มธ.050 การพัฒนาทักษะภาษาอังกฤษ",
                "subcategories": {
                    "คำอธิบายรายวิชา": "ฝึกฝนทักษะภาษาอังกฤษในระดับเบื้องต้นในการฟัง พูด อ่าน และเขียนแบบบูรณาการ เพื่อเป็นพื้นฐานในการศึกษาภาษาอังกฤษระดับที่สูงขึ้น",
                    "Course Description": "Practice basic skills for listening, speaking, reading, and writing in English through an integrated method. Students will acquire a basis to continue to study English at a higher level."
                }
            },
            {
                "category": "มธ.104 การคิด อ่าน และเขียนอย่างมีวิจารณญาณ",
                "subcategories": {
                    "คำอธิบายรายวิชา": "พัฒนาทักษะการคิดอย่างมีวิจารณญาณผ่านการตั้งคำถาม การวิเคราะห์ การสังเคราะห์ และการประเมินค่า พัฒนาทักษะการอ่านเพื่อจับสาระสำคัญ เข้าใจจุดมุ่งหมาย ทัศนคติ สมมติฐาน หลักฐานสนับสนุน การใช้เหตุผลที่นำไปสู่ข้อสรุปของงานเขียน พัฒนาทักษะการเขียนแสดงความคิดเห็นอย่างมีเหตุผลและการเขียนเชิงวิชาการ รู้จักถ่ายทอดความคิด และเชื่อมโยงข้อมูลเข้ากับมุมมองของตนเอง รวมถึงสามารถอ้างอิงหลักฐานและข้อมูลมาใช้ในการสร้างสรรค์งานเขียนได้อย่างมีประสิทธิภาพ",
                    "Course Description": "Development of critical thinking through questioning, analytical, synthetic and evaluation skills. Students learn how to read without necessarily accepting all the information presented in the text, but rather consider the content in depth, taking into account the objectives, perspectives, assumptions, bias and supporting evidence, as well as logic or strategies leading to the author's conclusion. The purpose is to apply these methods to students' own persuasive writing based on information researched from various sources, using effective presentation techniques."
                }
            },
            {
                "category": "มธ.105 ทักษะการสื่อสารด้วยภาษาอังกฤษ",
                "subcategories": {
                    "วิชาบังคับก่อน": "ต้องสอบได้หรือได้รับการยกเว้นวิชา มธ.050",
                    "คำอธิบายรายวิชา": "พัฒนาทักษะการฟัง พูด อ่าน และเขียนภาษาอังกฤษโดยมุ่งเน้นความสามารถในการสนทนาเพื่อแลกเปลี่ยนความคิดเห็น และการอ่าน เพื่อทำความเข้าใจเนื้อหาวิชาการในศาสตร์ต่างๆ ที่เกี่ยวข้องกับวิชาชีพของนักศึกษา",
                    "Prerequisite": "Have earned credits of TU050 or exempt",
                    "Course Description": "Development of English listening, speaking, reading and writing skills, focusing on the ability to hold a conversation in exchanging opinions, as well as reading comprehension of academic texts from various disciplines related to students' field of study."
                }
            },
            {
                "category": "มธ.106 ความคิดสร้างสรรค์และการสื่อสาร",
                "subcategories": {
                    "คำอธิบายรายวิชา": "กระบวนการคิดอย่างสร้างสรรค์ โดยมีการคิดเชิงวิพากษ์เป็นองค์ประกอบสำคัญ และการสื่อสารความคิดดังกล่าวให้เกิดผลสัมฤทธิ์อย่างเหมาะสมตามบริบทสังคม วัฒนธรรม สภาพแวดล้อม ทั้งในระดับบุคคล องค์กร และสังคม"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 6,
        "details": [
            {
                "category": "วิชาในกลุ่มคณิตศาสตร์",
                "subcategories": {
                    "มธ.151": {
                        "ชื่อวิชา": "คณิตศาสตร์ทั่วไประดับมหาวิทยาลัย",
                        "ชื่อภาษาอังกฤษ": "General College Mathematics",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คณะ": "วิทยาศาสตร์ฯ"
                    },
                    "มธ.152": {
                        "ชื่อวิชา": "หลักพื้นฐานทางคณิตศาสตร์",
                        "ชื่อภาษาอังกฤษ": "Fundamental Mathematics",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คณะ": "วิทยาศาสตร์ฯ"
                    },
                    "มธ.153": {
                        "ชื่อวิชา": "ความรู้ทั่วไปเกี่ยวกับคอมพิวเตอร์",
                        "ชื่อภาษาอังกฤษ": "General Concepts of Computer",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คณะ": "วิทยาศาสตร์ฯ"
                    },
                    "มธ.154": {
                        "ชื่อวิชา": "รากฐานคณิตศาสตร์",
                        "ชื่อภาษาอังกฤษ": "Foundation of Mathematics",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คณะ": "วิทยาศาสตร์ฯ"
                    },
                    "มธ.155": {
                        "ชื่อวิชา": "สถิติพื้นฐาน",
                        "ชื่อภาษาอังกฤษ": "Elementary Statistics",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คณะ": "วิทยาศาสตร์ฯ"
                    },
                    "มธ.156": {
                        "ชื่อวิชา": "คอมพิวเตอร์และการเขียนโปรแกรมเบื้องต้น",
                        "ชื่อภาษาอังกฤษ": "Introduction to Computers and Programming",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คณะ": "วิทยาศาสตร์ฯ"
                    },
                    "วท.142": {
                        "ชื่อวิชา": "คณิตศาสตร์สำหรับวิทยาศาสตร์",
                        "ชื่อภาษาอังกฤษ": "Mathematics for Science",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คณะ": "วิทยาศาสตร์ฯ"
                    }
                }
            },
            {
                "category": "หมวดภาษา",
                "subcategories": {
                    "วิชาในกลุ่มภาษาไทย": {
                        "ท.201": {
                            "ชื่อวิชา": "การพัฒนาสมรรถภาพการเขียน",
                            "ชื่อภาษาอังกฤษ": "Writing Proficiency Development",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        },
                        "ท.202": {
                            "ชื่อวิชา": "การพัฒนาสมรรถภาพการอ่าน",
                            "ชื่อภาษาอังกฤษ": "Reading Proficiency Development",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        },
                        "ท.203": {
                            "ชื่อวิชา": "การอ่านเชิงวิจารณ์เบื้องต้น",
                            "ชื่อภาษาอังกฤษ": "Basic Critical Reading",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        }
                    },
                    "วิชาในกลุ่มภาษาต่างประเทศ": {
                        "ภาษาจีน": {
                            "จน.171": {
                                "ชื่อวิชา": "ภาษาจีน 1",
                                "ชื่อภาษาอังกฤษ": "Chinese 1",
                                "หน่วยกิต": "3 (3-0-6)",
                                "คณะ": "ศิลปศาสตร์"
                            },
                            "จน.172": {
                                "ชื่อวิชา": "ภาษาจีน 2",
                                "ชื่อภาษาอังกฤษ": "Chinese 2",
                                "หน่วยกิต": "3 (3-0-6)",
                                "คณะ": "ศิลปศาสตร์"
                            }
                        },
                        "ภาษาฝรั่งเศส": {}
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 32,
        "details": [
            {
                "category": "ภาษาอินโดนีเซีย (Indonesian)",
                "subcategories": {
                    "อซ.183_ภาษาอินโดนีเซีย_1": {
                        "รหัสวิชา": "AS183",
                        "ชื่อวิชาภาษาอังกฤษ": "Indonesian I",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "ภาษาอินโดนิเซียเบื้องต้น เพื่อสร้างทักษะด้านการฟัง พูด อ่าน เขียน และโครงสร้างพื้นฐานของภาษาอินโดนิเซีย",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Introduction to elementary Indonesian language to provide usage skill listening, speaking, reading, writing and fundamental structures of Indonesian language"
                    },
                    "อซ.184_ภาษาอินโดนีเซีย_2": {
                        "รหัสวิชา": "AS184",
                        "ชื่อวิชาภาษาอังกฤษ": "Indonesian 2",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้วิชา อซ. 183",
                        "คำอธิบายรายวิชา": "ภาษาอินโดนิเซียเบื้องต้น ต่อเนื่องจากภาษาอินโดนิเซีย 1 เพื่อให้สามารถนำมาใช้ในชีวิตประจำวันได้",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Studying elementary Indonesian language in continuation from Indonesian 1 to acquire basic usage skills of the language in daily life",
                        "Pre-requisite": "have earned credits of AS183"
                    }
                }
            },
            {
                "category": "ภาษาต่างประเทศอื่นๆ (Foreign Language)",
                "subcategories": {
                    "ภต.171_ภาษาต่างประเทศ_1": {
                        "รหัสวิชา": "FL171",
                        "ชื่อวิชาภาษาอังกฤษ": "Foreign Language 1",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "ศึกษาภาษาต่างประเทศอื่นๆ นอกเหนือจากภาษาอังกฤษ ฝรั่งเศส เยอรมัน ญี่ปุ่น รัสเซีย จีน สเปน เกาหลี เขมร พม่า มลายู เวียดนาม ลาว และอินโดนีเซีย ในระดับพื้นฐานเบื้องต้น ในสถาบันการศึกษาต่างประเทศ",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Have studied another foreign language (except English, French, German, Japanese, Russian, Chinese, Spanish, Korean, Burmese, Malay, Vietnamese, Lao and Indonesian) at the fundamental level at a foreign Institute."
                    },
                    "ภต.172_ภาษาต่างประเทศ_2": {
                        "รหัสวิชา": "FL172",
                        "ชื่อวิชาภาษาอังกฤษ": "Foreign Language 2",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "ศึกษาภาษาต่างประเทศอื่นๆ นอกเหนือจากภาษาอังกฤษ ฝรั่งเศส เยอรมัน ญี่ปุ่น รัสเซีย จีน สเปน เกาหลี เขมร พม่า มลายู เวียดนาม ลาว และอินโดนีเซีย ในระดับพื้นฐานเบื้องต้น ในสถาบันการศึกษาต่างประเทศ"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 13,
        "details": [
            {
                "category": "มธ.109 นวัตกรรมกับกระบวนคิดผู้ประกอบการ",
                "subcategories": {
                    "รหัสวิชา": "มธ.109",
                    "ชื่อวิชาภาษาไทย": "นวัตกรรมกับกระบวนคิดผู้ประกอบการ",
                    "ชื่อวิชาภาษาอังกฤษ": "Innovation and Entrepreneurial mindset",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "การประเมินความเสี่ยงและการสร้างโอกาสใหม่ การคิดและการวางแผนแบบผู้ประกอบการ การตัดสินใจและการพัฒนาธุรกิจ การสื่อสารเชิงธุรกิจและการสร้างแรงจูงใจอย่างมีประสิทธิภาพ การสร้างคุณค่าร่วมเพื่อสังคม",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Risk assessment and creating new opportunities. Thinking and planning as an entrepreneur. Decision making and entrepreneurial venture development. Business communication for delivering concept or initiative in an efficient, effective and compelling manner. Social shared value creation."
                }
            },
            {
                "category": "มธ.121 มนุษย์กับสังคม",
                "subcategories": {
                    "รหัสวิชา": "มธ.121",
                    "ชื่อวิชาภาษาไทย": "มนุษย์กับสังคม",
                    "ชื่อวิชาภาษาอังกฤษ": "Man and Society",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "ลักษณะทั่วไปของสังคมมนุษย์ องค์ประกอบโครงสร้างและกระบวนการทางสังคม การเปลี่ยนแปลงและวิวัฒนาการของสังคมอันเป็นผลจากการเปลี่ยนแปลงทางสิ่งแวดล้อม เทคโนโลยี และปัจจัยสำคัญอื่น ๆ วิเคราะห์สังคมแบบต่าง ๆ เพื่อให้เห็นความสัมพันธ์ระหว่างองค์ประกอบต่าง ๆ ภายในสังคม และความสัมพันธ์ระหว่างสังคมกับสิ่งแวดล้อม เสริมสร้างจริยธรรม จิตสำนึก และความรับผิดชอบต่อสังคมทั้งในระดับชาติ และระดับสากล",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "To study general characteristics of human societies, elements of social structures and procedures, social changes and evolution resulting from such factors as environment, and technology, etc. To analyze various kinds of societies to find out the relationship among elements within each society, and the relationship between society and environment. To strengthen ethics and awareness on social responsibilities both in national and international levels."
                }
            },
            {
                "category": "มธ.122 กฎหมายในชีวิตประจำวัน",
                "subcategories": {
                    "รหัสวิชา": "มธ.122",
                    "ชื่อวิชาภาษาไทย": "กฎหมายในชีวิตประจำวัน",
                    "ชื่อวิชาภาษาอังกฤษ": "Law in Everyday Life",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "ลักษณะทั่วไปของกฎหมาย ในฐานะที่เป็นแบบแผนความประพฤติของมนุษย์ในสังคม หลักการพื้นฐานของนิติรัฐ (rule of law) คุณค่าของกฎหมายในฐานะที่เชื่อมโยงกับหลักคุณธรรมของประชาชน ความรู้พื้นฐานในเรื่องกฎหมายเอกชนและกฎหมายมหาชนที่พลเมืองในระบอบประชาธิปไตยควรต้องรู้ทั้งในด้านของสิทธิ และในด้านของหน้าที่ การระงับข้อพิพาทและกระบวนการยุติธรรมของไทย หลักการใช้สิทธิ หลักการใช้และการตีความกฎหมาย โดยเน้นการศึกษาจากกรณีตัวอย่างที่เกิดขึ้นจริงในชีวิตประจำวัน",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "To study general aspects of law as correct patterns of human conduct in society. To equip learners with basic principles of public law (rules of law), and its values which are associated with citizens' moral core. To provide basic knowledge in public law and private law, involving the issues of rights and duties, dispute settlement, Thai Justice procedures, the usage and interpretation of law principles, with an emphasis on case studies in our daily lives."
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 8,
        "details": [
            {
                "category": "ภาษาเอเชีย",
                "subcategories": {
                    "ภาษาเกาหลี": {
                        "อซ.171": {
                            "ชื่อวิชา": "ภาษาเกาหลี 1",
                            "ชื่อวิชาภาษาอังกฤษ": "Korean 1",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        },
                        "อซ.172": {
                            "ชื่อวิชา": "ภาษาเกาหลี 2",
                            "ชื่อวิชาภาษาอังกฤษ": "Korean 2",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        }
                    },
                    "ภาษาเขมร": {
                        "อซ.173": {
                            "ชื่อวิชา": "ภาษาเขมร 1",
                            "ชื่อวิชาภาษาอังกฤษ": "Khmer 1",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        },
                        "อซ.174": {
                            "ชื่อวิชา": "ภาษาเขมร 2",
                            "ชื่อวิชาภาษาอังกฤษ": "Khmer 2",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        }
                    },
                    "ภาษาพม่า": {
                        "อซ.175": {
                            "ชื่อวิชา": "ภาษาพม่า 1",
                            "ชื่อวิชาภาษาอังกฤษ": "Burmese 1",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        },
                        "อซ.176": {
                            "ชื่อวิชา": "ภาษาพม่า 2",
                            "ชื่อวิชาภาษาอังกฤษ": "Burmese 2",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        }
                    },
                    "ภาษามลายู": {
                        "อซ.177": {
                            "ชื่อวิชา": "ภาษามลายู 1",
                            "ชื่อวิชาภาษาอังกฤษ": "Malay 1",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        },
                        "อซ.178": {
                            "ชื่อวิชา": "ภาษามลายู 2",
                            "ชื่อวิชาภาษาอังกฤษ": "Malay 2",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        }
                    },
                    "ภาษาเวียดนาม": {
                        "อซ.179": {
                            "ชื่อวิชา": "ภาษาเวียดนาม 1",
                            "ชื่อวิชาภาษาอังกฤษ": "Vietnamese 1",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        },
                        "อซ.180": {
                            "ชื่อวิชา": "ภาษาเวียดนาม 2",
                            "ชื่อวิชาภาษาอังกฤษ": "Vietnamese 2",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        }
                    },
                    "ภาษาลาว": {
                        "อซ.181": {
                            "ชื่อวิชา": "ภาษาลาว 1",
                            "ชื่อวิชาภาษาอังกฤษ": "Lao 1",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        },
                        "อซ.182": {
                            "ชื่อวิชา": "ภาษาลาว 2",
                            "ชื่อวิชาภาษาอังกฤษ": "Lao 2",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        }
                    },
                    "ภาษาอินโดนีเซีย": {
                        "อซ.183": {
                            "ชื่อวิชา": "ภาษาอินโดนีเซีย 1",
                            "ชื่อวิชาภาษาอังกฤษ": "Indonesian 1",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        },
                        "อซ.184": {
                            "ชื่อวิชา": "ภาษาอินโดนีเซีย 2",
                            "ชื่อวิชาภาษาอังกฤษ": "Indonesian 2",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะ": "ศิลปศาสตร์"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 28,
        "details": [
            {
                "category": "ภาษาเยอรมัน",
                "subcategories": {
                    "ย.111_ภาษาเยอรมันพื้นฐาน_1": {
                        "รหัสวิชา": "ย.111",
                        "ชื่อวิชา": "ภาษาเยอรมันพื้นฐาน 1",
                        "หน่วยกิต": "3 (3-0-6)",
                        "เนื้อหา": [
                            "ไวยากรณ์พื้นฐานและโครงสร้างของภาษาเยอรมัน",
                            "คำศัพท์สำหรับชีวิตประจำวัน",
                            "การสนทนาในชีวิตประจำวัน",
                            "การอ่านข้อความสั้นๆ ที่ไม่ซับซ้อน",
                            "การเขียนประโยคและย่อหน้าสั้นๆ ที่ถูกต้องตามหลักไวยากรณ์"
                        ]
                    },
                    "ย.112_ภาษาเยอรมันพื้นฐาน_2": {
                        "รหัสวิชา": "ย.112",
                        "ชื่อวิชา": "ภาษาเยอรมันพื้นฐาน 2",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ ย. 111 หรือผ่านการทดสอบ หรือได้รับอนุมัติจากสาขาวิชา",
                        "เนื้อหา": [
                            "ไวยากรณ์พื้นฐานและโครงสร้างภาษาเยอรมัน",
                            "คำศัพท์ที่ใช้ในชีวิตประจำวัน",
                            "การสนทนาตามสถานการณ์ต่างๆ",
                            "การอ่านตัวบทขนาดสั้นที่ซับซ้อนขึ้น",
                            "การเขียนประโยคและย่อหน้าที่ถูกต้องตามหลักไวยากรณ์และมีวงศัพท์มากขึ้น"
                        ]
                    }
                }
            },
            {
                "category": "ภาษาสเปน",
                "subcategories": {
                    "สป.171_ภาษาสเปน_1": {
                        "รหัสวิชา": "สป.171",
                        "ชื่อวิชา": "ภาษาสเปน 1",
                        "หน่วยกิต": "3 (2-3-4)",
                        "เนื้อหา": [
                            "การอ่านออกเสียง",
                            "หลักไวยากรณ์และการใช้ภาษาสเปนระดับพื้นฐาน",
                            "ฝึกทักษะการฟัง พูด อ่าน เขียน",
                            "เน้นคำศัพท์และสำนวนที่ใช้ในชีวิตประจำวัน",
                            "สามารถสร้างประโยคง่ายๆ ได้"
                        ]
                    },
                    "สป.172_ภาษาสเปน_2": {
                        "รหัสวิชา": "สป.172",
                        "ชื่อวิชา": "ภาษาสเปน 2",
                        "หน่วยกิต": "3 (2-3-4)",
                        "วิชาบังคับก่อน": "สอบได้วิชา สป. 171",
                        "เนื้อหา": [
                            "หลักไวยากรณ์และการใช้ภาษาสเปนระดับพื้นฐานต่อจากภาษาสเปน 1",
                            "ฝึกทักษะการฟัง พูด อ่าน เขียน",
                            "สื่อสารเรื่องราวในชีวิตประจำวันได้",
                            "สามารถสร้างประโยคที่มีโครงสร้างซับซ้อนขึ้น"
                        ]
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 17,
        "details": [
            {
                "category": "มธ.112 มรดกโลกก่อนสมัยใหม่",
                "subcategories": {
                    "รหัสวิชา": "มธ.112",
                    "ชื่อวิชาภาษาไทย": "มรดกโลกก่อนสมัยใหม่",
                    "ชื่อวิชาภาษาอังกฤษ": "Heritage of the Pre-modern World",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา_ภาษาไทย": "ปัญหาและผลสำเร็จในการแก้ปัญหาที่สำคัญในสังคมโลกก่อนสมัยใหม่ อันเป็นมรดกตกทอดมาสู่สังคมโลกปัจจุบัน ทั้งในสถาบันศาสนา ภูมิปัญญา วัฒนธรรม สังคม เศรษฐกิจ และการเมือง",
                    "คำอธิบายรายวิชา_ภาษาอังกฤษ": "To study significant problems and solutions in the Pre-modern World Society, which have been passed on to various institutions, including those responsible for religion, intellect, culture, society, economics, and politics in the Present World Society."
                }
            },
            {
                "category": "มธ.113 ความรู้พื้นฐานทางปรัชญาและศาสนา",
                "subcategories": {
                    "รหัสวิชา": "มธ.113",
                    "ชื่อวิชาภาษาไทย": "ความรู้พื้นฐานทางปรัชญาและศาสนา",
                    "ชื่อวิชาภาษาอังกฤษ": "Fundamentals of Philosophy and Religions",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา_ภาษาไทย": "แนวคิดทางปรัชญาและศาสนาที่มีความสำคัญต่อมนุษย์ในแง่ทัศนคติ จริยธรรม และการดำรงชีวิต เพื่อให้นักศึกษารู้จักคิด วิเคราะห์ และวิจารณ์ปรากฏการณ์ต่างๆ อย่างมีหลักเกณฑ์ และสามารถประยุกต์ความรู้ ความเข้าใจในการศึกษาให้เป็นประโยชน์ต่อการดำรงชีวิตร่วมกับผู้อื่นในสังคม",
                    "คำอธิบายรายวิชา_ภาษาอังกฤษ": "To equip learners with the vital philosophical and religious concepts, which have influenced attitudes, morality, and ways of life. To train learners to think analytically and critically towards certain phenomena in order that they can apply their knowledge and understanding to their own social situations."
                }
            },
            {
                "category": "มธ.115 มนุษย์กับผลงานสร้างสรรค์ด้านวรรณกรรม",
                "subcategories": {
                    "รหัสวิชา": "มธ.115",
                    "ชื่อวิชาภาษาไทย": "มนุษย์กับผลงานสร้างสรรค์ด้านวรรณกรรม",
                    "ชื่อวิชาภาษาอังกฤษ": "Man and his Literary Creativity",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา_ภาษาไทย": "เรื่องราวของมนุษย์ที่สะท้อนในผลงานสร้างสรรค์เชิงวรรณกรรมจากสื่อสิ่งพิมพ์ ภาพยนตร์ สื่ออิเล็กทรอนิกส์และสื่อสมัยใหม่อื่นๆ เพื่อเปรียบเทียบให้เห็นโลกทัศน์ ค่านิยม ความเชื่อ และศรัทธาของผู้สร้างสรรค์ด้านวรรณกรรมโดยศึกษาเชื่อมโยงมนุษย์กับผลงานสร้างสรรค์ด้านวรรณกรรมในเชิงความสัมพันธ์ที่มีคุณค่าต่อการดำรงชีวิตในปัจจุบัน",
                    "คำอธิบายรายวิชา_ภาษาอังกฤษ": "To study anecdotal stories, reflected through creative literary works in the print media, films, electronic media and other modern media in order to compare the past and present world views regarding social values, beliefs as well as faiths of those artists and creators. To explore the association of people and those creative works in terms of their relationship with our ways of life today."
                }
            },
            {
                "category": "มธ.116 มนุษย์กับศิลปะ: ทัศนศิลป์ ดนตรี และศิลปะการแสดง",
                "subcategories": {
                    "รหัสวิชา": "มธ.116",
                    "ชื่อวิชาภาษาไทย": "มนุษย์กับศิลปะ: ทัศนศิลป์ ดนตรี และศิลปะการแสดง",
                    "ชื่อวิชาภาษาอังกฤษ": "Man and Arts : Visual Art, Music and Performing Arts",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา_ภาษาไทย": "ศิลปะ บทบาทและความสัมพันธ์ของศิลปะกับพัฒนาการของมนุษย์ สังคมและสิ่งแวดล้อม โดยศึกษาจากผลงานศิลปกรรมด้านทัศนศิลป์ ดนตรี และศิลปะการแสดงซึ่งเป็นสิ่งแสดงถึงวัฒนธรรมและพุทธิปัญญาของมนุษยชาติ ผู้เรียนจะได้ประจักษ์ในคุณค่าของศิลปะด้วยประสบการณ์ของตน ได้ตรึกตรองและซาบซึ้งในสุนทรียรส",
                    "คำอธิบายรายวิชา_ภาษาอังกฤษ": "This course is incomplete in the provided document."
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 24,
        "details": [
            {
                "category": "ภาษาไทย (Thai)",
                "subcategories": {
                    "ท.201 การพัฒนาสมรรถภาพการเขียน": {
                        "ชื่อภาษาอังกฤษ": "TH 201 Writing Proficiency Development",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "ความรู้เกี่ยวกับการเขียน การจัดลำดับความคิด การถ่ายทอดความคิด และการฝึกทักษะการเขียนเบื้องต้น",
                        "คำอธิบายภาษาอังกฤษ": "Knowledge relating to writing, the alignment of ideas, the communication of ideas; and practice of basic writing skills."
                    },
                    "ท.202 การพัฒนาสมรรถภาพการอ่าน": {
                        "ชื่อภาษาอังกฤษ": "TH 202 Reading Proficiency Development",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "ความรู้เกี่ยวกับการอ่าน การพัฒนาสมรรถภาพการอ่านสารประเภทต่างๆ การฝึกทักษะการอ่าน และการส่งเสริมวัฒนธรรมการอ่าน",
                        "คำอธิบายภาษาอังกฤษ": "Knowledge relating to reading, development of reading proficiency for various types of messages, practice of reading skills and promotion of a reading culture."
                    },
                    "ท.203 การอ่านเชิงวิจารณ์เบื้องต้น": {
                        "ชื่อภาษาอังกฤษ": "TH 203 Basic Critical Reading",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "ความรู้เกี่ยวกับการอ่านเชิงวิเคราะห์และวิจารณ์ การฝึกทักษะการอ่านเชิงวิเคราะห์และวิจารณ์",
                        "คำอธิบายภาษาอังกฤษ": "Knowledge relating to analytical and critical reading, practice of analytical and critical reading skills"
                    }
                }
            },
            {
                "category": "ภาษาต่างประเทศ",
                "subcategories": {
                    "ภาษาจีน (Chinese)": {
                        "จน.171 ภาษาจีน 1": {
                            "ชื่อภาษาอังกฤษ": "CH171 Chinese 1",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คำอธิบายรายวิชา": "ทักษะพื้นฐานภาษาจีนด้านการออกเสียง วิธีการเขียนตัวอักษรจีน โครงสร้างประโยค ตลอดจนวงศัพท์ประมาณ 450 คำ",
                            "คำอธิบายภาษาอังกฤษ": "Basic skills of Chinese language including phonetics, Chinese characters, grammar and a vocabulary of 450 words."
                        },
                        "จน.172 ภาษาจีน 2": {
                            "ชื่อภาษาอังกฤษ": "CH172 Chinese 2",
                            "หน่วยกิต": "3 (3-0-6)",
                            "วิชาบังคับก่อน": "สอบได้ จน.171 หรือผ่านการทดสอบ หรือได้รับอนุมัติจากผู้บรรยาย"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 12,
        "details": [
            {
                "category": "ข้อปฏิบัติเรื่องการเรียนด้านภาษาอังกฤษ และด้านการคิด อ่าน และเขียนอย่างมีวิจารณญาณ",
                "subcategories": {
                    "ข้อ_1": "ตรวจสอบผลการจัดระดับจากเว็บไซต์ของสำนักงานทะเบียนนักศึกษา (www.reg.tu.ac.th) และจากคณะหรืออาจารย์ที่ปรึกษา",
                    "ข้อ_2": "การจดทะเบียนเรียนรายวิชาศึกษาทั่วไป นักศึกษาที่ได้รับการจัดชั้นเรียนตามเกณฑ์การจัดเรียนวิชาที่มหาวิทยาลัยกำหนด",
                    "ข้อ_3": "นักศึกษาต้องจดทะเบียนเรียนตามหมวด (section) และ กลุ่ม (group) ตามที่สำนักงานทะเบียนนักศึกษา กำหนดไว้เท่านั้น"
                }
            },
            {
                "category": "คำอธิบายรายวิชา",
                "subcategories": {
                    "หมวดสังคมศาสตร์": {
                        "มธ.100 พลเมืองกับการลงมือแก้ปัญหา": {
                            "รหัสวิชา": "TU100",
                            "ชื่อภาษาอังกฤษ": "Civic Engagement",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คำอธิบายภาษาไทย": "ปลูกฝังจิตสำนึก บทบาท และหน้าที่ความรับผิดชอบของการเป็นสมาชิกที่ดีของสังคมในฐานะพลเมืองโลกผ่านกระบวนการหลากหลายวิธี เช่น การบรรยาย การอภิปรายกรณีศึกษาต่างๆ ดูงานเป็นต้น โดยนักศึกษาจะต้องจัดทำโครงการรณรงค์ เพื่อให้เกิดการรับรู้ หรือเกิดการเปลี่ยนแปลง ในประเด็นที่สนใจ",
                            "คำอธิบายภาษาอังกฤษ": "Instillation of social conscience and awareness of one's role and duties as a good global citizen. This is done through a variety of methods such as lectures, discussion of various case studies and field study outings. Students are required to organise a campaign to raise awareness or bring about change in an area of their interest."
                        },
                        "มธ.101 โลก อาเซียน และไทย": {
                            "รหัสวิชา": "TU101",
                            "ชื่อภาษาอังกฤษ": "Thailand, ASEAN, and the World",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คำอธิบายภาษาไทย": "ศึกษาปรากฏการณ์ที่สำคัญของโลก อาเซียนและไทย ในมิติทางการเมือง เศรษฐกิจ สังคมวัฒนธรรม โดยใช้กรอบแนวคิด ทฤษฎี และระเบียบวิจัยทางสังคมศาสตร์ ผ่านการอภิปรายและยกตัวอย่างสถานการณ์หรือบุคคลที่ได้รับความสนใจ เพื่อให้เกิดมุมมองต่อความหลากหลายและเข้าใจความซับซ้อนที่สัมพันธ์กันทั้งโลก มีจิตสำนึกสากล (GLOBAL MINDSET) สามารถท้าทายกรอบความเชื่อเดิมและเปิดโลกทัศน์ใหม่ให้กว้างขวางขึ้น",
                            "คำอธิบายภาษาอังกฤษ": "Study of significant phenomena around the world, in the ASEAN region and in Thailand in terms of their political, economic and sociocultural dimensions. This is done through approaches, theories and principles of social science research via discussion and raising examples of situations or people of interest. The purpose of this is to create a perspective of diversity, to understand the complexity of global interrelationships, to build a global mindset and to be able to challenge old paradigms and open up a new, broader worldview."
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 30,
        "details": [
            {
                "category": "ภาษาพม่า (Burmese)",
                "subcategories": {
                    "อซ.175 ภาษาพม่า 1": {
                        "รหัสวิชา": "AS175",
                        "ชื่อวิชาภาษาอังกฤษ": "Burmese 1",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "ภาษาพม่าเบื้องต้น เพื่อสร้างทักษะด้านการฟัง พูด อ่าน เขียน และโครงสร้างพื้นฐานของภาษาพม่า",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Introduction to elementary Burmese language to provide usage skills to listening, speaking, reading, writing and fundamental structures of Burmese language"
                    },
                    "อซ.176 ภาษาพม่า 2": {
                        "รหัสวิชา": "AS176",
                        "ชื่อวิชาภาษาอังกฤษ": "Burmese 2",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้วิชา อซ. 175",
                        "คำอธิบายรายวิชา": "ภาษาพม่าเบื้องต้นต่อเนื่องจากภาษาพม่า 1 เพื่อให้สามารถนำมาใช้ในชีวิตประจำวันได้",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Studying elementary Burmese language in continuation from Burmese 1 to acquire basic usage skills of the language in daily life",
                        "Pre-requisite": "have earned credits of AS175"
                    }
                }
            },
            {
                "category": "ภาษามลายู (Malay)",
                "subcategories": {
                    "อซ.177 ภาษามลายู 1": {
                        "รหัสวิชา": "AS177",
                        "ชื่อวิชาภาษาอังกฤษ": "Malay 1",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "ภาษามลายูเบื้องต้น เพื่อสร้างทักษะด้านการฟัง พูด อ่าน เขียน และโครงสร้างพื้นฐานของภาษามลายู",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Introduction to elementary Malay language to provide usage skills to listening, speaking, reading, writing and fundamental structures of Malay language"
                    },
                    "อซ.178 ภาษามลายู 2": {
                        "รหัสวิชา": "AS178",
                        "ชื่อวิชาภาษาอังกฤษ": "Malay 2",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้วิชา อซ. 177",
                        "คำอธิบายรายวิชา": "ภาษามลายูเบื้องต้นต่อเนื่องจากภาษามลายู 1 เพื่อให้สามารถนำมาใช้ในชีวิตประจำวันได้",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Studying elementary Malay language in continuation from Malay 1 to acquire basic usage skills of the language in daily life",
                        "Pre-requisite": "have earned credits of AS177"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 3,
        "details": [
            {
                "category": "โครงสร้างและข้อกำหนดของหลักสูตร",
                "subcategories": {
                    "โครงสร้าง": {
                        "ส่วนที่_1": {
                            "description": "หลักสูตรกลางของมหาวิทยาลัย ที่กำหนดให้นักศึกษาทุกคนต้องเรียนจำนวน 21 หน่วยกิต",
                            "หมวดสังคมศาสตร์": "3 วิชา บังคับ 1 วิชา 3 หน่วยกิต",
                            "หมวดมนุษยศาสตร์": "2 วิชา บังคับเลือกอย่างน้อย 1 วิชา 3 หน่วยกิต",
                            "หมวดวิทยาศาสตร์กับคณิตศาสตร์": "2 วิชา บังคับเลือกอย่างน้อย 1 วิชา 3 หน่วยกิต",
                            "หมวดภาษา": "3 วิชา บังคับ 2 วิชา 6 หน่วยกิต",
                            "หมายเหตุ": "หลักสูตรต่าง ๆ ของคณะ อาจเปิดเสรีให้นักศึกษาเลือกเรียนวิชาศึกษาทั่วไปตามความสนใจของนักศึกษาได้จำนวน 0 - 6 หน่วยกิต หรือเลือกวิชาต่าง ๆ จากแต่ละหมวดเพื่อให้ได้จำนวนหน่วยกิตรวม 21 หน่วยกิต"
                        },
                        "ส่วนที่_2": "หลักสูตรของคณะ ไม่น้อยกว่า 9 หน่วยกิต (รายละเอียดตามข้อกำหนดหลักสูตรของแต่ละคณะ)"
                    },
                    "รายวิชาในหลักสูตรวิชาศึกษาทั่วไป_ส่วนที่_1": {
                        "หมวดสังคมศาสตร์": {
                            "บังคับ": "1 วิชา 3 หน่วยกิต",
                            "รายวิชา": [
                                {
                                    "รหัสวิชา": "มธ.100",
                                    "ชื่อวิชา": "พลเมืองกับการลงมือแก้ปัญหา",
                                    "หน่วยกิต": "3 (3-0-6)"
                                },
                                {
                                    "รหัสวิชา": "มธ.101",
                                    "ชื่อวิชา": "โลก,อาเซียน และไทย",
                                    "หน่วยกิต": "3 (3-0-6)"
                                },
                                {
                                    "รหัสวิชา": "มธ.109",
                                    "ชื่อวิชา": "นวัตกรรมกับกระบวนคิดผู้ประกอบการ",
                                    "หน่วยกิต": "3 (3-0-6)"
                                }
                            ]
                        },
                        "หมวดมนุษยศาสตร์": {
                            "บังคับเลือก": "1 วิชา 3 หน่วยกิต",
                            "รายวิชา": [
                                {
                                    "รหัสวิชา": "มธ.102",
                                    "ชื่อวิชา": "ทักษะชีวิตทางสังคม",
                                    "หน่วยกิต": "3 (3-0-6)"
                                },
                                {
                                    "รหัสวิชา": "มธ.108",
                                    "ชื่อวิชา": "การพัฒนาและจัดการตนเอง",
                                    "หน่วยกิต": "3 (3-0-6)"
                                }
                            ]
                        },
                        "หมวดวิทยาศาสตร์กับคณิตศาสตร์": {
                            "บังคับเลือก": "อย่างน้อย 1 วิชา 3 หน่วยกิต",
                            "รายวิชา": [
                                {
                                    "รหัสวิชา": "มธ.103",
                                    "ชื่อวิชา": "ชีวิตกับความยั่งยืน",
                                    "หน่วยกิต": "3 (3-0-6)"
                                },
                                {
                                    "รหัสวิชา": "มธ.107",
                                    "ชื่อวิชา": "ทักษะดิจิทัลกับการแก้ปัญหา",
                                    "หน่วยกิต": "3 (3-0-6)"
                                }
                            ]
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 11,
        "details": [
            {
                "category": "ข้อกำหนดการเรียนวิชาเลือกเสรี",
                "subcategories": {
                    "จำนวนหน่วยกิต": "กรณีนักศึกษาเรียนเป็นวิชาเลือกเสรี โดยยังไม่เคยเรียนวิชาในหมวดนี้มาก่อน จะเรียนได้ไม่เกิน 6 หน่วยกิต"
                }
            },
            {
                "category": "ข้อกำหนดเรื่องการใช้ผลคะแนนวิชาด้านทักษะการสื่อสารด้วยภาษาอังกฤษ และด้านการคิด อ่าน เขียนอย่างมีวิจารณญาณ",
                "subcategories": {
                    "ผลคะแนนที่ใช้ได้": "O-NET, TU-GET PBT, TU-GET CBT, TOEFL IBT, IELTS และ SAT Reading",
                    "วัตถุประสงค์": "เพื่อนำมาพิจารณาการจัดการเรียนที่ตรงตามสมรรถนะของนักศึกษา",
                    "เกณฑ์การใช้": "เป็นไปตามประกาศมหาวิทยาลัยธรรมศาสตร์"
                }
            },
            {
                "category": "ข้อกำหนดและแนวปฏิบัติเรื่องเกณฑ์พิจารณาผลคะแนน",
                "subcategories": {
                    "กำหนดเวลารับผลคะแนน": "ต้องเป็นไปตามประกาศที่มหาวิทยาลัยกำหนดไว้ในแต่ละปีเท่านั้น ไม่สามารถขอยื่นผลคะแนนเป็นกรณีพิเศษในภายหลังจากที่กำหนดไว้ได้",
                    "การยื่นผลคะแนน": "นักศึกษายื่นได้ 1 ครั้ง โดยเลือกได้ 1 ประเภทเท่านั้น และยื่นผลคะแนนที่คณะต้นสังกัด ในวันสอบสัมภาษณ์",
                    "กรณีไม่ยื่นผลคะแนน": "มหาวิทยาลัยจะจัดการเรียนรายวิชา มธ.104 มธ.050 และ มธ.105 ตามความเหมาะสม"
                }
            },
            {
                "category": "การเทียบโอนหน่วยกิต",
                "subcategories": {
                    "นักศึกษาเคยศึกษามหาวิทยาลัยธรรมศาสตร์": {
                        "ระยะเวลา": "ไม่เกิน 2 ปี",
                        "วิชาที่เทียบโอนได้": {
                            "มธ.050": "ต้องมีผลการศึกษาเป็น S",
                            "มธ.104 และ มธ.105": "ต้องมีผลการศึกษาได้ระดับเกรด C ขึ้นไป"
                        }
                    },
                    "ขั้นตอนการเทียบโอน": "ต้องแจ้งและยื่นคะแนนที่ต้องการเทียบโอนให้แก่คณะต้นสังกัด และให้คณะต้นสังกัดดำเนินการสรุปและส่งเอกสารตามวันและเวลาที่มหาวิทยาลัยกำหนดเพื่อจัดรายวิชาและบันทึก ACC ในใบรายงานผลการศึกษา",
                    "ข้อจำกัด": "ไม่รับเทียบโอนหน่วยกิตวิชาจากมหาวิทยาลัยอื่นกับวิชา มธ.104 มธ.050 และ มธ.105"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 9,
        "details": [
            {
                "category": "ภาษาต่างประเทศอื่นๆ",
                "subcategories": {
                    "สำหรับนักศึกษาที่ได้รับอนุมัติให้ไปศึกษา ณ ต่างประเทศ": {
                        "ภต.171": "ภาษาต่างประเทศ 1 3 (3-0-6)",
                        "ภต.172": "ภาษาต่างประเทศ 2 3 (3-0-6)"
                    },
                    "หมายเหตุ": "นักศึกษาที่ได้รับอนุมัติให้ไปศึกษา ณ ต่างประเทศ โดยเรียนภาษาต่างประเทศอื่นๆ ที่ไม่ปรากฏในหมวดภาษาตามเล่มหลักสูตรนี้ คณะต้นสังกัดของนักศึกษาสามารถพิจารณาเทียบโอนรายวิชา หน่วยกิต และเกรดให้เป็นไปตามข้อบังคับมหาวิทยาลัยธรรมศาสตร์ว่าด้วยการศึกษาชั้นปริญญาตรี พ.ศ.2561 โดยผ่านกระบวนการพิจารณาจากคณะกรรมการวิชาการประจำคณะนั้นๆ"
                }
            },
            {
                "category": "หมวดพลานามัย",
                "subcategories": {
                    "กรณีเรียนเป็นวิชาศึกษาทั่วไปส่วนที่ 2": "นับหน่วยกิตได้ไม่เกิน 3 หน่วยกิต",
                    "รายวิชา": {
                        "วฬ.211": "กรีฑา 1 (0-2-1)",
                        "วฬ.212": "ว่ายน้ำ 1 (0-2-1)",
                        "วฬ.213": "ฟุตบอล 1 (0-2-1)",
                        "วฬ.214": "บาสเกตบอล 1 (0-2-1)",
                        "วฬ.215": "รักบี้ฟุตบอล 1 (0-2-1)",
                        "วฬ.216": "วอลเลย์บอล 1 (0-2-1)",
                        "วฬ.217": "เบสบอล 1 (0-2-1)",
                        "วฬ.218": "ฟุตซอล 1 (0-2-1)",
                        "วฬ.219": "ซอฟท์บอล 1 (0-2-1)",
                        "วฬ.220": "เทนนิส 1 (0-2-1)"
                    },
                    "คณะที่รับผิดชอบ": "สหเวชศาสตร์"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 21,
        "details": [
            {
                "category": "มธ.152 หลักพื้นฐานทางคณิตศาสตร์",
                "subcategories": {
                    "รหัสวิชา": "มธ.152",
                    "ชื่อวิชาภาษาไทย": "หลักพื้นฐานทางคณิตศาสตร์",
                    "ชื่อวิชาภาษาอังกฤษ": "Fundamental Mathematics",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คุณสมบัติผู้เรียน": "สำหรับนักศึกษาที่เคยเรียนคณิตศาสตร์ในระดับมัธยมศึกษาตอนปลายไม่ต่ำกว่า 16 หน่วยกิตหรือเป็นวิชาที่คณะ/สาขาวิชาบังคับให้เรียน",
                    "เนื้อหาวิชา": {
                        "ตรรกศาสตร์": "หลักเกณฑ์ทางตรรกศาสตร์ที่ใช้ในการพิสูจน์ วิธีการพิสูจน์แบบต่าง ๆ การอ้างเหตุผล การอุปนัยเชิงคณิตศาสตร์",
                        "ทฤษฎี": "การพิสูจน์ในทฤษฎีเกี่ยวกับอสมการและค่าสัมบูรณ์",
                        "การแก้ปัญหา": "การแก้อสมการ",
                        "ฟังก์ชัน": "ฟังก์ชัน ฟังก์ชันชนิดต่างๆ โจทย์ประยุกต์ของฟังก์ชัน การเขียนกราฟของฟังก์ชัน",
                        "เศษส่วน": "การแยกเศษส่วนออกเป็นเศษส่วนย่อย",
                        "ระบบสมการ": "การแก้ระบบสมการเชิงเส้นอย่างง่าย"
                    }
                }
            },
            {
                "category": "มธ.153 ความรู้ทั่วไปเกี่ยวกับคอมพิวเตอร์",
                "subcategories": {
                    "รหัสวิชา": "มธ.153",
                    "ชื่อวิชาภาษาไทย": "ความรู้ทั่วไปเกี่ยวกับคอมพิวเตอร์",
                    "ชื่อวิชาภาษาอังกฤษ": "General Concepts of Computer",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหาวิชา": {
                        "องค์ประกอบคอมพิวเตอร์": "องค์ประกอบที่สำคัญของระบบคอมพิวเตอร์ ฮาร์ดแวร์ ซอฟต์แวร์",
                        "การประมวลผลข้อมูล": "ข้อมูลและการประมวลผลพื้นฐาน",
                        "การสื่อสารข้อมูล": "การสื่อสารข้อมูล ระบบเครือข่าย อินเตอร์เน็ต",
                        "การแก้ปัญหา": "หลักการแก้ปัญหาด้วยคอมพิวเตอร์",
                        "การประยุกต์ใช้": "การประยุกต์ใช้ซอฟต์แวร์สำเร็จรูป",
                        "ความปลอดภัยและกฎหมาย": "ความปลอดภัย จรรยาบรรณและกฎหมายที่เกี่ยวข้องกับการใช้งานคอมพิวเตอร์และระบบสารสนเทศ"
                    }
                }
            },
            {
                "category": "มธ.154 รากฐานคณิตศาสตร์",
                "subcategories": {
                    "รหัสวิชา": "มธ.154",
                    "ชื่อวิชาภาษาไทย": "รากฐานคณิตศาสตร์",
                    "ชื่อวิชาภาษาอังกฤษ": "Foundation of Mathematics",
                    "หน่วยกิต": "3 (3-0-6)",
                    "เนื้อหาวิชา": {
                        "ทฤษฎีบท": "ทฤษฎีบททวินามและทฤษฎีบทอเนกนาม",
                        "ภาคตัดกรวย": "การร่างกราฟของภาคตัดกรวย การเลื่อนแกน การหมุนแกน",
                        "ฟังก์ชัน": "การเขียนกราฟ ฟังก์ชันเพิ่ม ฟังก์ชันลด",
                        "เศษส่วน": "การแยกเศษส่วนออกเป็นเศษส่วนย่อย",
                        "ตรรกศาสตร์": "หลักเกณฑ์ทางตรรกศาสตร์ที่ใช้ในการพิสูจน์ วิธีการพิสูจน์แบบต่างๆ ตัวบ่งปริมาณ การอ้างเหตุผลและอุปนัยเชิงคณิตศาสตร์",
                        "ระบบจำนวน": "โครงสร้างของระบบจำนวนจริง",
                        "ทฤษฎีจำนวน": "ทฤษฎีจำนวนเบื้องต้น"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 40,
        "details": [
            {
                "category": "4.ทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ",
                "subcategories": {
                    "4.1_ผลการเรียนรู้ด้านทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": [
                        "รับฟังความคิดเห็นของผู้อื่นและยอมรับความแตกต่าง",
                        "มีความเป็นผู้นำ และกล้าทำ กล้าแสดงออกในสิ่งที่ถูกต้อง",
                        "มีความรับผิดชอบในงาน ในหน้าที่ที่ได้รับมอบหมาย",
                        "มีวุฒิภาวะทางอารมณ์ มีความสามารถในการปรับตัว การควบคุมอารมณ์และความอดทน",
                        "ใช้สิทธิเสรีภาพโดยไม่กระทบผู้อื่น และมีความเป็นพลเมืองดี"
                    ],
                    "4.2_กลยุทธ์การสอนที่ใช้ในการพัฒนาการเรียนรู้ด้านทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": [
                        "การมอบหมายงานให้ทำงาน/โครงงานกลุ่ม",
                        "การจัดประสบการณ์การเรียนรู้ปัญหาต่างๆ",
                        "การจัดกิจกรรมเสริมหลักสูตรในเรื่องภาวะผู้นำ",
                        "การสอนแบบกลุ่มร่วมมือ",
                        "ให้ความรู้เกี่ยวกับการพึ่งตนเอง",
                        "การสอนแบบเน้นผู้เรียนเป็นสำคัญ",
                        "การเปิดโอกาสให้แสดงความคิดเห็น",
                        "การบรรยาย/การอภิปราย ยกตัวอย่างผลกระทบในเรื่องสิทธิ เสรีภาพ",
                        "การจัดประสบการณ์การเรียนรู้ปัญหาของชุมชนของผู้เรียน",
                        "สอนและฝึกปฎิบัติเกี่ยวกับการเคารพสิทธิของผู้อื่น ความแตกต่างของบุคคล เคารพหลักความเสมอภาค การเคารพกติกา"
                    ],
                    "4.3_กลยุทธ์การประเมินผลการเรียนรู้ด้านทักษะความสัมพันธ์ระหว่างบุคคลและความรับผิดชอบ": [
                        "ประเมินจากการสังเกต พฤติกรรม",
                        "ประเมินความสามารถในการแสดงออกในบทบาทภาวะผู้นำ และผู้ตามในในบทบาทภาวะผู้นำ และผู้ตามในสถานการณ์ต่างๆ",
                        "นักศึกษาประเมินตนเอง",
                        "ประเมินตามสภาพจริงจากผลงาน",
                        "ประเมินจากการมีส่วนร่วม การยอมรับการแสดงออกในเรื่องการใช้สิทธิเสรีภาพ",
                        "ประเมินจากผลงาน/รายงาน/ที่ได้รับมอบหมาย"
                    ]
                }
            },
            {
                "category": "5. ทักษะในการวิเคราะห์เชิงตัวเลข การสื่อสาร และการใช้เทคโนโลยีสารสนเทศ",
                "subcategories": {
                    "5.1_ผลการเรียนรู้ด้านทักษะในการวิเคราะห์เชิงตัวเลข_การสื่อสาร_และการใช้เทคโนโลยีสารสนเทศ": [
                        "มีความรู้ทักษะในการใช้ภาษาไทยและภาษาต่างประเทศ"
                    ]
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 43,
        "details": [
            {
                "category": "ทักษะทางคณิตศาสตร์",
                "subcategories": {
                    "การคิดคำนวณ": "มีทักษะในการคิดคำนวณ",
                    "การคิดวิเคราะห์": "มีทักษะในการคิดวิเคราะห์เชิงคณิตศาสตร์และสถิติ",
                    "การจัดการข้อมูล": "เก็บรวบรวมข้อมูลและนำเสนอข้อมูล"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 27,
        "details": [
            {
                "category": "ภาษารัสเซีย",
                "subcategories": {
                    "รหัสวิชา": "RS172",
                    "ชื่อวิชา": "ภาษารัสเซีย 2",
                    "หน่วยกิต": "3 (3-0-6)",
                    "วิชาบังคับก่อน": "สอบได้ RS171",
                    "คำอธิบายรายวิชา": {
                        "ภาษาไทย": "ฝึกทักษะทางด้านการพูด ฟัง อ่าน และเขียนในระดับสูงขึ้น ในระดับนี้นักศึกษาจะสามารถใช้ภาษาง่ายๆในชีวิตประจำวันได้ (บรรยายและฝึกฝน 6 ชั่วโมงต่อสัปดาห์)",
                        "ภาษาอังกฤษ": "This course aims to further develop students' skills--speaking, listening, reading, and writing-- at a more advanced level. In this course, students are expected to be able to communicate in Russian in everyday situations. (Lecture and practice 6 hours per week)"
                    }
                }
            },
            {
                "category": "ภาษาเยอรมัน",
                "subcategories": {
                    "ย.171": {
                        "ชื่อวิชา": "ภาษาเยอรมัน 1",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": {
                            "ภาษาไทย": "ทักษะการฟัง การพูด การอ่าน และการเขียนภาษาเยอรมันเบื้องต้น ไวยากรณ์เยอรมันเบื้องต้น ศัพท์และสำนวนภาษาเยอรมันระดับต้นสำหรับผู้เริ่มเรียน การใช้ภาษาเยอรมันในสถานการณ์ประจำวันง่ายๆ",
                            "ภาษาอังกฤษ": "Basic skills in listening, speaking, reading and writing German. Basic German grammar. Vocabulary and expressions for beginners. Simple everyday conversations."
                        }
                    },
                    "ย.172": {
                        "ชื่อวิชา": "ภาษาเยอรมัน 2",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ ย. 171 หรือผ่านการทดสอบ หรือได้รับอนุมัติจากสาขาวิชา",
                        "คำอธิบายรายวิชา": {
                            "ภาษาไทย": "ทักษะการฟัง การพูด การอ่าน และการเขียนภาษาเยอรมันเบื้องต้น ไวยากรณ์เยอรมันเบื้องต้น ศัพท์และสำนวนภาษาเยอรมันระดับต้นสำหรับผู้เริ่มเรียนในระดับที่สูงขึ้น การใช้ภาษาเยอรมันในสถานการณ์ประจำวันง่ายๆ ความรู้เบื้องต้นเกี่ยวกับชีวิตความเป็นอยู่และทัศนคติของชาวเยอรมัน",
                            "ภาษาอังกฤษ": "Basic skills in listening, speaking, reading and writing German. Basic German grammar. Vocabulary and expressions for beginners in the higher level. Simple everyday conversations. Basic knowledge of lifestyles and attitude of the Germans."
                        }
                    },
                    "ย.111": {
                        "ชื่อวิชา": "ภาษาเยอรมันพื้นฐาน 1",
                        "หน่วยกิต": "3 (3-0-6)",
                        "วิชาบังคับก่อน": "สอบได้ ย. 172 หรือสอบผ่านภาษาเยอรมันระดับมัธยมปลาย หรือได้รับอนุมัติจากสาขาวิชา",
                        "คำอธิบายรายวิชา": {
                            "ภาษาไทย": "ไวยากรณ์พื้นฐานและโครงสร้างภาษาเยอรมัน ศัพท์ที่ใช้ในชีวิตประจำวัน การสนทนาในชีวิตประจำวัน การอ่านตัวบทขนาดสั้นที่ไม่ซับซ้อน การเขียนประโยคและย่อหน้าขนาดสั้นที่ถูกต้องตามหลักไวยากรณ์",
                            "ภาษาอังกฤษ": "Basic German grammar and structure. Everyday vocabulary. Daily life conversations. Reading short, uncomplicated texts. Writing grammatically correct short sentences and paragraphs."
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 10,
        "details": [
            {
                "category": "วิชาพลานามัย",
                "subcategories": {
                    "วฬ.220_เทนนิส": {
                        "รหัสวิชา": "วฬ.220",
                        "ชื่อวิชา": "เทนนิส",
                        "ชื่อวิชาภาษาอังกฤษ": "SN 220 Tennis",
                        "หน่วยกิต": "1 (0-2-1)",
                        "คณะที่รับผิดชอบ": "สหเวชศาสตร์"
                    },
                    "วฬ.221_แบดมินตัน": {
                        "รหัสวิชา": "วฬ.221",
                        "ชื่อวิชา": "แบดมินตัน",
                        "ชื่อวิชาภาษาอังกฤษ": "SN221 Badminton",
                        "หน่วยกิต": "1 (0-2-1)",
                        "คณะที่รับผิดชอบ": "สหเวชศาสตร์"
                    },
                    "วฬ.222_เทเบิลเทนนิส": {
                        "รหัสวิชา": "วฬ.222",
                        "ชื่อวิชา": "เทเบิลเทนนิส",
                        "ชื่อวิชาภาษาอังกฤษ": "SN222 Table Tennis",
                        "หน่วยกิต": "1 (0-2-1)",
                        "คณะที่รับผิดชอบ": "สหเวชศาสตร์"
                    }
                }
            },
            {
                "category": "หมวดพัฒนานักศึกษาและการเสริมสร้างทักษะและประสบการณ์",
                "subcategories": {
                    "พท.107_การเจริญสติและฝึกสมาธิ": {
                        "รหัสวิชา": "พท.107",
                        "ชื่อวิชา": "การเจริญสติและฝึกสมาธิ",
                        "ชื่อวิชาภาษาอังกฤษ": "PE107 Mindfulness and Meditation",
                        "หน่วยกิต": "1 (0-2-1)",
                        "คณะที่รับผิดชอบ": "ฝ่ายวิชาการ"
                    },
                    "พท.240_งานอาสาสมัครกับการพัฒนาสังคม": {
                        "รหัสวิชา": "พท.240",
                        "ชื่อวิชา": "งานอาสาสมัครกับการพัฒนาสังคม",
                        "ชื่อวิชาภาษาอังกฤษ": "PE240 Volunteerism and social development",
                        "หน่วยกิต": "3 (2-2-5)",
                        "คณะที่รับผิดชอบ": "วิทยาลัยพัฒนศาสตร์ป๋วย อึ๊งภากรณ์"
                    },
                    "พท.242_การเสริมสร้างทักษะในการประกอบอาชีพ": {
                        "รหัสวิชา": "พท.242",
                        "ชื่อวิชา": "การเสริมสร้างทักษะในการประกอบอาชีพ",
                        "ชื่อวิชาภาษาอังกฤษ": "PE242 Preparative for work achievement",
                        "หน่วยกิต": "2 (2-0-4)",
                        "คณะที่รับผิดชอบ": "ฝ่ายวิชาการ"
                    },
                    "พท.245_นักศึกษากับการพัฒนาตน": {
                        "รหัสวิชา": "พท.245",
                        "ชื่อวิชา": "นักศึกษากับการพัฒนาตน",
                        "ชื่อวิชาภาษาอังกฤษ": "PE245 Student and self-development",
                        "หน่วยกิต": "2 (2-0-4)",
                        "คณะที่รับผิดชอบ": "ฝ่ายวิชาการ"
                    }
                }
            },
            {
                "category": "ข้อกำหนดทั่วไปเรื่องหลักสูตร",
                "subcategories": {
                    "วิชาที่ไม่นับเป็นวิชาเลือกเสรี_วิชาเลือก_วิชาโท": "วิชาในหลักสูตรวิชาศึกษาทั่วไปทั้งส่วนที่ 1 และส่วนที่ 2 ที่ใช้รหัสย่อ 'มธ.' ระดับ 100 คือ มธ.100 – มธ.156",
                    "วิชาเลือก": "ในกรณีที่โครงสร้างหลักสูตรของคณะ/สาขาวิชากำหนดให้ศึกษาวิชาเลือกโดยให้นักศึกษาเลือกศึกษาจากวิชาของสาขาวิชาต่างๆ ได้ รวมไม่เกิน 4 สาขาวิชานั้น จะไม่นับรวมคณะ/สาขาวิชาที่นักศึกษาเลือกศึกษาเป็นวิชาเอก",
                    "การนับโครงสร้างวิชาโท": "ในกรณีหลักสูตรของคณะ/สาขาวิชาไม่ได้กำหนดให้นักศึกษาศึกษาวิชาโท ซึ่งอาจเป็นเพราะจำนวนหน่วยกิตที่กำหนดไว้ไม่ครบข้อกำหนดของวิชาโท แต่หากนักศึกษาศึกษารายวิชาต่างๆ ครบตามโครงสร้างหลักสูตรวิชาโท นักศึกษาก็จะได้รับการบันทึกวิชาโทนั้นๆ ลงในใบรับรองคะแนน (Transcript) ด้วย",
                    "การเรียนวิชาในหมวดพลานามัย": {
                        "กรณีเรียนเป็นวิชาศึกษาทั่วไปส่วนที่_2": "นักศึกษาจะเรียนได้ไม่เกิน 3 หน่วยกิต",
                        "กรณีเรียนเป็นวิชาศึกษาทั่วไปส่วนที่_2_มาแล้ว_3_หน่วยกิต": "จะเรียนวิชาในหมวดนี้ได้อีกไม่เกิน 3 หน่วยกิต"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 14,
        "details": [
            {
                "category": "มธ.124 สังคมกับเศรษฐกิจ",
                "subcategories": {
                    "รหัสวิชา": "มธ.124",
                    "ชื่อวิชาภาษาไทย": "สังคมกับเศรษฐกิจ",
                    "ชื่อวิชาภาษาอังกฤษ": "Society and Economy",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "แนวทางการศึกษาและการวิเคราะห์สังคม และเศรษฐกิจในฐานะที่วิชานี้เป็นการศึกษาทางด้านสังคมศาสตร์ แล้วนำสู่การวิเคราะห์วิวัฒนาการของสังคมและเศรษฐกิจที่เกิดขึ้นในภาพกว้างของโลกและของประเทศไทย โดยเน้นให้เห็นถึงอิทธิพลของวัฒนธรรมและสถาบันที่มีต่อระบบสังคมเศรษฐกิจ",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "To provide guidelines for the study and analysis of society and economy. To analyze social and economic evolution in Thailand and worldwide. To emphasize the influence of culture and institutions on the social and economic system."
                }
            },
            {
                "category": "มธ.311 บริการทางวิชาชีพแก่สังคม",
                "subcategories": {
                    "รหัสวิชา": "มธ.311",
                    "ชื่อวิชาภาษาไทย": "บริการทางวิชาชีพแก่สังคม",
                    "ชื่อวิชาภาษาอังกฤษ": "Professional Services to Society",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "การนำองค์ความรู้ทางวิชาชีพเฉพาะด้านที่ศึกษามาไปให้บริการแก่สังคม โดยการออกแบบและจัดทำโครงงานร่วมกับชุมชน บุคลากร/หน่วยงานที่เกี่ยวข้อง ภายใต้การนิเทศก์อย่างใกล้ชิดของอาจารย์ที่ได้รับมอบหมาย มุ่งเน้นการทำงานร่วมกันจากผู้ที่ศึกษาในวิชาชีพด้านเดียวกัน",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Application of specialist professional know-how gained through study to the service of society. This is done via designing and carrying out projects involving communities and related people and organisations, under the close supervision of an academic advisor. The focus is on collaboration among learners of the same profession."
                }
            },
            {
                "category": "มธ.312 โครงการรณรงค์เพื่อสังคม",
                "subcategories": {
                    "รหัสวิชา": "มธ.312",
                    "ชื่อวิชาภาษาไทย": "โครงการรณรงค์เพื่อสังคม",
                    "ชื่อวิชาภาษาอังกฤษ": "Social Project and Campaign",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชาภาษาไทย": "การบูรณาการความเชี่ยวชาญจากหลายวิชาชีพมาร่วมกันเพื่อจัดทำโครงการรณรงค์ในการแก้ไขปัญหาของสังคม และประเทศชาติอย่างเป็นรูปธรรม ผ่านกระบวนการทำงานเป็นกลุ่ม โดยมีเป้าหมายในการกระตุ้นความร่วมมือระหว่างสถาบันการศึกษา ชุมชน และหน่วยงานของรัฐ ในการดำเนินการสร้างแนวปฏิบัติที่พึงประสงค์ในสังคม หรือการปรับเปลี่ยนและลดเลิกแนวปฏิบัติที่ไม่พึงประสงค์ในสังคม มุ่งเน้นการทำงานร่วมกันจากผู้ที่ศึกษาในหลากหลายวิชาชีพ",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Integration of expertise and collaboration across a diverse spectrum of professions in order to organise a campaign for social and national issues, working as a team. The goal is to kickstart cooperation between educational institutions, communities and state bodies in building desirable social practices, or alteration or abandonment of undesirable ones, with a focus on collaboration among learners from a wide range of professions."
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 5,
        "details": [
            {
                "category": "หมวดมนุษยศาสตร์",
                "subcategories": {
                    "มธ.111": {
                        "ชื่อวิชา": "ประเทศไทยในมิติทางประวัติศาสตร์ สังคม และวัฒนธรรม",
                        "ชื่อภาษาอังกฤษ": "Thailand in Historical, Social and Cultural Perspective",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คณะที่รับผิดชอบ": "ศิลปศาสตร์"
                    },
                    "มธ.112": {
                        "ชื่อวิชา": "มรดกโลกก่อนสมัยใหม่",
                        "ชื่อภาษาอังกฤษ": "Heritage of the Pre-modern World",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คณะที่รับผิดชอบ": "ศิลปศาสตร์"
                    },
                    "มธ.113": {
                        "ชื่อวิชา": "ความรู้พื้นฐานทางปรัชญาและศาสนา",
                        "ชื่อภาษาอังกฤษ": "Fundamentals of Philosophy and Religions",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คณะที่รับผิดชอบ": "ศิลปศาสตร์"
                    },
                    "มธ.115": {
                        "ชื่อวิชา": "มนุษย์กับผลงานสร้างสรรค์ด้านวรรณกรรม",
                        "ชื่อภาษาอังกฤษ": "Man and his Literary Creativity",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คณะที่รับผิดชอบ": "ศิลปกรรมศาสตร์"
                    },
                    "มธ.116": {
                        "ชื่อวิชา": "มนุษย์กับศิลปะ ทัศนศิลป์ ดนตรี และศิลปะการแสดง",
                        "ชื่อภาษาอังกฤษ": "Man and Arts : Visual Art, Music and Performing Arts",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คณะที่รับผิดชอบ": "ศิลปกรรมศาสตร์"
                    },
                    "มธ.117": {
                        "ชื่อวิชา": "พัฒนาการของโลกสมัยใหม่",
                        "ชื่อภาษาอังกฤษ": "Development of the Modern World",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คณะที่รับผิดชอบ": "ศิลปศาสตร์"
                    }
                }
            },
            {
                "category": "หมวดวิทยาศาสตร์กับคณิตศาสตร์",
                "subcategories": {
                    "วิชาในกลุ่มวิทยาศาสตร์และเทคโนโลยี": {
                        "มธ.131": {
                            "ชื่อวิชา": "มนุษย์กับวิทยาศาสตร์กายภาพ",
                            "ชื่อภาษาอังกฤษ": "Man and Physical Science",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะที่รับผิดชอบ": "วิทยาศาสตร์ฯ"
                        },
                        "มธ.142": {
                            "ชื่อวิชา": "มนุษย์กับวิทยาศาสตร์ชีวภาพ",
                            "ชื่อภาษาอังกฤษ": "Man and Biological Science",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะที่รับผิดชอบ": "วิทยาศาสตร์ฯ"
                        },
                        "มธ.143": {
                            "ชื่อวิชา": "มนุษย์กับสิ่งแวดล้อม",
                            "ชื่อภาษาอังกฤษ": "Man and Environment",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะที่รับผิดชอบ": "วิทยาศาสตร์ฯ"
                        },
                        "วค.106": {
                            "ชื่อวิชา": "ความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน",
                            "ชื่อภาษาอังกฤษ": "Sustainability of Natural Resources and Energy",
                            "หน่วยกิต": "3 (3-0-6)",
                            "คณะที่รับผิดชอบ": "วิศวกรรมศาสตร์"
                        }
                    }
                }
            },
            {
                "category": "หมายเหตุ",
                "subcategories": {
                    "วิชากลาง": "คณะสามารถนำรายวิชาดังกล่าวไปออกแบบเนื้อหาสาระให้สอดคล้องกับศาสตร์ของคณะภายใต้ขอบเขตของคำอธิบายรายวิชา โดยคณะทำหน้าที่บริหาร และจัดการเรียนการสอนให้กับนักศึกษาเอง"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 33,
        "details": [
            {
                "category": "หมวดพลานามัย (Health Education)",
                "subcategories": {
                    "วฬ.211 กรีฑา 1": {
                        "ชื่อภาษาอังกฤษ": "SN211 Track and Field",
                        "หน่วยกิต": "(0-2-1)",
                        "คำอธิบายรายวิชา": "ทักษะพื้นฐานสำหรับนักกีฬากรีฑาประเภทลู่และลาน สมรรถภาพทางกาย การบาดเจ็บและความปลอดภัย กฏ กติกา มรรยาท สำหรับนักกีฬากรีฑาประเภทลู่และลาน และการเก็บรักษาอุปกรณ์",
                        "คำอธิบายภาษาอังกฤษ": "Basic skills for track and field athletes. Physical performance, injury and safety, rules, regulation and good habits for track and field athletes and equipment maintenance."
                    },
                    "วฬ.212 ว่ายน้ำ": {
                        "ชื่อภาษาอังกฤษ": "SN212 Swimming",
                        "หน่วยกิต": "(0-2-1)",
                        "คำอธิบายรายวิชา": "ทักษะพื้นฐานสำหรับนักกีฬากรีฑาว่ายน้ำ สมรรถภาพทางกาย การบาดเจ็บและความปลอดภัย กฏ กติกา มรรยาท สำหรับนักกีฬาว่ายน้ำ และการเก็บรักษาอุปกรณ์",
                        "คำอธิบายภาษาอังกฤษ": "Basic skills for swimming athletes. Physical performance, injury and safety, rules, regulation and good habits for swimming athletes and equipment maintenance."
                    },
                    "วฬ.213 ฟุตบอล": {
                        "ชื่อภาษาอังกฤษ": "SN213 Football",
                        "หน่วยกิต": "(0-2-1)",
                        "คำอธิบายรายวิชา": "ทักษะพื้นฐานสำหรับนักกีฬาฟุตบอล สมรรถภาพทางกาย การบาดเจ็บและความปลอดภัย กฏ กติกา มรรยาท สำหรับนักกีฬาฟุตบอล และการเก็บรักษาอุปกรณ์",
                        "คำอธิบายภาษาอังกฤษ": "Basic skills for football athletes. Physical performance, injury and safety, rules, regulation and good habits for football athletes and equipment maintenance."
                    },
                    "วฬ.214 บาสเกตบอล": {
                        "ชื่อภาษาอังกฤษ": "SN214 Basketball",
                        "หน่วยกิต": "(0-2-1)",
                        "คำอธิบายรายวิชา": "ทักษะพื้นฐานสำหรับนักกีฬาบาสเกตบอล สมรรถภาพทางกาย การบาดเจ็บและความปลอดภัย กฏ กติกา มรรยาท สำหรับนักกีฬาบาสเกตบอล และการเก็บรักษาอุปกรณ์",
                        "คำอธิบายภาษาอังกฤษ": "Basic skills for basketball athletes. Physical performance, injury and safety, rules, regulation and good habits for basketball athletes and equipment maintenance."
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 1,
        "details": [
            {
                "category": "ข้อมูลทั่วไป",
                "subcategories": {
                    "ชื่อหลักสูตร": "หลักสูตรวิชาศึกษาทั่วไป",
                    "ปีที่ปรับปรุง": "พ.ศ. 2561",
                    "สถาบัน": "มหาวิทยาลัยธรรมศาสตร์"
                }
            },
            {
                "category": "โครงสร้างหลักสูตร",
                "subcategories": {
                    "จำนวนหน่วยกิตรวม": "รอข้อมูลเพิ่มเติม",
                    "กลุ่มวิชา": "รอข้อมูลเพิ่มเติม"
                }
            },
            {
                "category": "รายวิชา",
                "subcategories": {
                    "กลุ่มวิชามนุษยศาสตร์": "รอข้อมูลเพิ่มเติม",
                    "กลุ่มวิชาสังคมศาสตร์": "รอข้อมูลเพิ่มเติม",
                    "กลุ่มวิชาวิทยาศาสตร์และคณิตศาสตร์": "รอข้อมูลเพิ่มเติม",
                    "กลุ่มวิชาภาษา": "รอข้อมูลเพิ่มเติม"
                }
            },
            {
                "category": "วัตถุประสงค์ของหลักสูตร",
                "subcategories": {
                    "วัตถุประสงค์_1": "รอข้อมูลเพิ่มเติม",
                    "วัตถุประสงค์_2": "รอข้อมูลเพิ่มเติม",
                    "วัตถุประสงค์_3": "รอข้อมูลเพิ่มเติม"
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 22,
        "details": [
            {
                "category": "วิชาพื้นฐาน",
                "subcategories": {
                    "มธ.155_สถิติพื้นฐาน": {
                        "รหัสวิชา": "มธ.155",
                        "ชื่อวิชาภาษาไทย": "สถิติพื้นฐาน",
                        "ชื่อวิชาภาษาอังกฤษ": "Elementary Statistics",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "ลักษณะปัญหาทางสถิติ ทบทวนสถิติเชิงพรรณนา ความน่าจะเป็น ตัวแปรสุ่มและการแจกแจงของตัวแปรสุ่ม ทวินาม ปัวซง และปกติ เทคนิคการชักตัวอย่างและการแจกแจงของตัวสถิติ การประมาณค่า และการทดสอบสมมุติฐาน เกี่ยวกับค่าเฉลี่ยประชากรกลุ่มเดียวและสองกลุ่ม การวิเคราะห์ความแปรปรวนจำแนกทางเดียว การวิเคราะห์การถดถอยและสหสัมพันธ์เชิงเส้นเชิงเดียว การทดสอบไคกำลังสอง",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "To identify the Nature of statistical problems; review of descriptive statistics; probability; random variables and some probability distributions (binomial, poison and normal); elementary sampling and sampling distributions; estimation and hypotheses testing for one and two populations; one-way analysis of variance; simple linear regression and correlation; chi-square test."
                    },
                    "มธ.156_คอมพิวเตอร์และการเขียนโปรแกรมเบื้องต้น": {
                        "รหัสวิชา": "มธ.156",
                        "ชื่อวิชาภาษาไทย": "คอมพิวเตอร์และการเขียนโปรแกรมเบื้องต้น",
                        "ชื่อวิชาภาษาอังกฤษ": "Introduction to Computers and Programming",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "หลักการพื้นฐานของระบบคอมพิวเตอร์ หลักการการประมวลผลข้อมูลอิเลคทรอนิกส์ ซอฟต์แวร์ระบบและซอฟต์แวร์ประยุกต์ ขั้นตอนวิธี ผังงาน การแทนข้อมูล วิธีการการออกแบบและพัฒนาโปรแกรม การแก้ปัญหาด้วยภาษาโปรแกรมระดับสูง",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Basic concepts of computer systems, electronic data processing concepts, system and application software, algorithms, flowcharts, data representation, program design and development methodology, problem solving using high-level language programming."
                    },
                    "วท.142_คณิตศาสตร์สำหรับวิทยาศาสตร์": {
                        "รหัสวิชา": "วท.142",
                        "ชื่อวิชาภาษาไทย": "คณิตศาสตร์สำหรับวิทยาศาสตร์",
                        "ชื่อวิชาภาษาอังกฤษ": "Mathematics for Science",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "เมทริกซ์ ดีเทอร์มิแนนต์ วิธีหาผลเฉลยของระบบสมการเชิงเส้น อนุพันธ์ของฟังก์ชันพีชคณิตและฟังก์ชันอดิศัย ค่าสูงสุดและค่าต่ำสุดของฟังก์ชัน ปริพันธ์และเทคนิคการหาปริพันธ์ อนุกรมอนันต์และการทดสอบการลู่เข้าของอนุกรมอนันต์ สมการเชิงอนุพันธ์สามัญอันดับที่หนึ่ง",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "To find out matrices, determinants, methods for finding solutions of system of linear equations, derivatives of algebraic functions and transcendental functions, maximum and minimum of functions, integrals and techniques of integrations, series and convergence tests for series, first order ordinary differential equations."
                    }
                }
            },
            {
                "category": "หมวดภาษา",
                "subcategories": {
                    "มธ.050_การพัฒนาทักษะภาษาอังกฤษ": {
                        "รหัสวิชา": "มธ.050",
                        "ชื่อวิชาภาษาไทย": "การพัฒนาทักษะภาษาอังกฤษ",
                        "ชื่อวิชาภาษาอังกฤษ": "English Skill Development",
                        "หน่วยกิต": "3 (3-0-6) ไม่นับหน่วยกิต",
                        "คำอธิบายรายวิชา": "ฝึกทักษะภาษาอังกฤษในระดับเบื้องต้น ได้แก่ การฟัง การพูด การอ่าน การเขียน เชิงบูรณาการ เพื่อเป็นพื้นฐานในการพัฒนาทักษะภาษาอังกฤษระดับต่อไป",
                        "คำอธิบายรายวิชาภาษาอังกฤษ": "Practice basic English skills including listening, speaking, reading, and writing in an integrated manner to serve as a foundation for further English skill development."
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 20,
        "details": [
            {
                "category": "วิชา วท.142 มนุษย์กับสิ่งแวดล้อม",
                "subcategories": {
                    "รหัสวิชา": "วท.142",
                    "ชื่อวิชา": "มนุษย์กับสิ่งแวดล้อม",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา": "พื้นฐานทางด้านระบบนิเวศทั้งในระบบธรรมชาติและระบบมนุษย์สร้างขึ้น วัฏจักรชีวธรณีเคมี ปฏิสัมพันธ์ระหว่างสังคมมนุษย์และสิ่งแวดล้อมของโลก ผลกระทบของวิทยาศาสตร์และเทคโนโลยีที่มีต่อประชากรมนุษย์ ระบบนิเวศธรรมชาติ ความหลากหลายทางชีวภาพ มลพิษ การเปลี่ยนแปลงสภาพภูมิอากาศ ขยะมูลฝอย ของเสียอันตราย และภัยพิบัติ",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "Fundamentals of natural and man-made ecosystem, biogeochemical cycles, interaction between human society and global environment. Topics include the impacts of science and technology on human population, natural ecosystems, biodiversity, pollution, climate change, solid and hazardous waste and disaster"
                }
            },
            {
                "category": "วิชา วค.106 ความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน",
                "subcategories": {
                    "รหัสวิชา": "วค.106",
                    "ชื่อวิชา": "ความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน",
                    "หน่วยกิต": "3 (3-0-6)",
                    "คำอธิบายรายวิชา": "พื้นฐานเกี่ยวกับนิเวศวิทยา เพื่อประโยชน์สำหรับการอนุรักษ์ทรัพยากรธรรมชาติ และสิ่งแวดล้อม ลักษณะของมลพิษสิ่งแวดล้อมและผลกระทบต่อสังคม แนวคิดต่างๆ เกี่ยวกับความยั่งยืนทางทรัพยากรธรรมชาติและพลังงาน การวิเคราะห์ การตัดสินใจ จริยธรรมสิ่งแวดล้อม การออกแบบที่ยั่งยืน การใช้พลังงานของประเทศไทย การใช้พลังงานในภาคการขนส่ง การใช้พลังงานในภาคอุตสาหกรรม และอาคารธุรกิจ แนวทางการพัฒนาพลังงานที่ยั่งยืนสำหรับประเทศไทย การผลิตไฟฟ้าสำหรับประเทศไทย การประหยัดพลังงาน พลังงานทางเลือก พลังงานแสงอาทิตย์ ชีวมวลเพื่อพลังงาน การผลิตเอทานอล การผลิตไบโอดีเซล เทคโนโลยีถ่านหินสะอาด พลังงานนิวเคลียร์",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "To examine basic ecology for the benefit of the conservation of natural resources. The course also focuses on: characteristics of environmental pollution and social impacts on society; the concepts about sustainability of natural resources and energy analysis; decision making, ethical issues related to the environment, and sustainable design. The topic also concerns energy consumption in Thailand in various aspects, such as: transportation, industry, and office buildings. Another focus includes: guidelines for sustainable energy development in Thailand regarding electricity generation, energy conservation, alternative energy, solar energy, biomass for energy, ethanol production, biodiesel production, clean coal technology, and nuclear energy."
                }
            },
            {
                "category": "วิชา มธ.151 คณิตศาสตร์ทั่วไประดับมหาวิทยาลัย",
                "subcategories": {
                    "รหัสวิชา": "มธ.151",
                    "ชื่อวิชา": "คณิตศาสตร์ทั่วไประดับมหาวิทยาลัย",
                    "หน่วยกิต": "3 (3-0-6)",
                    "หมายเหตุ": "ไม่นับหน่วยกิตให้กับนักศึกษาที่มีรหัสคณะ 02, 04 และตั้งแต่ 09 ถึง 14,16,17",
                    "คำอธิบายรายวิชา": "เซต ระบบจำนวนจริง ความสัมพันธ์ ฟังก์ชันและการประยุกต์ ความรู้เบื้องต้นของกำหนดการเชิงเส้น ตรรกวิทยา การคำนวณดอกเบี้ย เงินผ่อนรายงวดและภาษีเงินได้ สถิติเชิงพรรณนา เลขดัชนี ความน่าจะเป็นเบื้องต้น แนวคิดสถิติเชิงอนุมานเบื้องต้น โปรแกรมสำเร็จรูปทางสถิติ",
                    "คำอธิบายรายวิชาภาษาอังกฤษ": "To review Set; real number system; relations; functions and applications; introduction to linear programming; logic; measurement of interest; installment payment and income tax; descriptive statistics; index number; introduction to probability; basic concept of inferential statistics; statistical packages."
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 16,
        "details": [
            {
                "category": "หมวดมนุษยศาสตร์ (Humanities)",
                "subcategories": {
                    "มธ.102 ทักษะชีวิตทางสังคม": {
                        "ชื่อภาษาอังกฤษ": "TU102 Social Life Skills",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": {
                            "ภาษาไทย": "การดูแลสุขภาพตนเองแบบองค์รวม ทั้งทางด้านร่างกาย อารมณ์ สังคม และจิตวิญญาณ ซึ่งเป็นทักษะสำคัญที่จะช่วยให้ประสบความสำเร็จและใช้ชีวิตในสังคมอย่างเป็นสุข ด้วยการพัฒนาความสามารถในการดูแลสุขภาพทางกาย การจัดการความเครียด การสร้างความมั่นคงทางอารมณ์ การเข้าใจตนเองและการปรับตัวเมื่อเผชิญกับปัญหาทางด้านจิตใจ อารมณ์ และสังคม การเข้าใจความหมายของสุนทรียศาสตร์ การได้รับประสบการณ์และความซาบซึ้งในความสัมพันธ์ระหว่างศิลปะกับมนุษย์ในแขนงต่างๆ ทั้งทัศนศิลป์ ดนตรี ศิลปะการแสดง และสถาปัตยกรรม",
                            "ภาษาอังกฤษ": "Holistic health care, addressing the physical, emotional, social, and spiritual needs, which is considered important skills for success in leading a happy life in society. Students learn to develop their ability in physical health care to manage stress, build emotional security, understand themselves and adapt to psychological, emotional and social problems. Students also learn to understand the meaning of aesthetics, experiencing and appreciating the relationship between art and humanity in different fields, namely visual arts, music, performing arts and architecture."
                        }
                    },
                    "มธ.108 การพัฒนาและจัดการตนเอง": {
                        "ชื่อภาษาอังกฤษ": "TU108 Self Development and Management",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": {
                            "ภาษาไทย": "การจัดการและการปรับเข้ากับชีวิตในรั้วมหาวิทยาลัย ท่ามกลางความหลากหลายและเสรีภาพ การพัฒนาทักษะทางสังคมและความฉลาดทางอารมณ์ การเข้าใจตนเองและการวางแผนอนาคต การพัฒนาการเรียนรู้ตลอดชีวิต และการอยู่ร่วมกับผู้อื่นอย่างสงบสุขและเคารพซึ่งกันและกัน",
                            "ภาษาอังกฤษ": "Coping with and adaptation to university life. Development of social skill and emotional intelligence. Self understanding and planning for the future. Personality and social etiquette. Learning to live harmoniously and respectfully with others and the society."
                        }
                    },
                    "มธ.111 ประเทศไทยในมิติทางประวัติศาสตร์ สังคม และวัฒนธรรม": {
                        "ชื่อภาษาอังกฤษ": "TU 111 Thailand in Historical, Social and Cultural Perspective",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": {
                            "ภาษาไทย": "ภูมิหลังของสังคม วัฒนธรรม และภูมิปัญญาไทย ตั้งแต่อดีต สยามประเทศ จนถึงประเทศไทย มุ่งเน้นประเด็นการสร้างเอกลักษณ์ไทย และทิศทางการพัฒนาของสังคมและวัฒนธรรมไทย ในบริบทแห่งโลกาภิวัตน์ \"มีการศึกษานอกสถานที่\"",
                            "ภาษาอังกฤษ": "To explore Thai social, cultural and intellectual backgrounds from the old days (known as the Kingdom of Siam) until today. To emphasize the formation of the Thai identity as well as directions towards the development of Thai culture and society in the globalization context. (Field trips are obligatory)"
                        }
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 18,
        "details": [
            {
                "category": "หมวดมนุษยศาสตร์",
                "subcategories": {
                    "มธ.117 พัฒนาการของโลกสมัยใหม่": {
                        "รหัสวิชา": "TU 117",
                        "ชื่อภาษาอังกฤษ": "Development of the Modern World",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "พัฒนาการของสังคมโลก ตั้งแต่ ค.ศ.1500 เป็นต้นมาจนถึงปัจจุบัน โดยเน้นความสัมพันธ์ทางด้านเศรษฐกิจ การเมือง การปกครอง สังคม วัฒนธรรม วิทยาศาสตร์และเทคโนโลยี อันเป็นพื้นฐานแห่งการเปลี่ยนแปลงของโลกเข้าสู่สมัยใหม่",
                        "คำอธิบายภาษาอังกฤษ": "To study the development of world societies from 1500 A.D. to the present. An emphasis is placed upon the relationship of economy, political system, administration, society, culture, science and technology, leading to modern world changes."
                    }
                }
            },
            {
                "category": "หมวดวิทยาศาสตร์กับคณิตศาสตร์",
                "subcategories": {
                    "มธ.103 ชีวิตกับความยั่งยืน": {
                        "รหัสวิชา": "TU103",
                        "ชื่อภาษาอังกฤษ": "Life and Sustainability",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "การดำเนินชีวิตอย่างเท่าทันกับการเปลี่ยนแปลงของโลก เข้าใจความสัมพันธ์ระหว่างพลวัตของธรรมชาติ มนุษย์ และสรรพสิ่ง ทั้งสิ่งแวดล้อมสรรสร้าง การใช้พลังงาน เศรษฐกิจ สังคมในความขัดแย้งและการแปรเปลี่ยน ตลอดจนองค์ความรู้ทางวิทยาศาสตร์สิ่งแวดล้อม ที่นำไปสู่การปรับเปลี่ยนวิถีชีวิตสู่ความยั่งยืน",
                        "คำอธิบายภาษาอังกฤษ": "This course provides an introduction to the importance of life-cycle systems perspectives in understanding major challenges and solutions to achieving more sustainable societies in this changing world. Students will learn about the relationship between mankind and the environment in the context of energy and resource use, consumption and development, and environmental constraints. Furthermore, an examination of social conflict and change from the life-cycle perspective will be used to develop an understanding of potential solution pathways for sustainable lifestyle modifications."
                    },
                    "มธ.107 ทักษะดิจิทัลกับการแก้ปัญหา": {
                        "รหัสวิชา": "TU107",
                        "ชื่อภาษาอังกฤษ": "Digital Skill and Problem Solving",
                        "หน่วยกิต": "3 (3-0-6)",
                        "คำอธิบายรายวิชา": "ทักษะการคิดเชิงคำนวณเพื่อการแก้ปัญหาและการพัฒนาโอกาสใหม่ด้านสังคมและเศรษฐกิจ ความสามารถในค้นหาและการเข้าถึงสารสนเทศได้อย่างมีประสิทธิภาพ การประเมินความน่าเชื่อถือของ",
                        "คำอธิบายภาษาอังกฤษ": "Information not provided in the reference document"
                    }
                }
            }
        ]
    },
    {
        "link": "https://iem.engr.tu.ac.th/wp-content/uploads/2022/07/General-Education-Program-2561.pdf",
        "document": "General-Education-Program-2561",
        "page": 2,
        "details": [
            {
                "category": "หลักสูตรวิชาศึกษาทั่วไป",
                "subcategories": {
                    "ชื่อหลักสูตร": {
                        "ภาษาไทย": "หลักสูตรวิชาศึกษาทั่วไป",
                        "ภาษาอังกฤษ": "General Education Program"
                    },
                    "หน่วยงานที่รับผิดชอบ": "กองบริการวิชาการ มหาวิทยาลัยธรรมศาสตร์ ศูนย์รังสิต",
                    "จำนวนหน่วยกิต": "ไม่น้อยกว่า 30 หน่วยกิต",
                    "สถานภาพของหลักสูตร": {
                        "ประเภท": "เป็นการปรับปรุงหลักสูตรเดิม ฉบับ พ.ศ. 2558",
                        "การใช้งาน": "กำหนดให้ใช้กับหลักสูตรระดับปริญญาตรีทุกหลักสูตร",
                        "เริ่มใช้": "ภาคการศึกษาที่ 1 ปีการศึกษา 2561 เป็นต้นไป",
                        "การอนุมัติ": {
                            "หน่วยงาน": "สภามหาวิทยาลัย",
                            "ครั้งที่": "7/2561",
                            "วันที่": "23 กรกฏาคม 2561"
                        }
                    },
                    "สถานที่จัดการเรียนการสอน": [
                        "มหาวิทยาลัยธรรมศาสตร์ ท่าพระจันทร์",
                        "ศูนย์รังสิต",
                        "ศูนย์ลำปาง",
                        "ศูนย์พัทยา"
                    ],
                    "ปรัชญาการศึกษา": {
                        "เป้าหมาย": "เพื่อให้นักศึกษาที่ได้ศึกษาวิชาศึกษาทั่วไปมีคุณลักษณะที่พึงประสงค์ในศตวรรษที่ 21",
                        "วิธีการจัดการเรียนการสอน": [
                            "เน้นการพัฒนาศักยภาพการเรียนรู้ด้วยตนเอง",
                            "จุดประกาย มีแรงบันดาลใจใฝ่รู้",
                            "ผ่านกิจกรรม กรณีศึกษาให้ฝึกคิด วิเคราะห์ ค้นอย่างมีวิจารณญาณ",
                            "การเรียนความรู้จากสื่อแขนงต่างๆ เป็นหลัก"
                        ],
                        "เสาหลัก": [
                            "ทันโลก ทันสังคม (Global Mindset)",
                            "ทักษะชีวิตทางสังคม สุนทรียะในหัวใจ, สุขภาพกายใจ (Soft Skills)",
                            "จิตวิญญาณธรรมศาสตร์ มีประชาธิปไตย เสรีภาพ เป็นธรรม จิตอาสา (Spirit of Thammasat)"
                        ],
                        "เป้าหมายสุดท้าย": "เตรียมความพร้อมให้กับนักศึกษาก่อนสำเร็จการศึกษาออกไปเป็นบัณฑิตเพื่อรับใช้สังคมต่อไป"
                    }
                }
            }
        ]
    }
]